Autodesk.AutoCAD.DatabaseServices.WblockNoticeEventArgs
This class provides data for the WblockNotice event of the database.

Autodesk.AutoCAD.DatabaseServices.WblockNoticeEventArgs.From
Gets the source database.

Autodesk.AutoCAD.DatabaseServices.WblockNoticeEventArgs.To
Obsolete Gets the database being written to.