Autodesk.AutoCAD.DatabaseServices.Polyline2d
This .NET class wraps the AcDb2dPolyline ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.ConvertToPolyType(Autodesk.AutoCAD.DatabaseServices.Poly2dType)
Uses the SplineFit() and/or CurveFit() methods to convert the polyline to the type specified by the newType argument value.
newVal:  Input type to which the polyline should be converted

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Straighten
Removes all spline and curve-fit vertices from the polyline and sets all remaining vertices to be simple vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.SplineFit
Removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.CurveFit
Creates a smooth curve consisting of pairs of arcs joining each pair of vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.NonDBAppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
Appends the Vertex2d object to the vertex list of the polyline, establishes the polyline as the vertex's owner.
vertexToAppend:  Input the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline2d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
Appends the Vertex2d object to the vertex list of the polyline, establishes the polyline as the vertex's owner, and adds the vertex the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
vertexToAppend:  Input the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline2d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Vertex2d)
Inserts the Vertex2d object pointed to by newVertex into the vertex list of the polyline just after indexVertex.
newVertex:  Input vertex to be inserted
indexVertex:  Input vertex in polyline after which the new vertex is to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline2d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.Vertex2d,Autodesk.AutoCAD.DatabaseServices.Vertex2d)
Inserts the Vertex2d object pointed to by newVertex into the vertex list of the polyline just after the Vertex2d object with objectId vertexId, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
newVertex:  Input pointer to vertex to be inserted
vertexId:  Input objectId of the vertex in the polyline after which the new vertex is to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline2d.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.VertexPosition(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
Returns the WCS coordinate position value of vert.
vertex:  Input vertex object to get the WCS coordinate for

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Length
Accesses the total length of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.ConstantWidth
Accesses the width of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.LinetypeGenerationOn
Assesses if linetype generation is turned on for the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Elevation
Accesses the elevation of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Normal
Accesses the normal vector of the plane containing the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Thickness
Accesses the thickness for the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.DefaultEndWidth
Accesses the default polyline segment ending width value for the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.DefaultStartWidth
Accesses the default polyline segment starting width value for the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.Closed
Assesses if the polyline is to be closed (a line segment will be drawn between the last vertex and the first vertex to form a closed polygon).

Autodesk.AutoCAD.DatabaseServices.Polyline2d.PolyType
Accesses the Poly2dType, which indicates the curve/spline-fit type for this polyline.