Autodesk.AutoCAD.DatabaseServices.ObjectContext
This .NET class wraps the AcDbObjectContext ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ObjectContext.CollectionName
Accesses the name of the containing collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContext.UniqueIdentifier
Accesses the unique context identifier
The unique identifier should be invariant for the lifetime of this object and is unique amongst all instances of the context object type within an ObjectContextCollection.

Autodesk.AutoCAD.DatabaseServices.ObjectContext.Name
Accesses the name of the object context.