Autodesk.AutoCAD.DatabaseServices.ViewBorder
The ViewBorder class represents the border entity used by model documentation views in association with a Viewport entity.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.GetSourceType
Gets the SourceType of the model documentation view - undefined, Inventor, Fusion, or model space.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.GetViewStyleType
Gets the style type of the model documentation view -- from the base view, wireframe with visible edges, wireframe with hidden edges, shaded with visible edges, or shaded with hidden edges.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.ShadedDPI
Gets the DPI of the image generated for the shaded view style.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.Scale
Gets the scale used by the model documentation view.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.RotationAngle
Gets the rotation angle (in radians) of the model documentation view in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.ViewportId
Returns the ObjectID of the associated model documentation view's Viewport entity.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.IsFirstAngleProjection
to indicate whether the projection type is first angle or third angle.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.InventorFileReference
This method wraps AcDbViewBorder::inventorFileReference method.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.Width
Gets the width of the model documentation view border.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.Height
Gets the height of the model documentation view border.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.InsertionPoint
Gets the center of the view border in WCS coordinates (in paperspace).