Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator
This .NET class wraps the AcDbBlockTableRecordIterator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecordEnumerator.MoveNext
This function returns true if the enumerator has been positioned past either end of the block.