Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations
This class contains SurfaceSurfaceIntersectorConfiguration objects that describe the left and right surface configuration data for each of two intersecting surfaces.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.IsEqualTo(Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations)
Compares this object with a and returns true if they are equal.
a:  Input object to compare against

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.op_Inequality(Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations,Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.op_Equality(Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations,Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.Dimension
Returns the Dimension property value.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.IntersectionType
Returns the type of intersection.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface2Right
Returns the Surface2Right property value.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface1Right
Returns the Surface1Right property value.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface2Left
Returns the Surface2Left property value.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface1Left
Returns the Surface1Left property value.