Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters
AssocArrayPathParameters wraps the ObjectARX AcDbAssocArrayPathParameters class.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double)
Parameterized constructor.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetItemCount(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.SetItemCount(System.Int32,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPathParameters::setItemCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetItemSpacing(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.SetItemSpacing(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPathParameters::setItemSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetStartOffset(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPathParameters::startOffset() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.SetStartOffset(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPathParameters::setStartOffset() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetEndOffset(System.String&,System.String&)
Wraps the ObjectARX the ObjectARX AcDbAssocArrayPathParameters::endOffset() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.SetEndOffset(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPathParameters::setEndOffset() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.PathDirection
Wraps the ObjectARX AcDbAssocArrayPathParameters::setPathDirection() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.EndOffset
Wraps the ObjectARX AcDbAssocArrayPathParameters::endOffset() and AcDbAssocArrayPathParameters::setEndOffset() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.StartOffset
Wraps the ObjectARX AcDbAssocArrayPathParameters::startOffset() and AcDbAssocArrayPathParameters::setStartOffset() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.AlignItems
Wraps the ObjectARX AcDbAssocArrayPathParameters::alignItems()
and AcDbAssocArrayPathParameters::setAlignItems() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.Path
Wraps the ObjectARX AcDbAssocArrayPathParameters::path() and AcDbAssocArrayPathParameters::setPath() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.ItemSpacing
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemSpacing() and AcDbAssocArrayPathParameters::setItemSpacing() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.ItemCount
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemCount() and AcDbAssocArrayPathParameters::setItemCount() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.Method
Wraps the ObjectARX AcDbAssocArrayPathParameters::method() and AcDbAssocArrayPathParameters::setMethod() methods.