Autodesk.AutoCAD.DatabaseServices.Dimension
This .NET class wraps the AcDbDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Dimension.ResetTextDefinedSize
Sets dimension text defined width and defined height to zero.

Autodesk.AutoCAD.DatabaseServices.Dimension.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Copies the dimension variable information in the DimStyleTableRecord identified by style into the database on which this method is called, making those dimension variable values current for the database.
style:  Input object ID of DimStyleTableRecord from which to copy dimension variable information

Autodesk.AutoCAD.DatabaseServices.Dimension.GetDimstyleData
Copies the dimstyle information from the DimStyleTableRecord referenced by the current dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.RecomputeDimensionBlock(System.Boolean)
Updates the block table record the dimension references to match any changes made to the dimension since the last time the block table record was updated.
If forceUpdate is true, then the block table record will be updated regardless of whether or not the dimension has had any changes since the last time the block table record was updated.
forceUpdate:  Boolean indicating whether or not to force an update on screen

Autodesk.AutoCAD.DatabaseServices.Dimension.GenerateLayout
Updates the dimension according to the current dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.RemoveTextField
If this object contains a text field, this function removes it from the extension dictionary and deletes the field object.

Autodesk.AutoCAD.DatabaseServices.Dimension.FieldToMText(Autodesk.AutoCAD.DatabaseServices.MText)
If this object contains a text field, this function copies the field and adds the copy to dimMText.
dimMText:  MText object to which the new field will be attached

Autodesk.AutoCAD.DatabaseServices.Dimension.FieldFromMText(Autodesk.AutoCAD.DatabaseServices.MText)
If dimMText contains a text field, this function copies that field and adds the copy to this object.
dimMText:  The MText object from which the text field is copied

Autodesk.AutoCAD.DatabaseServices.Dimension.FormatMeasurement(System.Double,System.String)
Provides access to the dimension classes' text assembly and formatting logic.
measurement:  Input measurement value.
dimensionText:  Input alternate value.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltmzf
This is Dimaltmzf, a member of class Dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimmzf
This is Dimmzf, a member of class Dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltmzs
This is Dimaltmzs, a member of class Dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimmzs
This is Dimmzs, a member of class Dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimblk2
Accesses the current DIMBLK2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimblk1
Accesses the current DIMBLK1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimblk
Accesses the current DIMBLK value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimpost
Accesses the character string that is the current DIMPOST value for the datatbase.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimapost
Accesses the current DIMAPOST value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimzin
Accesses the current DIMZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimupt
Accesses the current DIMUPT value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtzin
Accesses the current DIMTZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtxtdirection
This is Dimtxtdirection, a member of class Dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtxt
Accesses the current DIMTXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextStyleId
This is TextStyleId, a member of class Dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtvp
Accesses the current DIMTVP value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtsz
Accesses the current DIMTSZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtp
Accesses the current DIMTP value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtolj
Accesses the current DIMTOLJ value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtol
Accesses the current DIMTOL value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtoh
Accesses the current DIMTOH value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtofl
Accesses the current DIMTOFL value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtmove
Accesses the current DIMTMOVE value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtm
Accesses the current DIMTM value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtix
Accesses the current DIMTIX value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtih
Accesses the current DIMTIH value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfillclr
Accesses the current dimension background color (if dimtfill is set to 1).

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfill
Accesses the dimension background color state, which can be one of the following values:
0 means the background color is disabled
1 means the use background color from dimtfillclr
2 means the use drawing's background color.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtfac
Accesses the current DIMTFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtdec
Accesses the current DIMTDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimtad
Accesses the current DIMTAD value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsoxd
Accesses the current DIMSOXD value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimse2
Accesses the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimse1
Accesses the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsd2
Accesses the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsd1
Accesses the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimscale
Accesses the current DIMSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimsah
Accesses current DIMSAH value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimrnd
Accesses the current DIMRND value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimensionStyleName
Specifies name of associated dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.CenterMarkSize
Specifies the size of the center mark for radial and diameter dimensions.

Autodesk.AutoCAD.DatabaseServices.Dimension.CenterMarkType
Specifies the type of center mark for radial and diameter dimensions.

Autodesk.AutoCAD.DatabaseServices.Dimension.ToleranceSuppressZeroInches
Specifies the suppression of a zero inches.

Autodesk.AutoCAD.DatabaseServices.Dimension.ToleranceSuppressZeroFeet
Specifies the suppression of a zero feet.

Autodesk.AutoCAD.DatabaseServices.Dimension.ToleranceSuppressTrailingZeros
Specifies the suppression of trailing zeroes.

Autodesk.AutoCAD.DatabaseServices.Dimension.ToleranceSuppressLeadingZeros
Specifies the suppression of leading zeroes.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltToleranceSuppressZeroInches
Specifies the suppression of a zero inch measurement in alternate tolerance values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltToleranceSuppressZeroFeet
Specifies the suppression of a zero foot measurement in alternate tolerance values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltToleranceSuppressTrailingZeros
Specifies the suppression of trailing zeros in alternate tolerance values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltToleranceSuppressLeadingZeros
Specifies the suppression of leading zeros in alternate dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltSuppressZeroInches
Specifies the suppression of a zero inch measurement in alternate dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltSuppressZeroFeet
Specifies the suppression of a zero foot measurement in alternate dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltSuppressTrailingZeros
Specifies the suppression of trailing zeros in alternate dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AltSuppressLeadingZeros
Specifies the suppression of leading zeros in alternate dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.AlternateSuffix
Specifies a suffix for the alternate dimension measurement for all dimension types except angular.

Autodesk.AutoCAD.DatabaseServices.Dimension.AlternatePrefix
Specifies a prefix for the alternate dimension measurement for all dimension types except angular.

Autodesk.AutoCAD.DatabaseServices.Dimension.SuppressZeroInches
Specifies the suppression of a zero inch measurement in dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.SuppressZeroFeet
Specifies the suppression of a zero foot measurement in dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.SuppressTrailingZeros
Specifies the suppression of leading zeros in dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.SuppressLeadingZeros
Specifies the suppression of leading zeros in dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.SuppressAngularTrailingZeros
Specifies the suppression of trailing zeros in dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.SuppressAngularLeadingZeros
Specifies the suppression of leading zeros in dimension values.

Autodesk.AutoCAD.DatabaseServices.Dimension.Suffix
Specifies the dimension value suffix.

Autodesk.AutoCAD.DatabaseServices.Dimension.Prefix
Specifies the dimension value prefix.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlwe
Accesses the current DIMLWE value for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlwd
Accesses the current DIMLWD value for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlunit
Accesses the current DIMLUNIT value for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimltype
Accesses the dimension linetype.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimltex2
Accesses the object ID of the linetype of extension line 2.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimltex1
Accesses the object ID of the linetype of extension line 1.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlim
Accesses the current DIMLIM value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimlfac
Accesses the current DIMLFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimldrblk
Accesses the object ID of the block reference specified by the current DIMLDRBLK value of the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimjust
Accesses the current DIMJUST value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimjogang
Accesses the current large radial angle.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimgap
Accesses the current DIMGAP value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimfxlen
Accesses the fixed extension lines value.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimfxlenOn
Accesses a value that indicates whether the fixed extension lines are on.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimfrac
Accesses the current DIMFRAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimexo
Accesses the current DIMEXO value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimexe
Accesses the current DIMEXE value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdsep
Accesses the current DIMDSEP value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdli
Accesses the current DIMDLI value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdle
Accesses the current DIMDLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimdec
Accesses the current DIMDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimclrt
Accesses the current DIMCLRT value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimclre
Accesses the current DIMCLRE value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimclrd
Accesses the current DIMCLRD value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimcen
Accesses the current DIMCEN value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimazin
Accesses the current DIMAZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaunit
Accesses the current DIMAUNIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimatfit
Accesses the current DIMATFIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimasz
Accesses the current DIMASZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimarcsym
Accesses the arc length placement value.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltz
Accesses the current DIMALTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltu
Accesses the current DIMALTU value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimalttz
Accesses the current DIMALTTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimalttd
Accesses the current DIMALTTD value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltrnd
Accesses the current DIMALTRND value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltf
Accesses the current DIMALTF value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimaltd
Accesses the current DIMALTD value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimalt
Accesses the current DIMALT value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.Dimadec
Accesses the current DIMADEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Dimension.DynamicDimension
Assesses if the dimension is dynamic.

Autodesk.AutoCAD.DatabaseServices.Dimension.Measurement
Accesses the current measurement value.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimBlockPosition
Accesses the relative position point of the block referenced by the dimension (in WCS coordinates).

Autodesk.AutoCAD.DatabaseServices.Dimension.DimBlockId
Accesses the object ID of the BlockTableRecord containing the entities that this dimension displays.

Autodesk.AutoCAD.DatabaseServices.Dimension.HorizontalRotation
Accesses the horizontal rotation value (in radians) of the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextLineSpacingFactor
Accesses the line spacing factor (a value between 0.25 and 4.00).

Autodesk.AutoCAD.DatabaseServices.Dimension.TextLineSpacingStyle
Accesses the line spacing style for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextAttachment
Accesses the attachment point value for the text of the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimensionStyle
Accesses the object ID of the DimStyleTableRecord referenced by the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextRotation
Accesses the rotation angle (in radians) of to the horizontal axis used by the text.

Autodesk.AutoCAD.DatabaseServices.Dimension.DimensionText
Accesses the user-supplied dimension annotation text string (including any multiline text formatting characters).

Autodesk.AutoCAD.DatabaseServices.Dimension.Elevation
Accesses the dimension's elevation value.

Autodesk.AutoCAD.DatabaseServices.Dimension.Normal
Accesses the unit normal vector (in WCS coordinates) for the dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.UsingDefaultTextPosition
Returns true if the text is in the default position.

Autodesk.AutoCAD.DatabaseServices.Dimension.TextPosition
Accesses the text position of the text (which is itself an MText object with middle-center justification).

Autodesk.AutoCAD.DatabaseServices.Dimension.TextDefinedSize
Specifies the dimension text defined width and defined height from MText in dimension block.