Autodesk.AutoCAD.DatabaseServices.TextEditorSelection
This wraps the ObjectARX AcDbTextEditorSelection class.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.Stack
This wraps the ObjectARX AcDbTextEditorSelection::stack() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.UnStack
This wraps the ObjectARX AcDbTextEditorSelection::unStack() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.CombineParagraphs
This wraps the ObjectARX AcDbTextEditorSelection::combineParagraphs() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.RemoveCharacterFormatting
This wraps the ObjectARX AcDbTextEditorSelection::removeCharacterFormatting() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.RemoveParagraphFormatting
This wraps the ObjectARX AcDbTextEditorSelection::removeParagraphFormatting() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.RemoveAllFormatting
This wraps the ObjectARX AcDbTextEditorSelection::removeAllFormatting() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.ChangeToLowercase
This wraps the ObjectARX AcDbTextEditorSelection::changeToLowercase() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.ChangeToUppercase
This wraps the ObjectARX AcDbTextEditorSelection::changeToUppercase() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.CanSupportLanguage(System.Int32)
This wraps the ObjectARX AcDbTextEditorSelection::languageSupported() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.CanSupportFont(Autodesk.AutoCAD.DatabaseServices.Font)
This wraps the ObjectARX AcDbTextEditorSelection::fontSupported() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.ConvertToPlainText
This wraps the ObjectARX AcDbTextEditorSelection::convertToPlainText() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.UpdateField
This wraps the ObjectARX AcDbTextEditorSelection::updateField() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.FieldObject
This wraps the ObjectARX AcDbTextEditorSelection::field() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.SingleFieldSelected
This wraps the ObjectARX AcDbTextEditorSelection::singleFieldSelected() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.SingleStackSelected
This wraps the ObjectARX AcDbTextEditorSelection::singleStackSelected() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.SelectionString
This wraps the ObjectARX AcDbTextEditorSelection::getSelectionText() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.StackSettings
Gets and sets the selected stack object.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.CanChangeCase
This wraps the ObjectARX AcDbTextEditorSelection::canChangeCase() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.Paragraphs
This wraps the ObjectARX AcDbTextEditorSelection::paragraph() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.CanStack
This wraps the ObjectARX AcDbTextEditorSelection::canStack() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelection.CanUnStack
This wraps the ObjectARX AcDbTextEditorSelection::canUnStack() method.