Autodesk.AutoCAD.Geometry.CoordinateSystem3d
This struct encapsulates the origin point, and X-, Y-, and Z-axis vectors that define a 3D coordinate system.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructor.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.IsEqualTo(Autodesk.AutoCAD.Geometry.CoordinateSystem3d)
This method calls CoordinateSystem3d.IsEqualTo(CoordinateSystem3d a, Tolerance tolerance) with tolerance set to Global.
a:  Input object to compare with

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.IsEqualTo(Autodesk.AutoCAD.Geometry.CoordinateSystem3d,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a against this object for equivalency within the tolerance range specified by tolerance.
a:  Input object to compare with
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.op_Inequality(Autodesk.AutoCAD.Geometry.CoordinateSystem3d,Autodesk.AutoCAD.Geometry.CoordinateSystem3d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.op_Equality(Autodesk.AutoCAD.Geometry.CoordinateSystem3d,Autodesk.AutoCAD.Geometry.CoordinateSystem3d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.Zaxis
Returns the vector defining the z axis of the coordinate system.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.Yaxis
Returns the vector defining the y axis of the coordinate system.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.Xaxis
Returns the vector defining the x axis of the coordinate system.

Autodesk.AutoCAD.Geometry.CoordinateSystem3d.Origin
Returns the origin of the coordinate system.