Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator
This .NET class wraps the AcDbDictionaryIterator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.MoveNext
This function attempts to advance the iterator one entry in the dictionary.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Reset
Resets the iterating position.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Value
Accesses the value.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Key
Accesses the Key value for the iterated entry.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Current
Accesses the current iterated position.

Autodesk.AutoCAD.DatabaseServices.DbDictionaryEnumerator.Entry
Accesses the Entry property value.