Autodesk.AutoCAD.DatabaseServices.CompoundObjectId
Class used to identify an Object in an Database when the object is references via a path of BlockReferences, and possibly by some other ways in the future.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.Database)
Creates CompoundObjectId from an ordinary ObjectId and a path of BlockReferences.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.
path:  The path of BlockRefrences that lead to the referenced object. The first BlockReference in the path resides in the host database, the second BlockReference is from the BlockTableRecord that the first BlockReference references, the third BlockReference is from the BlockTableRecord that the second BlockReference references, etc.
pHostDatabase:  The host database. If null, the database is taken from the first BlockReference id in the path (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
Copy constructor.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database)
Creates CompoundObjectId from an ordinary ObjectId.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.
hostDatabase:  The host database. If null, the database is taken from the ObjectId (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates CompoundObjectId from an ordinary ObjectId.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.#ctor
The default constructor creates an empty CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.SetEmpty
Sets the CompoundObjectId to be empty, containing no data.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Set(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.Database)
Sets this CompoundObjectId from an ordinary ObjectId and a path of BlockReferences.
id:  ObjectId of the DBObject that this CompoundObjectId is going to reference.
path:  The path of BlockRefrences that lead to the referenced object. The first BlockRefrence in the path resides in the host database, the second BlockReference is from the BlockTableRecord that the first BlockReference references, the third BlockReference is from the BlockTableRecord that the second BlockReference references, etc.
hostDatabase:  The host database. If null, the database is taken from the first BlockReference id in the path (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Set(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.Database)
Sets this CompoundObjectId from another CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Set(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Database)
Sets this CompoundObjectId from an ordinary ObjectId.
id:  ObjectId of the Object that this CompoundObjectId is going to reference.
hostDatabase:  The host database. If null, the database is taken from the ObjectId (even if it is in XREF database).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.SetFullPath(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.Database)
Sets this AcDbCompoundObjectId from the path that contains the path of AcDbBlockReferences apppended by the leaf AcDbObjectId.
fullPath:  The path of AcDbBlockRefrences and the leaf level object itself as the last element of the array.
pHostDatabase:  The host database. If null, the database is taken from the first AcDbBlockReference id in the fullPath.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.IsValid(System.Int32)
Returns true if the CompoundObjectId is valid.
validityCheckingLevel:  Input the level of testing.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Remap(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Remaps all the ObjectIds in this CompoundObjectId by the given IdMapping.
idMap:  See the description of the IdMapping class.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler,Autodesk.AutoCAD.DatabaseServices.Database)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler,System.Int32)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler,Autodesk.AutoCAD.DatabaseServices.Database)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler,Autodesk.AutoCAD.DatabaseServices.Database,System.Int32)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.NullId
Returns an empty CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Transform
Gets the compound transform from the leaf object to the world, concatenating all the BlockReference transforms, from the most nested one to the topmost one.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Status
Gets the status type.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.IsSimpleObjectId
Indicates whether there is no path, only the leaf id (which may be null).

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.IsExternal
Returns true iff the CompoundObjectId is from an external drawing.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.IsEmpty
Indicates whether the CompoundObjectId contains no data.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.Path
Gets the BlockReference path.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.FullPath
Gets the full path, i.e., the given path of BlockReference ids appended with the leaf ObjectId.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.LeafId
Gets the leaf-node ObjectId that resides in the BlockTableRecord that the last BlockReference in the path references, or simply the ObjectId if there is no path.

Autodesk.AutoCAD.DatabaseServices.CompoundObjectId.TopId
Gets the first ObjectId (of an BlockReference) in the path, or the leaf-node ObjectId, if there is no path.