Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume
This class encapsulates the data required to describe a spatial filter's volume.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructor.
fromPoint:  Input the transformed clip boundary "from" point
toPoint:  Input the transformed clip boundary "to" point
upDir:  Input the transformed clip boundary normal vector
viewField:  Input the transformed clip boundary's view field vector

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.ViewField
Accesses the transformed clip boundary's view field vector.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.UpDirection
Accesses the transformed clip boundary normal vector.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.ToPoint
Accesses the transformed clip boundary "to" point.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterVolume.FromPoint
Accesses the transformed clip boundary "from" point.