Autodesk.AutoCAD.DatabaseServices.SkyBackground
This is class Autodesk.AutoCAD.DatabaseServices.SkyBackground.

Autodesk.AutoCAD.DatabaseServices.SkyBackground.#ctor
This is SkyBackground, a member of class SkyBackground.

Autodesk.AutoCAD.DatabaseServices.SkyBackground.GetDrawableType
This is GetDrawableType, a member of class SkyBackground.

Autodesk.AutoCAD.DatabaseServices.SkyBackground.SunId
This is SunId, a member of class SkyBackground.