Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices
This .NET class wraps the Services ObjectARX class within the AcDbSymbolUtilities namespace.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLayerDefpointsId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
database:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLayerZeroId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
database:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsCompatibilityMode(Autodesk.AutoCAD.DatabaseServices.Database)
Retrieve the EXTNAMES setting of the specified database.
database:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ValidateCompatibleSymbolName(System.String,System.Boolean,System.Boolean,System.Boolean)
Validates name as a symbol name. If name is valid, it is then checked to see if it is within any applicable maximum name length.
If isNewName is true, then the name is validated as if it will be used as a new symbol name. Otherwise, it is validated as if it is the name of an existing symbol name.
If compatibilityMode is true, then the extended symbol name rules are used. Otherwise, the pre-extended legacy rules (that is, 31 characters, no spaces) are used. Note that this value corresponds to the true/false interpretation of EXTNAMES. If EXTNAMES=1, then AutoCAD uses the extended rules, and if EXTNAMES=0, then AutoCAD uses the pre-extended rules.
If allowVerticalBar is true, then vertical bars are allowed in the symbol name.
name:  Input name to validate
isNewName:  Input Boolean to indicate whether to treat the name as a new or an existing name
allowVerticalBar:  Input Boolean to indicate whether to allow vertical bars in the name
compatibilityMode:  Input Boolean to indicate whether the validate the name as an extended or legacy symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockLayoutName(System.String)
Returns true if the name is a name of a layout’s block-table record or the name of the main paper space block.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockModelSpaceName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsBlockPaperSpaceName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLayerDefpointsName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLayerZeroName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeByBlockName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeByLayerName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsLinetypeContinuousName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsRegAppAcadName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsTextStyleStandardName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.IsViewportActiveName(System.String)
Returns true if name matches a predefined symbol name.
name:  Input name to compare

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockModelSpaceId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockPaperSpaceId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input pointer to database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeByBlockId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeByLayerId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetLinetypeContinuousId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetRegAppAcadId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetTextStyleStandardId(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the ObjectId of the predefined symbol table record for the specified database.
databasePointer:  Input database to access

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.MakeDependentName(System.String,System.String)
Performs the necessary concatenation of the specified drawing name and symbol name to create a dependent symbol name.
dwgName:  Input the drawing name
symbolName:  Input the symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RepairPreExtendedSymbolName(System.String,System.Boolean)
This method returns a "repaired" copy of the specified string. The method uses the same symbol name validation rules as the validation functions (such as validatePreExtendedSymbolname() and validateSymbolName()) except that the returned copy of the string does not contain any illegal characters. Those are replaced with valid replacement characters.
oldName:  Input symbol name to repair
allowVerticalBar:  Input Boolean to indicate is vertical bars are allowed in the symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RepairSymbolName(System.String,System.Boolean)
This method returns a "repaired" copy of the specified string. The method uses the same symbol name validation rules as the validation functions (such as validatePreExtendedSymbolname() and validateSymbolName()) except that the returned copy of the string does not contain any illegal characters. Those are replaced with valid replacement characters.
oldName:  Input symbol name to repair
allowVerticalBar:  Input Boolean to indicate if vertical bars are allowed in the symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ValidatePreExtendedSymbolName(System.String,System.Boolean)
This method validates name according to the rules for legacy (AutoCAD Release 14 and earlier) symbol names. name should be a non-NULL pointer. allowVerticalBar should be true to indicate that vertical bars should be considered valid characters in the symbol name, or false if not. name is normalized before validating.
name:  Input name to validate
allowVerticalBar:  Input Boolean to indicate if vertical bars are valid in the symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ValidateSymbolName(System.String,System.Boolean)
This method validates name according to the rules for extended (AutoCAD 2000 and later) symbol names. name should be a non-NULL pointer. allowVerticalBar should be true to indicate that vertical bars should be considered valid characters in the symbol name, or false if not. name is normalized before validating.
name:  Input name to validate
allowVerticalBar:  Input Boolean to indicate if vertical bars are valid in the symbol name

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetBlockNameFromInsertPathName(System.String)
Extract a suitable block name from a pathname.
pathName:  Input path name to examine

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetInsertPathNameFromBlockName(System.String)
This function copies the string pointed to by blockName (or an empty string if blockName is null) into the path name string.
blockName:  Input name of block from which to get the path

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetMaxSymbolNameLength(System.Boolean,System.Boolean)
Returns the maximum allowed length for symbol names, if applicable. Compatibility Mode (Value for EXTNAMES)
isNewName
false
true
false
max=31
max=255
true
max=31
not applicable.
isNewName:  Input Boolean to indicate whether we want to the length for extended or legacy symbol names
compatibilityMode:  Input Boolean to indicate extended or legacy symbol names

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetPathNameFromSymbolName(System.String,System.String)
This function copies the string pointed to by symbolName (or an empty string if symbolName is null) into path name.
symbolName:  Input name of block from which to get the path
extensions:  Input list of extensions for which to search

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.GetSymbolNameFromPathName(System.String,System.String)
Extracts a suitable symbol name from a path name.
pathName:  Input path name
extensions:  Input list of extensions to consider

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.PreValidateSymbolName(System.String,System.Boolean)
Perform any "pre-validation" steps on a string that will be validated as a symbol name:
Normalize the name. If preserveCase is false, the symbol name is converted to uppercase.
Strip leading and trailing whitespace.
preserveCase:  Input Boolean to indicate whether to preserve the case of alphabetic letters

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.ViewportActiveName
Returns the string used as the value for the predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.TextStyleStandardName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.RegAppAcadName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeContinuousName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeByLayerName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LinetypeByBlockName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LayerZeroName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.LayerDefpointsName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.BlockPaperSpaceName
Returns the string used as the value for the  predefined symbol record.

Autodesk.AutoCAD.DatabaseServices.SymbolUtilityServices.BlockModelSpaceName
Returns the string used as the value for the  predefined symbol record.