Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode
Wraps the ObjectARX AcDbObjectIdGraphNode class.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
id:  Input ObjectId that the node will contain.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode.Create(System.IntPtr,System.Boolean)
This static method creates and returns a new ObjectIdGraphNode.
unmanagedPointer:  Input pointer to the AcDbObjectIdGraphNode object that the new ObjectIdGraphNode will wrap.
autoDelete:  Input boolean indicating whether the wrapped AcDbObjectIdGraphNode should be deleted when this ObjectIdGraphNode is destroyed.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode.Id
Gets the ObjectId contained by this ObjectIdGraphNode.