Autodesk.AutoCAD.DatabaseServices.Mline
This .NET class wraps the Mline ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Mline.#ctor
Default constructor does no explicit initialization of data members at all for the new Mline object.

Autodesk.AutoCAD.DatabaseServices.Mline.AppendSegment(Autodesk.AutoCAD.Geometry.Point3d)
Projects newVertex along the MLine object's normal vector onto the plane defined by the normal vector and the first vertex of the MLine object.
newVertex:  Input new vertex point (in WCS) to be added

Autodesk.AutoCAD.DatabaseServices.Mline.RemoveLastSegment(Autodesk.AutoCAD.Geometry.Point3d)
Removes the last vertex in the MLine object's vertex array.
lastVertex:  Returns filled in with the value of the vertex that becomes last when current last is removed

Autodesk.AutoCAD.DatabaseServices.Mline.MoveVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Changes vertex in index position in the MLine object's vertex array (0 based) to use a value determined by projecting the newPosition point along the MLine object's normal vector onto the plane defined by the normal vector and the MLine object's first vertex.
index:  Input index of vertex to move in the vertex array
newPosition:  Input new vertex value

Autodesk.AutoCAD.DatabaseServices.Mline.Element(Autodesk.AutoCAD.Geometry.Point3d)
Attempts to find which element of the MLine object contains the point pt.
pt:  Input search point

Autodesk.AutoCAD.DatabaseServices.Mline.VertexAt(System.Int32)
Input index (0 based) of desired vertex.
index:  Returns the value of the vertex at the index location (0 based) in the MLine object's vertex array.

Autodesk.AutoCAD.DatabaseServices.Mline.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean,System.Boolean)
In this function, givenPoint is projected along the normal vector onto the plane containing the MLine object. Then the resulting projected point is used to find the point on the MLine object that is closest. pointOnCurve is filled in with the closest point found. If extend == true, then the MLine object will be "virtually" extended to find the closest point. If excludeCaps == true, then any endcaps on the MLine object will be ignored.
givenPoint:  Input point to find nearest point to
normal:  Input direction of projection
extend:  Input Boolean indicating if search should include "virtual" extension of Mline
excludeCaps:  Input Boolean indicating if endcaps should not be included in nearest point search

Autodesk.AutoCAD.DatabaseServices.Mline.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean,System.Boolean)
Finds the point on the MLine object that is closest to givenPoint and returns it. If extend == true, then the MLine object will be "virtually" extended to find the closest point. If excludeCaps == true, then any endcaps on the MLine object will be ignored.
givenPoint:  Input point to find nearest point to
extend:  Input Boolean indicating if search should include "virtual" extension of Mline
excludeCaps:  Input Boolean indicating if endcaps should not be included in nearest point search

Autodesk.AutoCAD.DatabaseServices.Mline.NumberOfVertices
Accesses the number of vertices in the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.SupressEndCaps
Assesses if endcaps are currently suppressed for the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.SupressStartCaps
Assesses if startcaps are currently suppressed for the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.IsClosed
Assesses if the MLine is closed.

Autodesk.AutoCAD.DatabaseServices.Mline.Normal
Accesses the unit normal vector the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.Scale
Accesses the current scale value in use by the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.Justification
Accesses the justification for the MLine object.

Autodesk.AutoCAD.DatabaseServices.Mline.Style
Accesses the objectId of the MlineStyle currently used by the MLine object.