Autodesk.AutoCAD.Runtime.VariableChangingEventArgs
Contains variable changing event data.

Autodesk.AutoCAD.Runtime.VariableChangingEventArgs.Veto(System.String)
Vetos the variable change.
reason:  Optional. If more information is available about the failure then it should be be passed via this parameter

Autodesk.AutoCAD.Runtime.VariableChangingEventArgs.IsResetting
Returns true if the value is due to reset.

Autodesk.AutoCAD.Runtime.VariableChangingEventArgs.NewValue
Gets the new value for the variable.

Autodesk.AutoCAD.Runtime.VariableChangingEventArgs.OldValue
Gets the old value for the variable.