Autodesk.AutoCAD.Runtime.RuntimeSystem
This class initializes the application host services and the runtime factories that produce managed ObjectARX objects for an AutoCAD managed application.

Autodesk.AutoCAD.Runtime.RuntimeSystem.Initialize(Autodesk.AutoCAD.DatabaseServices.HostApplicationServices,System.Int32)
Invoked during runtime initialization.
hostServices:  Input Autodesk.AutoCAD.DatabaseServices.HostApplicationServices object.
localId:  Input.

Autodesk.AutoCAD.Runtime.RuntimeSystem.Terminate
Called only when AutoCAD exits.

Autodesk.AutoCAD.Runtime.RuntimeSystem.Main(System.IntPtr,System.Int32)
Initializes the .NET Runtime using ICLRRuntimeHost.
arg:  Input System.String; argument is not used, it’s there to satisfy ExecuteInDefaultAppDomain which calls the method and loads the acdbmgd assembly.
argLength:  Input length of arg