Autodesk.AutoCAD.DatabaseServices.Profile3d
This wraps the ObjectARX AcDb3dProfile class.

Autodesk.AutoCAD.DatabaseServices.Profile3d.#ctor(Autodesk.AutoCAD.DatabaseServices.Profile3d)
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.#ctor(Autodesk.AutoCAD.DatabaseServices.VertexRef)
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.#ctor(Autodesk.AutoCAD.DatabaseServices.PathRef)
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile() method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.#ctor(Autodesk.AutoCAD.DatabaseServices.Entity)
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.#ctor
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.ConvertProfile(Autodesk.AutoCAD.DatabaseServices.PathRef[])
This wraps the ObjectARX AcDb3dProfile::convertProfile() method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.ConvertProfile(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
This wraps the ObjectARX AcDb3dProfile::convertProfile() method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.CopyFrom(Autodesk.AutoCAD.DatabaseServices.Profile3d)
This wraps the ObjectARX AcDb3dProfile::operator =() method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.IsValid
This wraps the ObjectARX AcDb3dProfile::isValid () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.IsEdge
This wraps the ObjectARX AcDb3dProfile::isEdge () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.IsFace
This wraps the ObjectARXAcDb3dProfile::isFace () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.IsSubent
This wraps the ObjectARX AcDb3dProfile::isSubent () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.IsPlanar
This wraps the ObjectARX AcDb3dProfile::isPlanar () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.IsClosed
This wraps the ObjectARX AcDb3dProfile::isClosed () method.

Autodesk.AutoCAD.DatabaseServices.Profile3d.ProfileVertexRef
This wraps the ObjectARX AcDb3dProfile::getVertexRef() and AcDb3dProfile::set() methods.

Autodesk.AutoCAD.DatabaseServices.Profile3d.ProfilePathRef
This wraps the ObjectARX AcDb3dProfile::getPathRef() and AcDb3dProfile::set() methods.

Autodesk.AutoCAD.DatabaseServices.Profile3d.Entity
This wraps the ObjectARX AcDb3dProfile::entity() and AcDb3dProfile::set() methods.