Autodesk.AutoCAD.LayerManager.LayerFilterTree
This class encapsulates the root and current LayerFilter objects.

Autodesk.AutoCAD.LayerManager.LayerFilterTree.#ctor(Autodesk.AutoCAD.LayerManager.LayerFilter,Autodesk.AutoCAD.LayerManager.LayerFilter)
Constructs the root and current nodes of the true.
root:  Input root of tree
current:  Input current node

Autodesk.AutoCAD.LayerManager.LayerFilterTree.Current
Returns the number of objects in this tree.

Autodesk.AutoCAD.LayerManager.LayerFilterTree.Root
.