Autodesk.AutoCAD.Runtime.Variable
Represents a variable in the system.

Autodesk.AutoCAD.Runtime.Variable.#ctor(System.IntPtr,System.Boolean)
This is Variable, a member of class Variable.

Autodesk.AutoCAD.Runtime.Variable.Reset
Resets this variable to its default value.

Autodesk.AutoCAD.Runtime.Variable.Changed
Event fired when the variable changed.

Autodesk.AutoCAD.Runtime.Variable.Changing
Event fired when variable changing.

Autodesk.AutoCAD.Runtime.Variable.Range
Gets the RangeInfo object that provides the valid range of the variable or NULL if no range restriction was specified.

Autodesk.AutoCAD.Runtime.Variable.TypeFlags
Gets the type flags of the variable.

Autodesk.AutoCAD.Runtime.Variable.Storage
Gets the StorageType enum value that reprents the storage type of the variable.

Autodesk.AutoCAD.Runtime.Variable.SecondaryType
Gets the secondary data type of the variable.

Autodesk.AutoCAD.Runtime.Variable.PrimaryType
Gets the primary data type of the variable.

Autodesk.AutoCAD.Runtime.Variable.Name
Gets the name of the variable in a String.

Autodesk.AutoCAD.Runtime.Variable.IsLocked
Gets a value indicating whether the variable is locked by a CAD Administrator.

Autodesk.AutoCAD.Runtime.Variable.IsReadOnly
Gets or sets a value indicating whether the variable is read-only, true if the variable is read-only; false otherwise.

Autodesk.AutoCAD.Runtime.Variable.Value
Gets or sets the value of the variable.