Autodesk.AutoCAD.Geometry.CubicSplineCurve3d
This .NET class wraps the AcGeCubicSplineCurve3d ObjectARX class.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Constructs a cubic interpolation spline approximating curve with the distance of epsilon.
curve:  Input generic 3D curve
epsilon:  Input approximation tolerance value

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an interpolation cubic spline going through the fit points.
points:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object.
points:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs an interpolation cubic spline going through the fit points.
points:  Input interpolating points

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object.
points:  Input interpolating points
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.FitPointAt(System.Int32)
Returns fitPoint at a given index i.
i:  Input index of a fitPoint point

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets the fit point at the specified index i to the input value.
i:  Input index of a fit point
point:  Input fit point

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.FirstDerivativeAt(System.Int32)
Returns the first derivative at the interpolation point specified by its index i.
i:  Input index of an interpolation point

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.SetFirstDerivativeAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the derivative at the specified index to the input value.
i:  Input index of a fit point
derivative:  Input derivative

Autodesk.AutoCAD.Geometry.CubicSplineCurve3d.NumberOfFitPoints
Returns number of the spline's fit points.