Autodesk.AutoCAD.DatabaseServices.TransactionManager
This .NET class wraps the AcDbTransactionManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.StartTransaction
Begins a new transaction.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.StartOpenCloseTransaction
Instantiates, initializes, and returns an OpenCloseTransaction object.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.AddNewlyCreatedDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
This method wraps the AcDbTransactionManager::addNewlyCreatedDBRObject ObjectARX function.
obj must point to an object that is newly created (that is, it has never been closed) and is already database resident (that is, it's been added to an Database so it has an objectId).
If add == true, the object pointed to by obj is added to the top transaction. If add == false, then the object is removed from whatever transaction it's within.
obj:  Input object to be added or removed
add:  Input Boolean indicating whether to add or remove the object

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetAllObjects
Searches all currently existing transaction objects and returns an objects collection with pointers to all objects it finds.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Calls the GetObject() function of the top transaction passing on all the arguments it has received. Objects can only be obtained within the top transaction, so this function saves the trouble of having to either keep a pointer to the top transaction or use the TransactionManager.TopTransaction property to obtain it.
If the openErased Boolean is true, then even an erased object can be obtained. If openErased is false, then trying to obtain an erased entity results in an error return value.
For more information, see the section on transactions in the ObjectARX Developer's Guide.
id:  Input objectId of object to obtain
mode:  Input mode to obtain in
openErased:  Input Boolean indicating whether to obtain erased objects
forceOpenOnLockedLayer:  Input true if locked layers should be opened

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
Calls the GetObject() function of the top transaction passing on all the arguments it has received. Objects can only be obtained within the top transaction, so this function saves the trouble of having to either keep a pointer to the top transaction or use the TransactionManager.TopTransaction property to obtain it.
If the openErased Boolean is true, then even an erased object can be obtained. If openErased is false, then trying to obtain an erased entity results in an error return value.
For more information, see the section on transactions in the ObjectARX Developer's Guide.
id:  Input objectId of object to obtain
mode:  Input mode to obtain in
openErased:  Input Boolean indicating whether to obtain erased objects

Autodesk.AutoCAD.DatabaseServices.TransactionManager.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode)
Calls the GetObject() function of the top transaction passing on all the arguments it has received.
id:  Input objectId of object to obtain
mode:  Input mode to obtain in

Autodesk.AutoCAD.DatabaseServices.TransactionManager.QueueForGraphicsFlush
Queues up the graphics changes of all transaction-resident modified entities from any existing transaction.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.TopTransaction
Accesses the the Transaction object that is at the top of the transaction stack (that is, the most recently created Transaction object).

Autodesk.AutoCAD.DatabaseServices.TransactionManager.NumberOfOpenedObjects
Returns the number of objects opened by all transactions.

Autodesk.AutoCAD.DatabaseServices.TransactionManager.NumberOfActiveTransactions
Returns the number of active transactions.