Autodesk.AutoCAD.GraphicsInterface.EdgeData
This .NET class wraps the AcGiEdgeData ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
Sets the true colors for this entity to colors.The colors array must have the same number of elements as there are edges in the mesh or shell with which it is used.
colors:  Input array of EntityColor objects

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetLayers(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets layers to be the array of LayerTableRecord object IDs used by this object.
layers:  Input array of LayerTableRecord object IDs.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetLineTypes(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets lineTypes to be the array of LinetypeTableRecord object IDs used by this object.The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with.
lineTypes:  Input array of LinetypeTableRecord object IDs

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetTrueColors
Returns the true colors defined for this entity.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetLayers
Returns the array of LayerTableRecord object IDs, one for each edge in the mesh or shell with which this object is used.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetLineTypes
Returns the array of LinetypeTableRecord object IDs, one for each edge in the mesh or shell with which this object is used.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetSelectionMarkers
Returns a pointer to an array of graphic system selection markers (gsmarkers), one for each edge in the mesh or shell the EdgeData object is used with.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetVisibility
Returns a pointer to an array of visibility flags (that is, 0 == invisible, 1 == visible), one for each edge in the mesh or shell the EdgeData object is used with.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetSelectionMarkers(System.IntPtr[])
Sets selectionMarkers to be the array of graphics system selection markers (gsmarkers) used by the EdgeData object.
selectionMarkers:  Input array of non-zero graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetVisibility(System.Byte[])
Sets visibility to be the array of edge visibility flags used by this object.
visibility:  Input array of visibility flags

Autodesk.AutoCAD.GraphicsInterface.EdgeData.SetColors(System.Int16[])
Sets colors to be the array of edge color indices used by this object.The array must have exactly the same number of elements as there are edges in the mesh or shell it is used with.
colors:  Input array of AutoCAD color indices.

Autodesk.AutoCAD.GraphicsInterface.EdgeData.GetColors
Returns an array of AutoCAD color indices, one for each edge in the mesh or shell with which this object is used.