Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection
This collection provides a container for Autodesk.AutoCAD.DatabaseServices.BulgeVertex objects.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Add(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Adds the object represented by value to this collection.
value:  Input the object to add.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Returns the index of the collection item that possesses value.
value:  Input the object to check.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Inserts value at position index in the collection.
index:  Input the index to insert at.
value:  Input the object to insert.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Remove(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Removes the object represented by value from this collection.
value:  Input the object to remove.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.Contains(Autodesk.AutoCAD.DatabaseServices.BulgeVertex)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input the object to check for.

Autodesk.AutoCAD.DatabaseServices.BulgeVertexCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.BulgeVertex[],System.Int32)
Copies objects in array to this collection.
array:  Input the object to copy from.
index:  Input the index to begin copying.