Autodesk.AutoCAD.GraphicsInterface.Geometry
This .NET class wraps the AcGiGeometry ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushModelTransform(Autodesk.AutoCAD.Geometry.Matrix3d)
This function pushes a new transform onto the transform stack.
matrix:  Input input matrix

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushModelTransform(Autodesk.AutoCAD.Geometry.Vector3d)
This function pushes a new transform onto the transform stack.
normal:  Input normal vector

Autodesk.AutoCAD.GraphicsInterface.Geometry.PopModelTransform
The method must be called to restore the model transform after a call to PushModelTransform().

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushPositionTransform(Autodesk.AutoCAD.GraphicsInterface.PositionBehavior,Autodesk.AutoCAD.Geometry.Point2d)
This method places the position transform behavior onto the current transform stack.
behavior:  Input transform behavior
offset:  Input position coordinate

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushPositionTransform(Autodesk.AutoCAD.GraphicsInterface.PositionBehavior,Autodesk.AutoCAD.Geometry.Point3d)
This method places the position transform behavior onto the current transform stack.
behavior:  Input transform behavior
offset:  Input position coordinate

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushScaleTransform(Autodesk.AutoCAD.GraphicsInterface.ScaleBehavior,Autodesk.AutoCAD.Geometry.Point2d)
Places scale transform behavior onto the current transform stack.
behavior:  Input scale transformation behavior
extents:  Input new scale values

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushScaleTransform(Autodesk.AutoCAD.GraphicsInterface.ScaleBehavior,Autodesk.AutoCAD.Geometry.Point3d)
Places scale transform behavior onto the current transform stack.
behavior:  Input scale transformation behavior
extents:  Input new scale values

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushOrientationTransform(Autodesk.AutoCAD.GraphicsInterface.OrientationBehavior)
This method places the orientation transform behavior onto the current transform stack.
behavior:  Input orientation transform behavior to push

Autodesk.AutoCAD.GraphicsInterface.Geometry.Circle(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Displays a circle primitive that is defined by the three points--firstPoint, secondPoint, and thirdPoint--which all lie on the circle.
firstPoint:  Input first point on circle
secondPoint:  Input second point on circle
thirdPoint:  Input third point on circle

Autodesk.AutoCAD.GraphicsInterface.Geometry.Circle(Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Displays a circle primitive with center at center and a radius of radius.
center:  Input center point for the circle.
radius:  Input radius for the circle.
normal:  Input normal vector for plane to contain the circle.

Autodesk.AutoCAD.GraphicsInterface.Geometry.CircularArc(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.GraphicsInterface.ArcType)
Displays an arc primitive defined by the three points: start, point, and endingPoint.
start:  Input start point of arc
point:  Input point on arc
endingPoint:  Input endpoint of arc
arcType:  Input type of arc to display

Autodesk.AutoCAD.GraphicsInterface.Geometry.CircularArc(Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,Autodesk.AutoCAD.GraphicsInterface.ArcType)
Displays an arc primitive defined by the arc's center of curvature center, the radius of curvature radius, the containment plane's normal vector normal, the vector from the center of curvature to the arc start point startVector, the angle that the arc spans sweepAngle, and the arc type arcType.
center:  Input center point for arc's center of curvature.
radius:  Input arc's radius of curvature.
normal:  Input normal vector for plane to contain arc.
startVector:  Input vector defining the direction the arc start point is from the arc's center of curvature.
sweepAngle:  Input angle (in radians) that encompasses the arc.
arcType:  Input type of arc to display.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polyline(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.IntPtr)
Allows the caller to specify sequential sub-entity markers for the segments of the polyline.
points:  Input number of vertex points in polyline (minimum of two)
normal:  Input normal vector
subEntityMarker:  Input sub-entity marker for first segment

Autodesk.AutoCAD.GraphicsInterface.Geometry.PolyPolyline(Autodesk.AutoCAD.GraphicsInterface.PolylineCollection)
Draws a list of polylines.
polylineCollection:  Input a PolylineCollection object

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
A return value of false (that is, 0) indicates that the primitive has been successfully stored in the graphics database.
points:  Input number of vertex points in polyline (minimum of two)

Autodesk.AutoCAD.GraphicsInterface.Geometry.Mesh(System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.GraphicsInterface.EdgeData,Autodesk.AutoCAD.GraphicsInterface.FaceData,Autodesk.AutoCAD.GraphicsInterface.VertexData,System.Boolean)
edgeData points to an EdgeData object that contains arrays of color, layer, visibility, line type, and selection marker settings for the edges. Each of the arrays in the EdgeData object pointed to must either be NULL or must have (row - 1) x column + row x (column -1) elements. faceData points to an FaceData object that contains arrays of color, layer, visibility, line type, and selection marker settings for the faces. Each of the arrays in the FaceData object pointed to must either be NULL or must have (row -1) x (column - 1) elements. vertexData points to an existing VertexData object that contains a flag indicating vertex orientation on faces and a pointer to an array of vertex normals. The array of vertex normals must either be NULL or must have row x column elements.
Note as the const qualifiers indicate, does not change or delete the parameter array or objects. The caller is responsible for the memory they use.
This function uses the various objects passed in as parameters to generate and display a mesh primitive.
rows:  Input number of rows in mesh
columns:  Input number of columns in mesh
points:  Input array of vertex points (must be rows x columns points)
edgeData:  Input to an existing EdgeData object
faceData:  Input to an existing FaceData object
vertexData:  Input to an existing VertexData object
bAutoGenerateNormals:  Input Boolean to indicate whether the display system should automatically generate normals for vertices and faces if they are not passed in through vertexData and faceData.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Shell(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.GraphicsInterface.EdgeData,Autodesk.AutoCAD.GraphicsInterface.FaceData,Autodesk.AutoCAD.GraphicsInterface.VertexData,System.Boolean)
edgeData points to an EdgeData object that contains arrays of color, layer, visibility, line type, and selection marker settings for the edges. Each of the arrays in the EdgeData object pointed to must either be NULL or must have the same number of elements as the number of edges. faceData points to an FaceData object that contains arrays of color, layer, visibility, line type, and selection marker settings for the faces. Each of the arrays in the FaceData object pointed to must either be NULL or must have the same number of elements as the number of faces. vertexData points to an VertexData object that contains a flag indicating vertex orientation on faces and a pointer to an array of vertex normals. The array of vertex normals must either be NULL or must have nbVertex elements.
The hatch solid (and regular hatch pattern) use the shell primitive during worldDraw. When a SAVEASR12 operation is in progress, the worldDraw routine uses the ResBuf parameter to attach extended entity data onto the Solid entity so that the original solid hatch can be reconstructed during a conversion from old to new hatches. For normal usage, this parameter should be set to NULL.
Note as the const qualifiers indicate, does not change or delete the parameter array or objects. The caller is responsible for the memory they use.
This function uses the various objects passed in as parameters to generate and display a shell primitive.
A shell's geometry is based on a set of vertices that are used to make faces (and holes in faces). Minimally, a list of vertices must be specified and a list of how the faces are made using the vertices. Faces may share vertices with other faces (however, the example given below does not show this).
The advantage in using a shell instead of a mesh is that a mesh cannot have holes, cannot have disjoint regions, and cannot have faces that are n-sided. The shell can have all of these.
The edge, face, and vertex data are optional parameters, but if you have face data, you must specify edge data. If you have vertex data, you must specify edge and face data. Use NULL for unused parameters if they are required.
The face list faces defines the faces and any holes that might be in them. In a face list, a face is defined by a set of numbers. The first number must be the number of vertices in the face, the following numbers must be the indices of the vertices making up the face; if the face is a hole, then its number of vertices must be entered as negative. Any holes in a face must immediately follow the definition of the containing face. A hole must be coplanar and completely inside a face (not touching an edge), otherwise, the results are unpredictable.
An edge is determined by walking around the face in the order listed in the face list. For example, if the face list contained 3, 0, 1, 2, this would define a face having 3 vertices: vertex 0, vertex 1, and vertex 2., and which has edges from vertex 0 to 1, vertex 1 to 2, and vertex 2 to 0.
In an edge data list for a shell, the edges are listed sequentially from face (or hole) to face (or hole) as they are ordered in the face list.
The ordering of shell face data is the same order as in the face list but omitting any holes. Warning You will lose any edge, face, or vertex data that you may have applied to the shell if a shell face has 5 or more edges or if it has any holes. As the shell is being sent out for display, it will be divided into triangles, which is slow.
A return value of false (that is, 0) indicates that the primitive has been successfully stored in the graphics database. A return value of true indicates that the operation has been terminated and the application wants to get control back as soon as possible.
points:  Input array of vertex points
faces:  Input collection of integers
edgeData:  Input to an existing EdgeData object
faceData:  Input to an existing FaceData object
vertexData:  Input to an existing VertexData object
bAutoGenerateNormals:  Input Boolean to indicate whether the display system should automatically generate normals for vertices and faces if they are not passed in through vertexData and faceData

Autodesk.AutoCAD.GraphicsInterface.Geometry.Text(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.String,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.TextStyle)
This function uses an TextStyle object to determine the font, size, etc. to use for the text.
The position, normal, and direction can be thought of as the foundation for a coordinate system that orients the text in 3D world space, where the position is the origin, the direction is the X axis, and the normal is the Z axis.
A copy of the text string is used in message, so the calling application is responsible for the memory of the string passed in.
A length value of -1 indicates that message is null terminated. A value greater than 0 indicates the length in bytes of message.
A raw value of true indicates that the AutoCAD escape codes {%%U, %%d, %%P, and %%nnn} should not be interpreted.
A return value of false (that is, 0) indicates that the primitive has been successfully stored in the graphics database. A return value of true indicates that the operation has been terminated and the application wants to get control back as soon as possible.
position:  Input start or insertion point for the text
normal:  Input normal for the plane to contain the text
direction:  Input direction the text will go
message:  Input text string to display
raw:  Input informing AutoCAD whether to interpret escape codes.
textStyle:  Input existing text style

Autodesk.AutoCAD.GraphicsInterface.Geometry.Text(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.String)
This method uses the current TextStyle when generating the text graphics primitive.
position:  Input start or insertion point for the text
normal:  Input normal for the plane to contain the text
direction:  Input direction the text will go
height:  Input text height
width:  Input text width
oblique:  Input text obliquing angle
message:  Input text string to display

Autodesk.AutoCAD.GraphicsInterface.Geometry.Xline(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
An xline passing point1 and point2 is displayed.
point1:  Input point on an xline
point2:  Input second point on an xline

Autodesk.AutoCAD.GraphicsInterface.Geometry.Ray(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Displays a ray that starts at point1 and passes through point2.
point1:  Input starting point of ray
point2:  Input another point (different from starting point) on the ray

Autodesk.AutoCAD.GraphicsInterface.Geometry.Draw(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Instructs the graphics system to regenerate value as a component of this object.
value:  Input Drawable to be rendered

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushClipBoundary(Autodesk.AutoCAD.GraphicsInterface.ClipBoundary)
Block references use clip boundaries to clip their contents.
boundary:  Input clip boundary

Autodesk.AutoCAD.GraphicsInterface.Geometry.PopClipBoundary
Removes the top most clip boundary from the stack.

Autodesk.AutoCAD.GraphicsInterface.Geometry.WorldLine(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Draws a line between the two points startPoint and endPoint.
startPoint:  Input start point of the worldline
endPoint:  Input second point on the worldline

Autodesk.AutoCAD.GraphicsInterface.Geometry.Image(Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.GraphicsInterface.TransparencyMode)
This method uses the basic transparent image parameters provided to determine where and what size image to paint.
imageSource:  Input transparent image
position:  Input start or insertion point for the image, in display coordinates
u:  Input the width of destination rectangle
v:  Input the height of destination rectangle
transparencyMode:  Input the transparencyMode to the display the image with

Autodesk.AutoCAD.GraphicsInterface.Geometry.Image(Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method uses the basic transparent image parameters provided to determine where and what size image to paint.
imageSource:  Input transparent image
position:  Input start or insertion point for the image, in display coordinates
u:  Input the width of destination rectangle
v:  Input the height of destination rectangle

Autodesk.AutoCAD.GraphicsInterface.Geometry.RowOfDots(System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Draws a row of dots.
count:  Input the number of dots
start:  Input the start point for the row of dots
step:  Input the step among the row of dots

Autodesk.AutoCAD.GraphicsInterface.Geometry.EllipticalArc(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.AutoCAD.GraphicsInterface.ArcType)
This method draws an elliptical arc or full ellipse, filled or unfilled.
center:  Input the center point
normal:  Input the normal vector
majorAxisLength:  Input major axis length
minorAxisLength:  Input minor axis length
startDegreeInRads:  Input the start degree in radius
endDegreeInRads:  Input the end degree in radius
tiltDegreeInRads:  Input the tilt degree in radius
arcType:  Input the arc type. See AcGiArcType for the types that can be specified.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Polypoint(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection,Autodesk.AutoCAD.Geometry.IntPtrCollection)
This is just like a polyline except it is an array of points.
points:  Input number of vertex points
normals:  Input normal vectors
subentityMarkers:  Input sub-entity markers to be applied per point

Autodesk.AutoCAD.GraphicsInterface.Geometry.OwnerDraw(Autodesk.AutoCAD.GraphicsInterface.GdiDrawObject,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Draws a GDI owner draw object.
gdiDrawObject:  Input GDI owner draw object.
position:  Input start or insertion point for the GDI owner draw object.
u:  Input orientation and magnitude of width.
v:  Input orientation and magnitude of height.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Edge(Autodesk.AutoCAD.Geometry.Curve2dCollection)
Define the boundary of the fill.
e:  The collection of Curve2d objects that represent the edge loop which bounds a fill

Autodesk.AutoCAD.GraphicsInterface.Geometry.Curve(Autodesk.AutoCAD.Geometry.Curve3d)
Method draws a 3D curve object.
curve3d:  Input a Curve3d object

Autodesk.AutoCAD.GraphicsInterface.Geometry.WorldToModelTransform
Gets the inverse of the net block insert transform.

Autodesk.AutoCAD.GraphicsInterface.Geometry.ModelToWorldTransform
This gets the net block insert transform; that is, the model-to-world coordinate transform.