Autodesk.AutoCAD.DatabaseServices.FixedConstraint
This class represents a Fixed constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.FixedConstraint.#ctor
Default constructor.