Autodesk.AutoCAD.DatabaseServices.GripOverrule
This .NET class wraps the ObjectARX class AcDbGripOverrule.

Autodesk.AutoCAD.DatabaseServices.GripOverrule.GetGripPoints(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripDataCollection,System.Double,System.Int32,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.GetGripPointsFlags)
This .NET method wraps the ObjectARX method: AcDbGripOverrule::getGripPoints (AcDbEntity*, AcDbGripDataPtrArray&, double, int, AcGeVector3d&, int).

Autodesk.AutoCAD.DatabaseServices.GripOverrule.GetGripPoints(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This .NET method wraps the ObjectARX method: AcDbGripOverrule::getGripPoints (AcDbEntity*, AcGePoint3dArray&, AcDbIntArray &, AcDbIntArray &).

Autodesk.AutoCAD.DatabaseServices.GripOverrule.MoveGripPointsAt(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripDataCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.MoveGripPointsFlags)
This .NET method wraps the ObjectARX method: AcDbGripOverrule::moveGripPointsAt (AcDbEntity*, AcDbVoidPtrArray&, AcGeVector3d&, int).

Autodesk.AutoCAD.DatabaseServices.GripOverrule.MoveGripPointsAt(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
This .NET method wraps the ObjectARX method: AcDbGripOverrule::moveGripPointsAt (AcDbEntity*, AcDbIntArray &, AcGeVector3d&).

Autodesk.AutoCAD.DatabaseServices.GripOverrule.GetStretchPoints(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3dCollection)
This .NET method wraps the ObjectARX method AcDbGripOverrule::getStretchPoints().

Autodesk.AutoCAD.DatabaseServices.GripOverrule.MoveStretchPointsAt(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
This .NET method wraps the ObjectARX method AcDbGripOverrule::moveStretchPointsAt().

Autodesk.AutoCAD.DatabaseServices.GripOverrule.OnGripStatusChanged(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripStatus)
This .NET method wraps the ObjectARX method AcDbGripOverrule::gripStatus().

Autodesk.AutoCAD.DatabaseServices.GripOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.GripOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.GripOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.GripOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.GripOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.