Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits
This .NET class wraps the AcGiRenderSettingsTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.ModelScaleFactor
Returns the model scale factor relative to meters.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.DiagnosticBackgroundEnabled
Returns a Boolean indicating whether the diagnostic (checkered) background will be rendered.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.ShadowsEnabled
Returns Boolean indicating whether shadows are cast.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.BackFacesEnabled
Returns a Boolean indicating whether back-facing faces are rendered.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.TextureSampling
Returns a value indicating whether sampling (filtering) for image textures is enabled.

Autodesk.AutoCAD.GraphicsInterface.RenderSettingsTraits.MaterialEnabled
Returns a Boolean indicating whether per-object materials are used.