Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters
AssocArrayPolarParameters wraps the ObjectARX AcDbAssocArrayPolarParameters class.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double)
Parameterized constructor.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetItemCount(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::itemCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.SetItemCount(System.Int32,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setItemCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetAngleBetweenItems(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::angleBetweenItems() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.SetAngleBetweenItems(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setAngleBetweenItems() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetFillAngle(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::fillAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.SetFillAngle(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setFillAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetStartAngle(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::startAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.SetStartAngle(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setStartAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetRadius(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::radius() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.SetRadius(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setRadius() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.RotateItems
Wraps the ObjectARX AcDbAssocArrayPolarParameters::rotateItems() and AcDbAssocArrayPolarParameters::setRotateItems() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.Radius
Wraps the ObjectARX AcDbAssocArrayPolarParameters::radius() and AcDbAssocArrayPolarParameters::setRadius() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.Direction
Wraps the ObjectARX AcDbAssocArrayPolarParameters::direction() and AcDbAssocArrayPolarParameters::setDirection() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.StartAngle
Wraps the ObjectARX AcDbAssocArrayPolarParameters::startAngle() and AcDbAssocArrayPolarParameters::setStartAngle() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.FillAngle
Wraps the ObjectARX AcDbAssocArrayPolarParameters::fillAngle() and AcDbAssocArrayPolarParameters::setFillAngle() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.AngleBetweenItems
Wraps the ObjectARX AcDbAssocArrayPolarParameters::angleBetweenItems() and AcDbAssocArrayPolarParameters::setAngleBetweenItems() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.ItemCount
Wraps the ObjectARX AcDbAssocArrayPolarParameters::itemCount() and AcDbAssocArrayPolarParameters::setItemCount() methods.