Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo
This .NET class wraps the AcGsClientViewInfo ObjectARX class.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.ViewportObjectId
Accesses the Viewport Object ID.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.AcadWindowId
Accesses the AutoCAD window ID.

Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo.ViewportId
Accesses the Viewport ID.