Autodesk.AutoCAD.DatabaseServices.Background
This .NET class wraps the AcDbBackground ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Background.GetBackgroundDictionaryId(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Given the database, this function opens the background dictionary. If the dictionary does not exist, it will be created if createIfNotPresent is true.
database:  Input the database from which to retrieve the background dictionary
createIfNotPresent:  Input whether the function should create the background dictionary if it does not currently exists in the specified database