Autodesk.AutoCAD.DatabaseServices.SymmetricConstraint
This class represents a Symmetric constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.SymmetricConstraint.#ctor
Default constructor.