Autodesk.AutoCAD.DatabaseServices.GraphNode
This .NET class wraps the AcDbGraphNode ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.GraphNode.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GraphNode.In(System.Int32)
Returns the incoming reference at int.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.GraphNode.Out(System.Int32)
Returns the outgoing reference.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.GraphNode.CycleIn(System.Int32)
When FindCycles() is called, it creates an internal duplicate set of references used to detect and break cycles.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.GraphNode.CycleOut(System.Int32)
When FindCycles() is called, it creates an internal duplicate set of references used to detect and break cycles.
Note
A call to CycleOut() will only return valid cycle information after a call to Graph.FindCycles(), and only when there are no further changes made to the graph.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.GraphNode.AddRefTo(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Creates a reference from this node to an outgoing node.
outGoingNode:  Input to the outgoing node

Autodesk.AutoCAD.DatabaseServices.GraphNode.RemoveRefTo(Autodesk.AutoCAD.DatabaseServices.GraphNode)
This is the opposite of AddRefTo().
nodeToRemoveReference:  Input node to remove reference of

Autodesk.AutoCAD.DatabaseServices.GraphNode.DisconnectAll
Removes all of the references between this node and any In() or Out() nodes, or CycleIn() and CycleOut() nodes.

Autodesk.AutoCAD.DatabaseServices.GraphNode.IsMarkedAs(System.Int32)
Returns true if the flag bit(s) passed in match set flag bit(s) in this node.
flag:  Input flag values to check for this node

Autodesk.AutoCAD.DatabaseServices.GraphNode.MarkAs(System.Byte)
Sets the flag bit(s) passed in.
flags:  Input flag values to set for this node

Autodesk.AutoCAD.DatabaseServices.GraphNode.Clear(System.Byte)
Clears the flag bit(s) passed in.
flags:  Input flag values to clear for this node

Autodesk.AutoCAD.DatabaseServices.GraphNode.MarkTree(System.Byte,Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection)
Marks this node and all nested out() nodes with the flags value supplied.
flags:  Input flag values to set for this node and all nested out nodes
appendedTo:  Input collection that this node and all nested out nodes should optionally be appended to

Autodesk.AutoCAD.DatabaseServices.GraphNode.SetEdgeGrowthRate(System.Int32,System.Int32)
This method sets the number of outgoing and incoming edges that are allocated at a time on a graph node.
outEdgeRate:  Number of outgoing edges allocated at one time
inEdgeRate:  Number of incoming edges allocated at one time

Autodesk.AutoCAD.DatabaseServices.GraphNode.IsCycleNode
Assesses if this node is part of a cyclical reference.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumCycleIn
Accesses the number of incoming cyclical references.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumCycleOut
Accesses the number of outgoing cyclical references.

Autodesk.AutoCAD.DatabaseServices.GraphNode.Owner
Accesses the Graph to which this node is attached.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NextCycleNode
Accesses the next outgoing cyclical reference.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumIn
Accesses the number of incoming references to this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.NumOut
Accesses the number of outgoing references from this node.

Autodesk.AutoCAD.DatabaseServices.GraphNode.Data
Accesses the data associated with this node.