Autodesk.AutoCAD.DatabaseServices.ThreePointAngleConstraint
This class represents an angle constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ThreePointAngleConstraint.#ctor(Autodesk.AutoCAD.DatabaseServices.AngularConstraint.AngularSectorType)
Constructor.
type:  Input SectorType indicating the angle sector which is used to measure the angle.

Autodesk.AutoCAD.DatabaseServices.ThreePointAngleConstraint.#ctor
Default constructor.