Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters
Container class for all photographic exposure parameters.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.#ctor
This is PhotographicExposureParameters, a member of class PhotographicExposureParameters.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.Equals(System.Object)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.op_Equality(Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters,Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters,Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.WhiteColor
Calculates and returns a RGB approximation of the White Point (using CIE 1964 10 degree).

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.WhitePoint
Gets White Point for photographic exposure parameters.

Autodesk.AutoCAD.GraphicsInterface.PhotographicExposureParameters.Exposure
Gets Exposure for photographic exposure parameters.