Autodesk.AutoCAD.DatabaseServices.GradientBackground
This .NET class wraps the AcDbGradientBackground ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.Rotation
Accesses the angle at which you can rotate a gradient background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.Height
Accesses the height value representing a percentage of the second color in a three-color gradient.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.Horizon
Accesses the horizon value indicating the percentage of unrotated height.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.ColorBottom
Accesses the current color value of the bottom portion of the background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.ColorMiddle
Accesses the current color value of the middle portion of the background.

Autodesk.AutoCAD.DatabaseServices.GradientBackground.ColorTop
Accesses the current color value of the top portion of the background.