Autodesk.AutoCAD.DatabaseServices.ExplicitConstraint
This class represents a dimensional constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ExplicitConstraint.MeasuredValue
Gets the value of the dimensional constraint measured from the distances/angles/radii of the constrained geometries.

Autodesk.AutoCAD.DatabaseServices.ExplicitConstraint.DimDependencyId
Gets and sets the ObjectId of the dimension dependency object referenced by this dimensional constraint.

Autodesk.AutoCAD.DatabaseServices.ExplicitConstraint.ValueDependencyId
Gets the ObjectId of the AssocValueDependency object referenced by this dimensional constraint.