Autodesk.AutoCAD.DatabaseServices.PlaneSurface
This .NET class wraps the AcDbPlaneSurface ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PlaneSurface.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PlaneSurface.CreateFromRegion(Autodesk.AutoCAD.DatabaseServices.Region)
Creates a plane surface from region.
region:  Input pointer to any Region object