Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback
This wraps the ObjectARX AcDbAssocVariableCallback class.

Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback.CanBeErased(Autodesk.AutoCAD.DatabaseServices.AssocVariable)
Allows client code to veto erasing a variable when the variable would be erased because the dimensional constraint that uses the variable is erased and the variable is no more referenced.
variable:  The AcDbAssocVariable that is to be erased.

Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback.ValidateNameAndExpression(Autodesk.AutoCAD.DatabaseServices.AssocVariable,System.String,System.String)
Called from AssocVariable.ValidateNameAndExpression().
variable:  The variable whose name and/or expression are being validated.
nameToValidate:  The variable name to validate. May be null.
expressionToValidate:  The variable expression to validate. May be null.