Autodesk.AutoCAD.DatabaseServices.VertexRef
This wraps the ObjectARX AcDbVertexRef class.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef(const AcGePoint3d *pGePoint) method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor(Autodesk.AutoCAD.DatabaseServices.Entity)
This wraps the ObjectARX AcDbVertexRef::VertexRef() method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d)
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.#ctor
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.VertexRef.Point
This wraps the ObjectARX AcDbVertexRef::point() method.