Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline
This class represents a constrained NURBS spline node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.NurbCurve3d)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained spline is holding on.
spline:  Input NurbCurve3d indicating the AcGe representation of this constrained spline Relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline.DefinePointAt(System.Int32)
Returns the define point of the constrained spline.
index:  Input the index.

Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline.NumOfDefinePoints
Gets the number of define points of the constrained spline.

Autodesk.AutoCAD.DatabaseServices.ConstrainedSpline.NurbSpline
Gets the NurbCurve3d representation of the constrained spline, relative to the work plane of the owning Assoc2dConstraintGroup object.