Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord
This .NET class wraps the AcDbDimStyleTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.GetArrowId(Autodesk.AutoCAD.DatabaseServices.DimArrowFlag)
Given an arrowhead, this function returns the ObjectId of the arrowhead.
whichArrow:  Input a dimension arrowhead

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimblk2
Accesses the current DIMBLK2 value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimblk1
Accesses the current DIMBLK1 value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimblk
Accesses the current DIMBLK value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimfxlen
Accesses the fixed extension lines value.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.DimfxlenOn
Accesses a value that indicates whether the fixed extension lines are on.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimpost
Accesses the character string that is the current DIMPOST value for the datatbase.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimapost
Accesses the current DIMAPOST value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimzin
Accesses the current DIMZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimupt
Accesses the current DIMUPT value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtzin
Accesses the current DIMTZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtxt
Accesses the current DIMTXT value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtxsty
Accesses the object ID of the TextStyle specified by the current DIMTXSTY value of the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtvp
Accesses the current DIMTVP value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtsz
Accesses the current DIMTSZ value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtp
Accesses the current DIMTP value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtolj
Accesses the current DIMTOLJ value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtol
Accesses the current DIMTOL value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtoh
Accesses the current DIMTOH value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtofl
Accesses the current DIMTOFL value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtmove
Accesses the current DIMTMOVE value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtm
Accesses the current DIMTM value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtix
Accesses the current DIMTIX value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtih
Accesses the current DIMTIH value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfillclr
Accesses the current dimension background color (if dimtfill is set to 1).

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfill
Accesses the dimension background color state, which can be one of the following values:
0 means the background color is disabled
1 means the use background color from dimtfillclr
2 means the use drawing's background color.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtfac
Accesses the current DIMTFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtdec
Accesses the current DIMTDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimtad
Accesses the current DIMTAD value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsoxd
Accesses the current DIMSOXD value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimse2
Accesses the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimse1
Accesses the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsd2
Accesses the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsd1
Accesses the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimscale
Accesses the current DIMSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimsah
Accesses current DIMSAH value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimrnd
Accesses the current DIMRND value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlwe
Accesses the current DIMLWE value for the dimension.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlwd
Accesses the current DIMLWD value for the dimension.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlunit
Accesses the current DIMLUNIT value for the dimension.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimltype
Accesses the dimension linetype.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimltex2
Accesses the object ID of the linetype of extension line 2.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimltex1
Accesses the object ID of the linetype of extension line 1.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlim
Accesses the current DIMLIM value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimlfac
Accesses the current DIMLFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimldrblk
Accesses the object ID of the block reference specified by the current DIMLDRBLK value of the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimjust
Accesses the current DIMJUST value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimjogang
Accesses the current large radial angle.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimgap
Accesses the current DIMGAP value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimfrac
Accesses the current DIMFRAC value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimexo
Accesses the current DIMEXO value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimexe
Accesses the current DIMEXE value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdsep
Accesses the current DIMDSEP value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdli
Accesses the current DIMDLI value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdle
Accesses the current DIMDLE value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimdec
Accesses the current DIMDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimclrt
Accesses the current DIMCLRT value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimclre
Accesses the current DIMCLRE value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimclrd
Accesses the current DIMCLRD value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimcen
Accesses the current DIMCEN value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimazin
Accesses the current DIMAZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaunit
Accesses the current DIMAUNIT value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimatfit
Accesses the current DIMATFIT value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimasz
Accesses the current DIMASZ value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimarcsym
Accesses the arc length placement value.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltz
Accesses the current DIMALTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltu
Accesses the current DIMALTU value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimalttz
Accesses the current DIMALTTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimalttd
Accesses the current DIMALTTD value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltrnd
Accesses the current DIMALTRND value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltf
Accesses the current DIMALTF value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimaltd
Accesses the current DIMALTD value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimalt
Accesses the current DIMALT value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.Dimadec
Accesses the current DIMADEC value for the database.

Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord.IsModifiedForRecompute
Assesses the modified state of this dimension style.