Autodesk.AutoCAD.Geometry.EllipticalArc2d
This .NET class wraps the AcGeEllipArc2d ObjectARX class.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Constructs an ellipse with the specified center, major and minor axes, major and minor radii, and start and end angles.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius
startAngle:  Input angle of ellipse start point
endAngle:  Input angle of ellipse end point

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double)
Constructs a full ellipse with the specified center, major and minor axes, and major and minor radii.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor(Autodesk.AutoCAD.Geometry.CircularArc2d)
Constructs a 2D ellipse that is identical to the input circular arc.
arc:  Input any 2D circular arc

Autodesk.AutoCAD.Geometry.EllipticalArc2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d)
This method calls EllipticalArc2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 2D linear entity

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the ellipse.
line:  Input any 2D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsCircular
This method calls EllipticalArc2d.IsCircular(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsCircular(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if an ellipse is a circular arc.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d)
This method calls EllipticalArc2d.IsInside(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines whether the input point lies inside the ellipse.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc2d.SetAxes(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Resets the major and minor axes of the ellipse.
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis

Autodesk.AutoCAD.Geometry.EllipticalArc2d.SetAngles(System.Double,System.Double)
Changes the start point and endpoint of the ellipse by resetting the angles of the start point and endpoint.
startAngle:  Input angle of ellipse startpoint
endAngle:  Input angle of ellipse endpoint

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Set(Autodesk.AutoCAD.Geometry.CircularArc2d)
Changes the definition of the ellipse to be identical to the input circular arc.
arc:  Input any 2D circular arc

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Changes the definition of the ellipse to have the specified center, major and minor axes, major and minor radii, and start and end angles.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius
startAngle:  Input angle of ellipse start point
endAngle:  Input angle of ellipse endpoint

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Double,System.Double)
Changes the definition of the ellipse to a full ellipse with the specified center, major and minor axes, and major and minor radii.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius

Autodesk.AutoCAD.Geometry.EllipticalArc2d.IsClockWise
Determines if the orientation of an ellipse is clockwise or counterclockwise.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.EndPoint
Returns the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.StartPoint
Returns the start point of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.EndAngle
Returns the angle of the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.StartAngle
Returns the angle of the ellipse start point.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MajorAxis
Returns the major axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MinorAxis
Returns the minor axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MajorRadius
Accesses the major radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.MinorRadius
Accesses the minor radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc2d.Center
Returns the center point of the ellipse.