Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase
This wraps the ObjectARX AcDbTextEditorSelectionBase class.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.InsertString(System.String)
This wraps the ObjectARX AcDbTextEditorSelectionBase::insertString() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.InsertColumnBreak
This wraps the ObjectARX AcDbTextEditorSelectionBase::insertColumnBreak() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.MaxWidthScale
This wraps the ObjectARX AcDbTextEditorSelectionBase::maxWidthScale() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.MinWidthScale
This wraps the ObjectARX AcDbTextEditorSelectionBase::minWidthScale() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.MaxTrackingFactor
This wraps the ObjectARX AcDbTextEditorSelectionBase::maxTrackingFactor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.MinTrackingFactor
This wraps the ObjectARX AcDbTextEditorSelectionBase::minTrackingFactor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.MaxObliqueAngle
This wraps the ObjectARX AcDbTextEditorSelectionBase::maxObliqueAngle() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.MinObliqueAngle
This wraps the ObjectARX AcDbTextEditorSelectionBase::minObliqueAngle() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.FlowAlignment
Gets and sets the flow alignment for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.WidthScale
Gets and sets the width scale factor for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.TrackingFactor
Gets and sets the tracking factor for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.ObliqueAngle
Gets and sets the oblique angle for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Strikethrough
Get current strikethrough state.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Overline
Gets and sets the overline property for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Underline
Gets and sets the underline property for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Color
Gets and sets the color for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Height
Gets and sets the text height for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Italic
Gets and sets the italic property for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Bold
Gets and sets the bold property for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Font
Gets and sSets the font for the current selection or cursor.

Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.Language
Gets and sets the language for the current selection or cursor.