Autodesk.AutoCAD.DatabaseServices.ItemLocator
ItemLocator wraps the ObjectARX class AcDbItemLocator.

Autodesk.AutoCAD.DatabaseServices.ItemLocator.#ctor(System.Int32,System.Int32,System.Int32)
Parameterized constructor.
itemIndex:  The input Index relative to the first item. itemIndex >= 0.
rowIndex:  The input Index relative to the first row. rowIndex >= 0.
levelIndex:  The input Index relative to the first level. levelIndex >=0.

Autodesk.AutoCAD.DatabaseServices.ItemLocator.LevelIndex
Item position relative to the first level.

Autodesk.AutoCAD.DatabaseServices.ItemLocator.RowIndex
Item position relative to the first row.

Autodesk.AutoCAD.DatabaseServices.ItemLocator.ItemIndex
Item position relative to the first item.