Autodesk.AutoCAD.GraphicsInterface.FaceData
This .NET class wraps the AcGiFaceData ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetColors(System.Int16[])
Sets colors to be the array of face color indices used by the FaceData object.
colors:  Input array of AutoCAD color indices

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
This function sets the array of face color used by the FaceData object.
colors:  Input array of EntityColor objects

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetLayers(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets layers to be the array of LayerTableRecord object IDs used by the FaceData object.
layers:  Input array of LayerTableRecord object IDs

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetNormalVectors(Autodesk.AutoCAD.Geometry.Vector3d[])
Sets normal to be the array of face normal vectors used by the FaceData object.
normal:  Input array of normal vectors.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetVisibility(System.Byte[])
Sets visibility to be the array of face visibility flags used by the FaceData object.
visibility:  Input array of visibility flags

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetColors
Returns an array of AutoCAD color indices, one for each face in the mesh or shell with which this object is used.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetLayers
Returns an array of LayerTableRecord object IDs, one for each face in the mesh or shell the FaceData object is used with.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetSelectionMarkers
Returns an array of graphic system selection markers (gsmarkers), one for each face in the mesh or shell the FaceData object is used with.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetSelectionMarkers(System.IntPtr[])
Sets selectionMarker to be the array of graphics system selection markers (gsmarkers) used by the FaceData object.
selectionMarker:  Input array of non-zero graphic system selection markers.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetNormalVectors
Returns the array of normal vectors, one for each face in the mesh or shell with which this object is used.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetTrueColors
Returns the array of EntityColor objects, one for each face in the mesh or shell with which this object is used.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetVisibility
Returns an array of visibility flags (that is, 0 == invisible, 1 == visible), one for each face in the mesh or shell the FaceData object is used with.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetMaterials(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Sets materials to the array of face materials used by the FaceData object.
materials:  Input array of materials to be set on the this object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetMaterials
Returns the array of materials assigned to the FaceData object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetMappers(Autodesk.AutoCAD.GraphicsInterface.Mapper[])
Sets mappers to be the array of face mappers used by the FaceData object.
mappers:  Input face mappers to be set on the this object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetMappers
Returns the array of mappers assigned to the FaceData object.

Autodesk.AutoCAD.GraphicsInterface.FaceData.SetTransparency(Autodesk.AutoCAD.Colors.Transparency[])
This .NET method wraps the ObjectARX method AcGiFaceData::setTransparency.
transparency:  Input Autodesk.AutoCAD.Colors.Transparency to set into the FaceData.

Autodesk.AutoCAD.GraphicsInterface.FaceData.GetTransparency
This .NET method wraps the ObjectARX method AcGiFaceData::transparency.