Autodesk.AutoCAD.DatabaseServices.AssocActionBody
Abstract base class for deriving custom action body classes that implement functionality of custom actions.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetParentAction(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the ObjectARX AcDbAssocActionBody::parentAction() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.SetStatus(Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean,System.Boolean)
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetDependencies(System.Boolean,System.Boolean)
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AddDependency(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.RemoveDependency(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.RemoveAllDependencies(System.Boolean)
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluateDependencies
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsActionEvaluationInProgress
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.currentEvaluationCallback
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.HasAnyErasedOrBrokenDependencies
This wraps the ObjectARX AcDbAssocActionBody::hasAnyErasedOrBrokenDependencies() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.CreateActionAndActionBodyAndPostToDatabase(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the ObjectARX AcDbAssocActionBody::createActionAndActionBodyAndPostToDatabase() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluateOverride
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetDependenciesOverride(System.Boolean,System.Boolean)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetDependentObjectsOverride(System.Boolean,System.Boolean)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.RemoveAllDependenciesOverride(System.Boolean)
Called from the corresponding method of the parent AssocAction class that owns this action body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsOwnedDependencyOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsExternalDependencyOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.HasDependencyCachedValueOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsRelevantDependencyChangeOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AreDependenciesOnTheSameThingOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AreDependenciesEqualOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluateDependencyOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DependentObjectClonedOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AddMoreObjectsToDeepCloneOverride(Autodesk.AutoCAD.DatabaseServices.IdMapping,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.PostProcessAfterDeepCloneOverride(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.PostProcessAfterDeepCloneCancelOverride(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.OwnedDependencyStatusChangedOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.IsEqualToOverride(Autodesk.AutoCAD.DatabaseServices.AssocAction)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluationPriorityOverride(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationPriority&)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetDependentActionsToEvaluateOverride(Autodesk.AutoCAD.DatabaseServices.ActionsToEvaluateCallback)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.TransformActionByOverride(Autodesk.AutoCAD.Geometry.Matrix3d)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.DragStatusOverride(Autodesk.AutoCAD.DatabaseServices.DragStatus)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.RemoveAllParams(System.Boolean)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::removeAllParams() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AddParam(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32&)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::addParam () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.RemoveParam(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::removeParam () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ParamsAtName(System.String)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::paramsAtName () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ParamAtName(System.String,System.Int32)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::paramAtName () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ParamAtName(System.String)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::paramAtName () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ParamAtIndex(System.Int32)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::paramAtIndex() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.OwnedValueParamNames
This wraps the ObjectARX AcDbAssocParamBasedActionBody::ownedValueParamNames() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetValueParam(System.String,System.Int32)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::getValueParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetValueParam(System.String)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::getValueParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetValueParamArray(System.String)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::getValueParamArray() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.SetValueParam(System.String,Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ValueParam,System.Boolean)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::setValueParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.SetValueParam(System.String,Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ValueParam,System.Boolean,System.Int32)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::setValueParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.SetValueParamArray(System.String,Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ValueParam[],System.Boolean)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::setValueParamArray() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.GetValueParamUnitType(System.String)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::valueParamUnitType() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.SetValueParamUnitType(System.String,Autodesk.AutoCAD.DatabaseServices.UnitType)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::setValueParamUnitType() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.RemoveValueParam(System.String)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::removeValueParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.OwnedParams
This wraps the ObjectARX AcDbAssocParamBasedActionBody::ownedParams () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ParamCount
This wraps the ObjectARX AcDbAssocParamBasedActionBody::paramCount () method.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.OwningNetwork
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.Status
Just a shortcut, calls the method on the parent AssocAction that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.ParentAction
Returns ObjectId of the parent AssocAction that owns this action body object.