Autodesk.AutoCAD.GraphicsSystem.Model
This .NET class wraps the AcGsModel ObjectARX class.

Autodesk.AutoCAD.GraphicsSystem.Model.#ctor(Autodesk.AutoCAD.GraphicsSystem.RenderType)
Constructs a new model with a render type.
renderType:  Input render type to associate with this model

Autodesk.AutoCAD.GraphicsSystem.Model.AddSceneGraphRoot(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs this Model that pRoot is a scene graph root.
pRoot:  Input object that is a scene graph root.

Autodesk.AutoCAD.GraphicsSystem.Model.EraseSceneGraphRoot(Autodesk.AutoCAD.GraphicsInterface.Drawable)
Informs this Model that pRoot is no longer a scene graph root.
pRoot:  Input object that was a scene graph root.

Autodesk.AutoCAD.GraphicsSystem.Model.OnAdded(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This notification informs the Graphic System (GS) that the specified Drawable has been added to the database represented by this Model.
added:  Input object that has been added to the database.
parent:  Input optional Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnModified(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This notification informs the Graphic System (GS) that the database representation of the specified Drawable has been modified.
modified:  Input object that has been modified.
parent:  Input optional Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnErased(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This notification informs the Graphic System (GS) that the specified Drawable has been removed from the underlying database; it offers the GS the opportunity to clean up the portion of its cache corresponding to the erase database object.
erased:  Input object that has been removed from the database.
parent:  Input optional Drawable parent.

Autodesk.AutoCAD.GraphicsSystem.Model.OnPaletteModified
This notification informs the GS that the color palette has changed.

Autodesk.AutoCAD.GraphicsSystem.Model.SetExtents(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Not implemented.
point3dx:  Not implemented
point3dy:  Not implemented

Autodesk.AutoCAD.GraphicsSystem.Model.Invalidate(Autodesk.AutoCAD.GraphicsSystem.InvalidationHint)
Invalidates a given Model, allowing it to invalidate and rebuild its cache.
hint:  Input hint about the invalidation required.

Autodesk.AutoCAD.GraphicsSystem.Model.SetSectioning(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Sets the active live sectioning for the Model.
pts:  Input array of co-planar points specifying a sectioning region.
upVector:  Input object that specifies the orientation of the plane containing pts.
top:  Input that specifies the top capping height of the sectioning.
bottom:  Input that specifies the bottom capping height of the sectioning.

Autodesk.AutoCAD.GraphicsSystem.Model.SetSectioning(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the active live sectioning for the Model.
pts:  Input array of co-planar points specifying a sectioning region.
upVector:  Input object that specifies the orientation of the plane containing pts.

Autodesk.AutoCAD.GraphicsSystem.Model.Selectable
Accesses the Selectable variable which controls if Model is selectable.

Autodesk.AutoCAD.GraphicsSystem.Model.ShadowPlaneLocation
Returns the models current ground plane z position in world coordinates.

Autodesk.AutoCAD.GraphicsSystem.Model.RenderType
Accesses the render type of this model.

Autodesk.AutoCAD.GraphicsSystem.Model.SectioningVisualStyle
Returns the visual style to be used for objects on the clipped side of the sectioning.

Autodesk.AutoCAD.GraphicsSystem.Model.EnableSectioning
Returns Boolean indicating whether or not the currently specified sectioning is active in Views displaying this Model.

Autodesk.AutoCAD.GraphicsSystem.Model.LinetypesEnabled
Returns true if linetypes are currently enabled.

Autodesk.AutoCAD.GraphicsSystem.Model.BackgroundId
Returns the object ID of the Background-derived object on the view, if one is set.

Autodesk.AutoCAD.GraphicsSystem.Model.VisualStyle
Returns the non-persistent visual style on the model.By default, the view displays models in the visual style assigned to the view.

Autodesk.AutoCAD.GraphicsSystem.Model.VisualStyleId
Returns the persistent visual style on the model.By default, the view displays models in the visual style assigned to the view.

Autodesk.AutoCAD.GraphicsSystem.Model.ViewClippingOverride
Pass true to this method to enable the geometry in a model to ignore the view's front and back clipping planes (if any).

Autodesk.AutoCAD.GraphicsSystem.Model.Transform
Returns whatever base modeling transformation has been set (or identity if none has been set) via setTransform.