Autodesk.AutoCAD.DatabaseServices.XrefGraphNode
This .NET class wraps the AcDbXrefGraphNode ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.XrefNotificationStatus
Returns the node's xref notification status.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.XrefStatus
Returns the node's xref status.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.IsNested
Returns True if this node  represents a nested xref that is not directly referenced in the host drawing.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.Database
Returns a pointer to the database relevant to this node.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.BlockTableRecordId
Returns the object ID of the BlockTableRecord associated with this node.

Autodesk.AutoCAD.DatabaseServices.XrefGraphNode.Name
Returns the name for this node.