Autodesk.AutoCAD.DatabaseServices.SweptSurface
This .NET class wraps the AcDbSweptSurface ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.TwistAlongPath
Specifies rotation of profile object.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.ScaleAlongPath
Specifies scaling of profile object.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.ProfileRotation
Specifies angle sweep of profile object.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.Bank
The sweep face or curve will be banked along the sweep path.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.SweepOptions
Returns the sweep options associated with this surface.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.PathLength
Returns the length of the path curve.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.PathProfile
This wraps the ObjectARXAcDbSweptSurface::pathProfile() method.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.SweepProfile
This wraps the ObjectARX AcDbSweptSurface::sweepProfile() method.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.PathEntity
Returns the sweep path of this surface.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.SweepEntity
Returns the sweep entity that describes this surface.