Autodesk.AutoCAD.Geometry.Entity3d
This .NET class wraps the AcGeEntity3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Entity3d.Clone
Returns a copy of this object.

Autodesk.AutoCAD.Geometry.Entity3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity3d)
This method calls Entity3d.IsEqualTo(Entity3d entity, Tolerance tolerance) with tolerance set to Global.
entity:  Input entity to check against

Autodesk.AutoCAD.Geometry.Entity3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two entities are equal to each other.
entity:  Input 3D mirror line
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Entity3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the entity by applying the input matrix.
transform:  Input transformation matrix

Autodesk.AutoCAD.Geometry.Entity3d.TranslateBy(Autodesk.AutoCAD.Geometry.Vector3d)
Translates the entity by the input vector.
translateVector:  Input vector by which entity is to be translated

Autodesk.AutoCAD.Geometry.Entity3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Rotates the entity by the input angle about the line defined by the input point and vector.
angle:  Input angle of rotation
vector:  Input vector about which entity is to be rotated
point:  Input point about which to rotate

Autodesk.AutoCAD.Geometry.Entity3d.Mirror(Autodesk.AutoCAD.Geometry.Plane)
Transforms the entity by mirroring it across the input plane.
plane:  Input 3D mirror line

Autodesk.AutoCAD.Geometry.Entity3d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Scales the entity about the input point by the input scale factor.
scaleFactor:  Input amount by which entity is to be scaled
point:  Input point about which entity is to be scaled

Autodesk.AutoCAD.Geometry.Entity3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Entity3d.IsOn(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input 3D point

Autodesk.AutoCAD.Geometry.Entity3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if point lies on entity; otherwise, returns false.
point:  Input 3D point
tolerance:  Input tolerance value