Autodesk.AutoCAD.DatabaseServices.GeometryOverrule
This .NET class wraps the ObjectARX class AcDbGeometryOverrule.

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.IntPtr,System.IntPtr)
This .NET method wraps the ObjectARX method: AcDbGeometryOverrule::intersectWith (AcDbEntity*, AcDbEntity*, AcDb::Intersect, AcGePlane&, AcGePoint3dArray&, Adesk::GsMarker, Adesk::GsMarker).

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.IntPtr,System.IntPtr)
This .NET method wraps the ObjectARX method: AcDbGeometryOverrule::intersectWith (AcDbEntity*, AcDbEntity*, AcDb::Intersect, AcGePoint3dArray&, Adesk::GsMarker, Adesk::GsMarker).

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.GetGeomExtents(Autodesk.AutoCAD.DatabaseServices.Entity)
This .NET method wraps the ObjectARX method AcDbGeometryOverrule::getGeomExtents().

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of an extension dictionary lookup to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.GeometryOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.