Autodesk.AutoCAD.DatabaseServices.AngularConstraint
This class represents an angle constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.AngularConstraint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AngularConstraint.SetAngleMultiplier(System.Double)
Sets a multiplier that is used to multiply angles obtained from AssocValueDependencies that depend on AssocVariables to convert the angles to radians.
multiplier:  The angle multiplication factor.

Autodesk.AutoCAD.DatabaseServices.AngularConstraint.AngleMultiplier
Returns the current angle multipiler.

Autodesk.AutoCAD.DatabaseServices.AngularConstraint.SectorType
Gets the angle sector type of this angle constraint.