Autodesk.AutoCAD.DatabaseServices.CellBorder
This is class Autodesk.AutoCAD.DatabaseServices.CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.Overrides
This is Overrides, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.Margin
This is Margin, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.Linetype
This is Linetype, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.LineWeight
This is LineWeight, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.IsVisible
This is IsVisible, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.LineStyle
This is LineStyle, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.DoubleLineSpacing
This is DoubleLineSpacing, a member of class CellBorder.

Autodesk.AutoCAD.DatabaseServices.CellBorder.Color
This is Color, a member of class CellBorder.