Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters
AssocArrayRectangularParameters wraps the ObjectARX AcDbAssocArrayRectangularParameters class.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double,System.Double)
Parameterized constructor.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.GetColumnCount(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.SetColumnCount(System.Int32,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::setColumnCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.GetColumnSpacing(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.SetColumnSpacing(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::setColumnSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.GetAxesAngle(System.String&,System.String&)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axesAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.SetAxesAngle(System.Double,System.String,System.String)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::setAxesAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.YAxisDirection
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axisDirection() and AcDbAssocArrayRectangularParameters::setAxisDirection() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.XAxisDirection
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axisDirection() and AcDbAssocArrayRectangularParameters::setAxisDirection() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.AxesAngle
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axesAngle() and AcDbAssocArrayRectangularParameters::setAxesAngle() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.ColumnSpacing
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnSpacing() and AcDbAssocArrayRectangularParameters::setColumnSpacing() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.ColumnCount
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnCount() and AcDbAssocArrayRectangularParameters::setColumnCount() methods.