Autodesk.AutoCAD.DatabaseServices.Section
This .NET class wraps the AcDbSection ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Section.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructor.
pts:  Input vertex points on the section line; should contain at least two points
verticalDir:  Input vector on the first segment's plane, normal to the section line
vecViewingDir:  Input vector specifying the viewing direction

Autodesk.AutoCAD.DatabaseServices.Section.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a section plane using the specified points and vector.
pts:  Input vertex points on the section line; should contain at least two points
verticalDir:  Input vector on the first segment's plane, normal to the section line

Autodesk.AutoCAD.DatabaseServices.Section.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Section.GetVertex(System.Int32)
Gets the position of the specified vertex.
nIndex:  Input zero-based index of the vertex to be retrieved; should be less than the number of vertices

Autodesk.AutoCAD.DatabaseServices.Section.SetVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets the position of the specified vertex.
nIndex:  Input zero-based index of the vertex to set; should be less than the number of vertices
pt:  Input new position of the vertex

Autodesk.AutoCAD.DatabaseServices.Section.AddVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Inserts or adds a new vertex to the section plane.
nInsertAt:  Input index at which to add the new vertex
pt:  Input position of the new vertex

Autodesk.AutoCAD.DatabaseServices.Section.RemoveVertex(System.Int32)
Removes a vertex from the section plane.
nIndex:  Input index of the vertex to remove
nHeightType:  Input one of the Height enum values
fHeight:  Input height

Autodesk.AutoCAD.DatabaseServices.Section.GetVertices(Autodesk.AutoCAD.Geometry.Point3dCollection)
Returns all section plane vertices in the pts array.
pts:  Output reference to receive vertices

Autodesk.AutoCAD.DatabaseServices.Section.Height(Autodesk.AutoCAD.DatabaseServices.SectionHeight)
Returns the height of the section plane above or below the section line.
nHeightType:  Input one of the SectionHeight enum values

Autodesk.AutoCAD.DatabaseServices.Section.SetHeight(Autodesk.AutoCAD.DatabaseServices.SectionHeight,System.Double)
Sets the height of the section plane above or below the section line.
nHeightType:  Input one of the Height enum val
fHeight:  Input height Sets the height of the section plane above or below the section line. The height is the indicator height when the section plane type is plane or boundary, since the cuts extends infinitely in the vertical direction for these two types.

Autodesk.AutoCAD.DatabaseServices.Section.HitTest(Autodesk.AutoCAD.Geometry.Point3d)
Performs a hit test on the section plane and returns the result.
ptHit:  Input point to perform hit test

Autodesk.AutoCAD.DatabaseServices.Section.CreateJog(Autodesk.AutoCAD.Geometry.Point3d)
Creates a jog in the section plane at the specified point.
ptOnSection:  Input point on the section line at which to create the jog

Autodesk.AutoCAD.DatabaseServices.Section.GenerateSectionGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,System.Array&,System.Array&,System.Array&,System.Array&,System.Array&)
Generates 2D or 3D section geometry.
pEnt:  Input sectionable entity
pIntFillEnts:  Return array containing intersection boundary geometry
pBackgroundEnts:  Return array containing intersection fill annotation geometry
pForegroundEnts:  Return array containing background geometry
pFurveTangencyEnts:  Return array containing foreground geometry
pCurveTangencyEnts:  Return array containing curve tangency geometry

Autodesk.AutoCAD.DatabaseServices.Section.SectionPlaneOffset
Returns the section plane offset distance.

Autodesk.AutoCAD.DatabaseServices.Section.BottomPlane
Returns the BottomPlane property value.

Autodesk.AutoCAD.DatabaseServices.Section.TopPlane
Returns TopPlane property value.

Autodesk.AutoCAD.DatabaseServices.Section.Elevation
Specifies elevation of the plane.

Autodesk.AutoCAD.DatabaseServices.Section.IsLiveSectionEnabled
Returns true if live sectioning is enabled in the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.Settings
Returns the setting property value.

Autodesk.AutoCAD.DatabaseServices.Section.Boundary
Assesses the section plane that is bounded by the section line, two side lines, and a back line.

Autodesk.AutoCAD.DatabaseServices.Section.Vertices
Returns the 3D vertices of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.NumVertices
Returns the number of vertices on the section line of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.IndicatorFillColor
Returns the fill color of the section plane indicator.

Autodesk.AutoCAD.DatabaseServices.Section.IndicatorTransparency
Returns the transparency value for the section plane indicator.

Autodesk.AutoCAD.DatabaseServices.Section.Normal
Returns the normal vector.

Autodesk.AutoCAD.DatabaseServices.Section.VerticalDirection
Returns a unit vector specifying the vertical direction of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.ViewingDirection
Returns a unit vector that specifies the viewing direction of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.Name
Returns the name of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.HasJogs
Returns if the section has jogs.

Autodesk.AutoCAD.DatabaseServices.Section.ThicknessDepth
Returns the thickness depth of a slice type section.

Autodesk.AutoCAD.DatabaseServices.Section.IsSlice
Specifies if a section object is a slice type.

Autodesk.AutoCAD.DatabaseServices.Section.State
Returns the state of this section object.