Autodesk.AutoCAD.ComponentModel.IPropertyProvider
Provides access to optional or "per-instance" properties.

Autodesk.AutoCAD.ComponentModel.IPropertyProvider.GetProperties(System.Object)
Returns a collection of PropertyDescriptor objects based on a given object instance.
instance:  Input the instance to retrieve from