Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface
This class represents an extruded surface entity.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.TaperAngle
Accesses the angle of taper in radians.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepOptions
Accesses the options used to create this extruded surface.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.Height
Accesses the extrusion height.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepVec
Accesses the sweep vector.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepProfile
This wraps the ObjectARX AcDbExtrudedSurface::sweepProfile() method.

Autodesk.AutoCAD.DatabaseServices.ExtrudedSurface.SweepEntity
Accesses the sweep entity used to create the extruded surface.