Autodesk.AutoCAD.Geometry.Entity2d
This .NET class wraps the AcGeEntity2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Entity2d.Clone
Returns a copy of this object.

Autodesk.AutoCAD.Geometry.Entity2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity2d)
This method calls Entity2d.IsEqualTo(Entity2d entity, Tolerance tolerance) with tolerance set to Global.
entity:  Input entity to check against

Autodesk.AutoCAD.Geometry.Entity2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Entity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two entities are equal to each other.
entity:  Input entity to check against
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Entity2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transforms the entity by applying the input matrix.
transform:  Input transformation matrix

Autodesk.AutoCAD.Geometry.Entity2d.TranslateBy(Autodesk.AutoCAD.Geometry.Vector2d)
Translates the entity by the input vector.
translateVector:  Input vector by which entity is to be translated

Autodesk.AutoCAD.Geometry.Entity2d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Rotates the entity about the input point by the input angle.
angle:  Input angle of rotation
point:  Input point about which to rotate

Autodesk.AutoCAD.Geometry.Entity2d.Mirror(Autodesk.AutoCAD.Geometry.Line2d)
Transforms the entity by mirroring it across the input line.
line:  Input 2D mirror line

Autodesk.AutoCAD.Geometry.Entity2d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Scales the entity about the input point by the input scale factor.
scaleFactor:  Input amount by which entity is to be scaled
point:  Input point about which entity is to be scaled

Autodesk.AutoCAD.Geometry.Entity2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Entity2d.IsOn(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input 2D point

Autodesk.AutoCAD.Geometry.Entity2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if point lies on entity; otherwise, returns false.
point:  Input 2D point
tolerance:  Input tolerance value