Autodesk.AutoCAD.GraphicsInterface.Glyph
This .NET class wraps the AcGiGlyph ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.Glyph.SetLocation(Autodesk.AutoCAD.Geometry.Point3d)
This method is invoked from a host application immediately prior to invoking ViewportDraw() or WorldDraw() on the glyph.
point:  Input display coordinate system (DCS) point.

Autodesk.AutoCAD.GraphicsInterface.Glyph.Id
This method is not used for a Glyph.

Autodesk.AutoCAD.GraphicsInterface.Glyph.IsPersistent
This method is not used for an Glyph.