Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo
This wraps the ObjectARX AcDbSurfaceTrimInfo class.

Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo.#ctor
This wraps the ObjectARX AcDbSurfaceTrimInfo::AcDbSurfaceTrimInfo() method.

Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo.ProjVector
This wraps the ObjectARX AcDbSurfaceTrimInfo::projVector() and AcDbSurfaceTrimInfo::setProjVector() methods.

Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo.Relation
This wraps the ObjectARX AcDbSurfaceTrimInfo::relation() and AcDbSurfaceTrimInfo::setRelation () methods.

Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo.ToolBodyId
This wraps the ObjectARX AcDbSurfaceTrimInfo::toolBodyId() and AcDbSurfaceTrimInfo::setToolBodyId() methods.

Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo.IsCurve
This wraps the ObjectARX AcDbSurfaceTrimInfo::isCurve() method.