Autodesk.AutoCAD.DatabaseServices.BeginWblockEntireDatabaseEventArgs
This class provides data for the BeginWblockEntireDatabase event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockEntireDatabaseEventArgs.From
Gets the database being wblock'ed.