Autodesk.AutoCAD.DatabaseServices.Curve
This .NET class wraps the AcDbCurve ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Curve.GetPointAtParameter(System.Double)
This function determines the point on the curve that corresponds to value, and returns the point.
value:  Input parameter on the curve at which the point is desired

Autodesk.AutoCAD.DatabaseServices.Curve.GetParameterAtPoint(Autodesk.AutoCAD.Geometry.Point3d)
This function determines the parameter of the curve at point and returns the parameter.
point:  Input point (in WCS coordinates) on the curve at which the parameter is desired Returns the parameter of the curve at point

Autodesk.AutoCAD.DatabaseServices.Curve.GetDistanceAtParameter(System.Double)
Returns the distance.
value:  Input the object representing the parameter.

Autodesk.AutoCAD.DatabaseServices.Curve.GetParameterAtDistance(System.Double)
This function determines the parameter of the curve at the location that is a distance of dist along the curve from the curve start.
dist:  Input distance along the curve from the beginning of the curve to the location for the desired parameter.

Autodesk.AutoCAD.DatabaseServices.Curve.GetDistAtPoint(Autodesk.AutoCAD.Geometry.Point3d)
Returns the distance to the point.
point:  Input the object representing the point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetPointAtDist(System.Double)
This function determines the point on the curve that is a distance of value along the curve from the curve start, and returns the point.
value:  Input distance along the curve from the beginning of the curve to the location of the desired point

Autodesk.AutoCAD.DatabaseServices.Curve.GetFirstDerivative(Autodesk.AutoCAD.Geometry.Point3d)
Returns the first derivative.
point:  Input the derivative value

Autodesk.AutoCAD.DatabaseServices.Curve.GetFirstDerivative(System.Double)
Returns the first derivative of the vector.
value:  Input the derivative value

Autodesk.AutoCAD.DatabaseServices.Curve.GetSecondDerivative(Autodesk.AutoCAD.Geometry.Point3d)
Returns the second derivative.
point:  Input the derivative value

Autodesk.AutoCAD.DatabaseServices.Curve.GetSecondDerivative(System.Double)
Returns the second derivative.
value:  Input the derivative value

Autodesk.AutoCAD.DatabaseServices.Curve.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)
This function finds the point on the curve that is nearest to givenPoint and returns the result.
givenPoint:  Input the point (in WCS coordinates) for which to find nearest point on curve
direction:  Input the normal vector (in WCS coordinates) for plane to project onto
extend:  Input whether or not to extend curve in search for nearest point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
This function projects the curve onto the plane defined by givenPoint. Returns the point (in WCS coordinates) on the curve that is nearest to givenPoint.
givenPoint:  Input the point (in WCS coordinates) for which to find nearest point on curve
extend:  Input whether or not to extend curve in search for nearest point.

Autodesk.AutoCAD.DatabaseServices.Curve.GetOrthoProjectedCurve(Autodesk.AutoCAD.Geometry.Plane)
This function creates a new curve entity that is the result of projecting the curve along the given plane.
planeToProjectOn:  Input plane onto which the curve is to be projected

Autodesk.AutoCAD.DatabaseServices.Curve.GetProjectedCurve(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
This function creates a new curve entity that is the result of projecting the curve parallel to projectionDirection onto the planeToProjectOn and returns it.
planeToProjectOn:  Input plane onto which the curve is to be projected
projectionDirection:  Input direction (in WCS coordinates) of the projection

Autodesk.AutoCAD.DatabaseServices.Curve.GetOffsetCurves(System.Double)
Returns the a collection of the offset curves.
offsetDist:  Input the distance to offset the curve

Autodesk.AutoCAD.DatabaseServices.Curve.GetOffsetCurvesGivenPlaneNormal(Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Returns a collection of the offset curves.
normal:  Input the normal vector for plane in which to offset
offsetDist:  Input distance to offset the curve

Autodesk.AutoCAD.DatabaseServices.Curve.GetSplitCurves(Autodesk.AutoCAD.Geometry.Point3dCollection)
This function creates one or more entities that are all subcurves of the original.
points:  Input collection of parameters on the curve

Autodesk.AutoCAD.DatabaseServices.Curve.GetSplitCurves(Autodesk.AutoCAD.Geometry.DoubleCollection)
This function creates one or more entities that are all subcurves of the original.
value:  Input collection of points (in WCS coordinates) on the curve

Autodesk.AutoCAD.DatabaseServices.Curve.Extend(System.Boolean,Autodesk.AutoCAD.Geometry.Point3d)
This function extends the curve to the point specified.
extendStart:  Input whether to extend the curve's start or end .
toPoint:  Input the new start or end point of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.Extend(System.Double)
This function extends the beginning or end of the curve to the new point determined by the newParameter value.
newParameter:  Input the new start or end parameter on the curve

Autodesk.AutoCAD.DatabaseServices.Curve.ReverseCurve
This function reverses the parameterization of the curve: The start becomes the end and visa versa.

Autodesk.AutoCAD.DatabaseServices.Curve.GetGeCurve
This is GetGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.GetGeCurve(Autodesk.AutoCAD.Geometry.Tolerance)
This is GetGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.CreateFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d)
This is CreateFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.CreateFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
This is CreateFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.CreateFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
This is CreateFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.CreateFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
This is CreateFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.SetFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d)
This is SetFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.SetFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
This is SetFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.SetFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
This is SetFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.SetFromGeCurve(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
This is SetFromGeCurve, a member of class Curve.

Autodesk.AutoCAD.DatabaseServices.Curve.Area
Accesses the area of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.Spline
Returns pointing to a spline approximation of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.EndPoint
Accesses the end point (in WCS coordinates) of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.StartPoint
Returns the starting point of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.EndParam
Accesses the parameter of the endpoint of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.StartParam
Returns the parameter of the start of the curve.

Autodesk.AutoCAD.DatabaseServices.Curve.IsPeriodic
Returns true if the curve is periodic.

Autodesk.AutoCAD.DatabaseServices.Curve.Closed
Returns true if the curve is closed.