Autodesk.AutoCAD.Runtime.Marshaler
This class provides utility methods for converting bitmaps and subentity paths between managed objects and unmanaged pointers.

Autodesk.AutoCAD.Runtime.Marshaler.BitmapInfoToBitmap(System.IntPtr)
Converts bitmapInfo to Bitmap.
bitmapInfo:  Input bitmap info object

Autodesk.AutoCAD.Runtime.Marshaler.BitmapToBitmapInfo(System.Drawing.Bitmap)
Converts bitmap to BitmapInfo.
bitmap:  Input bitmap

Autodesk.AutoCAD.Runtime.Marshaler.CopyToUnmanagedFullSubentityPath(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.IntPtr)
Converts path to an unmanaged path object.
path:  Input path to copy
newPath:  Input new path

Autodesk.AutoCAD.Runtime.Marshaler.CopyToManagedFullSubentityPath(System.IntPtr)
Returns the result of converting path to a managed path object.
path:  Input path to copy

Autodesk.AutoCAD.Runtime.Marshaler.ObjectToAcValue(System.Object,System.IntPtr)
Overloads for the Marshaler.ObjectToAcValue method.
obj:  Input.

Autodesk.AutoCAD.Runtime.Marshaler.AcValueToObject(System.IntPtr)
Converts acValueObj to Object.
acValueObj:  Input AcValue object

Autodesk.AutoCAD.Runtime.Marshaler.ObjectToResbuf(System.Object)
This is ObjectToResbuf, a member of class Marshaler.