Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d
This .Net class wraps AcGeCurveCurveInt2d ObjectARX class.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)
Constructs an object that represents the intersection of the two input curves.
curve1:  Input first curve
curve2:  Input second curve
range1:  Input first range interval
range2:  Input second range interval

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d)
Constructs an object that represents the intersection of the two input curves.
curve1:  Input first curve
curve2:  Input second curve

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.#ctor
This default constructor would typically be used as a placeholder where the curves would be specified by a subsequent call to one of the Set() functions.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionRanges
Returns the two intervals for which intersection points and overlap will be returned.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionPoint(System.Int32)
Returns the specified intersection point.
number:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionParameters(System.Int32)
Returns the parameter values on each curve of the specified intersection point.
intersection:  Input intersection point

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetPointOnCurve1(System.Int32)
Returns the specified intersection point as an PointOnCurve2d object of the first curve.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetPointOnCurve2(System.Int32)
Returns the specified intersection point as an PointOnCurve2d object of the second curve.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.IsTangential(System.Int32)
Returns whether the specified intersection point is a tangential intersection.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.IsTransversal(System.Int32)
Returns whether the specified intersection point is a transversal intersection.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetIntersectionPointTolerance(System.Int32)
Returns the tolerance that was used to find the specified intersection point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.GetOverlapRanges(System.Int32)
Returns the intervals of overlap of each curve of the specified overlap.
overlapNumber:  Input number of overlaps to get intervals for

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.ChangeCurveOrder
Reverses the order of the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.OrderWithRegardsTo1
Reorders intersection points so that they will be returned in increasing parameter values with respect to the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.OrderWithRegardsTo2
Reorders intersection points so that they will be returned in increasing parameter values with respect to the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval)
This method calls CurveCurveIntersector2d.Set(Curve2d curve1, Curve2d curve2, Interval range1, Interval range2, Tolerance tolerance) with tolerance set to Global.
curve1:  Input any 2D curve
curve2:  Input any 2D curve
range1:  Input subset of curve1 domain
range2:  Input subset of curve2 domain

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d)
This method calls CurveCurveIntersector2d.Set(Curve2d curve1, Curve2d curve2, Tolerance tolerance) with tolerance set to Global.
curve1:  Input any 2D curve
curve2:  Input any 2D curve

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.OverlapDirection
Returns true if the two curves are oriented in the same direction where they overlap and false if they are oriented in the opposite direction.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.OverlapCount
Returns the number of intervals of overlap between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.NumberOfIntersectionPoints
Returns the number of intersection points between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Tolerance
Returns the tolerance that will be used when intersecting the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Curve2
Returns a pointer to the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector2d.Curve1
Returns a pointer to the first curve.