Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute
This attribute is used to grant access to ObjectDBX.

Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute.#ctor(System.String,System.String,System.String,System.String)
Constructor.
license:  Input license
ourSignature:  Input signature
clientSignature:  Input client signature
clientPublicKey:  Input the client's public key

Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute.ClientPublicKey
Returns the ClientPublicKey property value.

Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute.ClientSignature
Returns the ClientSingature property value.

Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute.OurSignature
Returns the base64 encoded digital signature computed over the license.

Autodesk.AutoCAD.Runtime.SecuredApplicationAttribute.License
Returns the License property value.