Autodesk.AutoCAD.Geometry.NurbCurve3dFitData
This class contains the data returned by the NurbCurve3.FitData property.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.IsEqualTo(Autodesk.AutoCAD.Geometry.NurbCurve3dFitData)
Compares this object to a and returns true if they are equal.
a:  Input object to compare against

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.op_Inequality(Autodesk.AutoCAD.Geometry.NurbCurve3dFitData,Autodesk.AutoCAD.Geometry.NurbCurve3dFitData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.op_Equality(Autodesk.AutoCAD.Geometry.NurbCurve3dFitData,Autodesk.AutoCAD.Geometry.NurbCurve3dFitData)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.EndTangent
Returns the EndTangent property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.StartTangent
Returns the StartTangent property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.TangentsExist
Returns the TangentsExist property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.FitTolerance
Returns the FitTolerance property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.Degree
Returns the Degree property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dFitData.FitPoints
Returns the FitPoints property value.