Autodesk.AutoCAD.Runtime.FileOperationsEventArgs
Contains file operations event data.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.VetoStatus
Gets the veto status of the file operation event.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.FilePath
Gets the full path of the file for which the event is occurring.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.ReloadNested
This file operation event is for a reload triggered by an ancestor being reloaded.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.ReloadPrimary
This file operation event is for a file being explicitly reloaded.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.ReferenceFile
This file operation event is for a reference file (i.e.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.KnownToBeUnmodified
This file operation event is for a that is known to be unmodified.

Autodesk.AutoCAD.Runtime.FileOperationsEventArgs.ReadOnly
This file operation event is for a read-only file or not.