Autodesk.AutoCAD.Geometry.KnotCollection
Represents a collection of Knots.

Autodesk.AutoCAD.Geometry.KnotCollection.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.KnotCollection.CopyTo(System.Double[],System.Int32)
Copies objects in array to this collection.
array:  Input array to copy to
index:  Input index to begin copying at

Autodesk.AutoCAD.Geometry.KnotCollection.Add(System.Double)
Adds the object represented by value to this collection.
value:  Input value to add

Autodesk.AutoCAD.Geometry.KnotCollection.Contains(System.Double)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input value to check existence of

Autodesk.AutoCAD.Geometry.KnotCollection.Insert(System.Int32,System.Double)
Inserts value at position index in the collection.
index:  Input index to insert at
value:  Input value to insert

Autodesk.AutoCAD.Geometry.KnotCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Input index of item to remove

Autodesk.AutoCAD.Geometry.KnotCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Geometry.KnotCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.Geometry.KnotCollection.GetDistinctKnots
Computes a sequence of all knot values from this collection without repetitions.

Autodesk.AutoCAD.Geometry.KnotCollection.GetMultiplicityAt(System.Int32)
Returns knot multiplicity of the knot value specified by index i.
i:  Input index

Autodesk.AutoCAD.Geometry.KnotCollection.GetInterval(System.Int32,System.Double,Autodesk.AutoCAD.Geometry.Interval&)
Returns the non-zero length intervals between knots.
order:  Input order of a spline
parameter:  Input parameter
interval:  Output containing knot interval

Autodesk.AutoCAD.Geometry.KnotCollection.IsOn(System.Double)
Returns true if knot is a knot value of this knot collection to its tolerance.
knot:  Input value

Autodesk.AutoCAD.Geometry.KnotCollection.Reverse
Performs a linear transformation on the knot sequence so the first knot is mapped to the maximal value and vice versa.

Autodesk.AutoCAD.Geometry.KnotCollection.SetRange(System.Double,System.Double)
Sets the range of collection between lower and upper parameter.
lower:  Input new lower knot
upper:  Input new upper knot

Autodesk.AutoCAD.Geometry.KnotCollection.Split(System.Double,System.Int32,System.Int32)
Splits knot sequence at the specified parameter value.
parameter:  Input split parameter
multiplicityLast:  Input multiplicity of the last knot in the head fraction.
multiplicityFirst:  Input multiplicity of the first knot in the tail fraction

Autodesk.AutoCAD.Geometry.KnotCollection.NumberOfIntervals
Returns the number of interval associated with the collection.

Autodesk.AutoCAD.Geometry.KnotCollection.EndParameter
Returns end parameter of the collection.

Autodesk.AutoCAD.Geometry.KnotCollection.StartParameter
Returns end parameter of the collection.

Autodesk.AutoCAD.Geometry.KnotCollection.Tolerance
Returns the Tolerance property value.

Autodesk.AutoCAD.Geometry.KnotCollection.Count
Returns the number of items in the collection.