Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame
This .NET class wraps the AcDbFcf ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.#ctor(System.String,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructor which sets values for various properties.
codes:  Input text string containing the codes to specify the feature control symbols and the tolerance for this object. If this value is Null, this is just like calling the default constructor.
insertionPoint:  Input Insertion point (WCS) of this Fcf object
normalVector:  Input Normal vector (WCS) of the plane containing this Fcf object
: Input X-direction vector (WCS) of this Fcf

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.SetOrientation(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets norm to be the Fcf plane normal and dir to be the X-direction for the Fcf.
norm:  Input vector (in WCS) to be used to define the new plane that will contain the Fcf
dir:  Input X-Direction vector (WCS) for the Fcf

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPoints
Returns all the consecutive distinct corner points of the Fcf object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
Returns a Point3dCollection as follows: ptArray[0] == top left corner of Fcf
ptArray[1] == top right corner of Fcf
ptArray[2] == bottom right corner of Fcf
ptArray[3] == bottom left corner of Fcf
All points are in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Sets a new dimension variable as determined by style.
style:  Input objectId of the desired DimensionStyle to be used by the Fcf

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetDimstyleData
Copies and returns the DimStyle information from the DimensionStyleTableRecord referenced by this object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.TextStyleName
Accesses the text style name.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.TextStyleId
Accesses the text style ID.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.DimensionStyleName
Accesses the associated dimension style name.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimtxt
Accesses the current DIMTXT value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimtxsty
Accesses the objectId of the textStyle specified by the current DIMTXSTY value of the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimscale
Accesses the current DIMSCALE value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimgap
Accesses the current DIMGAP value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimclrt
Accesses the current DIMCLRT value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Dimclrd
Accesses the current DIMCLRD value for the feature control frame.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.DimensionStyle
Accesses the objectId of the object's DimensionStyle.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Direction
Accesses the X-direction vector (in WCS) for the object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Normal
Accesses the unit normal vector (in WCS) of the plane containing the Fcf object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Location
Accesses the insertion point (in WCS) of the Fcf object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.Text
Accesses the text to be the text string used by the Fcf.