Autodesk.AutoCAD.DatabaseServices.SubentityOverrule
This .NET class wraps the ObjectARX class AcDbSubentityOverrule.

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.AddSubentPaths(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::addSubentPaths().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.DeleteSubentPaths(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::deleteSubentPaths().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.TransformSubentPathsBy(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.Geometry.Matrix3d)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::transformSubentPathsBy().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.GetGripPointsAtSubentPath(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.GripDataCollection,System.Double,System.Int32,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.GetGripPointsFlags)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getGripPointsAtSubentPath().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.MoveGripPointsAtSubentPaths(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.DatabaseServices.GripDataCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.MoveGripPointsFlags)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::moveGripPointsAtSubentPaths().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.GetSubentPathsAtGsMarker(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityType,System.IntPtr,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.DatabaseServices.ObjectId[])
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getSubentPathsAtGsMarker().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.GetGsMarkersAtSubentPath(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getGsMarkersAtSubentPath().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.SubentPtr(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::subentPtr().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.OnSubentGripStatusChanged(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripStatus,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::subentGripStatus().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.GetCompoundObjectTransform(Autodesk.AutoCAD.DatabaseServices.Entity)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getCompoundObjectTransform().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.GetSubentPathGeomExtents(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getSubentPathGeomExtents().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.GetSubentClassId(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getSubentClassId().

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.SubentityOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.