Autodesk.AutoCAD.DatabaseServices.RotatedDimension
This class wraps the AcDbRotatedDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.Rotation
Accesses the dimension's rotation angle in radians.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.Oblique
Accesses the extension line obliquing angle (in radians) for the dimension.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.DimLinePoint
Accesses the definition point (in WCS coordinates) that specifies where the dimension line will be (that is, this point will be somewhere on the dimension line).

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.XLine2Point
Accesses the definition point (in WCS coordinates) that's used as the start point for the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.RotatedDimension.XLine1Point
Accesses the dimension to use (in WCS coordinates) as the definition point that's used as the start point for the first extension line of the dimension.