Autodesk.AutoCAD.Geometry.Cylinder
This .NET class wraps the AcGeCylinder ObjectARX class.

Autodesk.AutoCAD.Geometry.Cylinder.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Constructs a bounded cylinder defined by the input data.
radius:  Input cylinder radius
origin:  Input base point on the cylinder axis
axisOfSymmetry:  Input axis of rotation
referenceAxis:  Input reference vector on the base circle
height:  Input interval on the axis referred by the origin
startAngle:  Input start angle on the base circle
endAngle:  Input end angle on the base circle

Autodesk.AutoCAD.Geometry.Cylinder.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an infinite cylinder defined by the input data.
radius:  Input cylinder radius
origin:  Input reference point on the cylinder axis
axisOfSymmetry:  Input rotation axis

Autodesk.AutoCAD.Geometry.Cylinder.#ctor
Constructs a valid infinite default cylinder.

Autodesk.AutoCAD.Geometry.Cylinder.GetAngles
Computes start and end angles on the base circle.

Autodesk.AutoCAD.Geometry.Cylinder.GetHeightAt(System.Double)
Returns the input parameter converted into the parameterization defined by the origin and the axis vector.
parameter:  Input parameter from cylinder domain

Autodesk.AutoCAD.Geometry.Cylinder.IsClosed
This method calls Cylinder.IsClosed(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Cylinder.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if cylindrical segment is a full circular cylinder with respect to the tolerance specified.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Cylinder.SetAngles(System.Double,System.Double)
Changes cylinder definition to satisfy the input data.
startAngle:  Input start angle
endAngle:  Input end angle

Autodesk.AutoCAD.Geometry.Cylinder.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Changes cylinder definition to satisfy the input data.
radius:  Input radius
origin:  Input origin
axisOfSymmetry:  Input axis of rotation
referenceAxis:  Input reference vector
height:  Input height interval
startAngle:  Input start angle
endAngle:  Input end angle

Autodesk.AutoCAD.Geometry.Cylinder.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes cylinder definition to satisfy the input data.
radius:  Input radius
origin:  Input origin
axisOfSymmetry:  Input axis of rotation

Autodesk.AutoCAD.Geometry.Cylinder.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls Cylinder.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.Cylinder.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes the intersections with a linear entity.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Cylinder.Height
Computes interval on the axis parameterized by the origin and the axis vector.

Autodesk.AutoCAD.Geometry.Cylinder.IsOuterNormal
Returns flag indicating if the surface normal is pointing outwards.

Autodesk.AutoCAD.Geometry.Cylinder.ReferenceAxis
Returns reference vector on the base circle.

Autodesk.AutoCAD.Geometry.Cylinder.AxisOfSymmetry
Returns vector indicating the rotation axis.

Autodesk.AutoCAD.Geometry.Cylinder.Origin
Returns origin of the cylinder.

Autodesk.AutoCAD.Geometry.Cylinder.Radius
Accesses the radius of the cylinder.