Autodesk.AutoCAD.GraphicsInterface.WebLightTraits
This .NET class wraps the AcGiWebLightTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.WebHorzAng90to270
Returns whether the horizontal angle 90 to 270 flag is set.

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.WebSymmetry
Returns the type of symmetry in the web file.

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.WebFileType
Returns the type of web file.

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.WebFlux
Returns the flux value set for the web light (in lumens).

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.WebRotation
Returns the rotation offset (specified in XYZ Euler angles) used to orient the goniometric data relative to the light orientation.

Autodesk.AutoCAD.GraphicsInterface.WebLightTraits.WebFile
.