Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits
This .NET class wraps the AcGiRenderEnvironmentTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.EnvironmentMap
Returns the environment texture map.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.FarPercentage
Returns the far percentage of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.NearPercentage
Returns the near percentage of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.FarDistance
Returns the far distance of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.NearDistance
Returns the near distance of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.FogColor
Returns the color of the fog.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.IsBackground
Returns true if the fog is set as background, false otherwise.

Autodesk.AutoCAD.GraphicsInterface.RenderEnvironmentTraits.Enable
Returns true if the fog is enabled, false otherwise.