Autodesk.AutoCAD.DatabaseServices.GeoLocationData
This .NET class wraps the AcDbGeoData ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.GetMeshPointMap(System.Int32)
This function gets the source point and destination point pair at the specified index as a MeshPointMap.
index:  Input the index to insert at

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.GetMeshPointMaps
This function gets a GeoMesh source points collection and a destination points collection as a MeshPointMaps.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.AddMeshPointMap(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
This function adds a source point and destination point pair at the specified index.
index:  Input the index to insert at
sourcePt:  Input the source point
destPt:  Input the destination point

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.SetMeshPointMaps(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Point2dCollection)
This function sets the source points collection and destination points collection for a GeoMesh.
sourcePts:  Input source points collection
destPts:  Input destination points collection

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.ResetMeshPointMaps
This function resets the GeoMesh to NULL.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.PostToDb
This function posts this object to the extension dictionary of the dimension or MLeader object.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.EraseFromDb
This function erase this object from the database.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.UpdateTransformationMatrix
This function updates the transformation matrix.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.TransformToLonLatAlt(System.Double,System.Double,System.Double)
This function transforms the dwg point provided into a geo space point.
y:  Input y coordinate of dwg point
z:  Input z coordinate of dwg point

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.TransformToLonLatAlt(Autodesk.AutoCAD.Geometry.Point3d)
This function transforms the dwg point provided into a geo space point.
dwgPt:  Input dwg point (x, y, z)

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.TransformFromLonLatAlt(Autodesk.AutoCAD.Geometry.Point3d)
This is TransformFromLonLatAlt, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.CoordinateProjectionRadius
Accesses the coordinate projection radius.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.SeaLevelElevation
Accesses the sea level elevation.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.DoSeaLevelCorrection
Assesses if sea level correction is enabled.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.ScaleFactor
Accesses the scale factor.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.ScaleEstimationMethod
Accesses the scale estimation method.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.GeoRSSTag
Accesses the the geoRSS tag string.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.CoordinateSystem
This is CoordinateSystem, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.NumMeshPoints
Accesses the total number of mesh points.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.NorthDirectionVector
Accesses the north direction vector.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.NorthDirection
Accesses the north direction angle in DWG world coordinate system.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.UpDirection
Accesses the up direction in DWG world coordinate system.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.DesignPoint
This is DesignPoint, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.VerticalUnitsScale
This is VerticalUnitsScale, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.HorizontalUnitsScale
This is HorizontalUnitsScale, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.VerticalUnits
This is VerticalUnits, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.HorizontalUnits
This is HorizontalUnits, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.ReferencePoint
This is ReferencePoint, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.TypeOfCoordinates
This is TypeOfCoordinates, a member of class GeoLocationData.

Autodesk.AutoCAD.DatabaseServices.GeoLocationData.BlockTableRecordId
Accesses the object Id of model space block table record object.