Autodesk.AutoCAD.DatabaseServices.IdMapping
IdMapping is used by the deep clone operation to map ObjectIds between original objects and their clones (using IdPairs).

Autodesk.AutoCAD.DatabaseServices.IdMapping.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Add(Autodesk.AutoCAD.DatabaseServices.IdPair)
Adds pairToAdd to the IdMapping object's map.
pairToAdd:  Input IdPair to add

Autodesk.AutoCAD.DatabaseServices.IdMapping.Lookup(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Searches the IdMapping object's ID map for an IdPair that has a key that matches the key passed.
key:  Input key to look for

Autodesk.AutoCAD.DatabaseServices.IdMapping.Change(Autodesk.AutoCAD.DatabaseServices.IdPair)
Searches the IDMapping object's map for the key contained in pairToChange and, if found, replaces the entry with a copy of pairToChange.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Delete(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Searches the IdMapping ID map for an entry that has a key matching key.
key:  Input objectId which is the key of the ID pair to be deleted from the map

Autodesk.AutoCAD.DatabaseServices.IdMapping.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Searches the IdMapping object's ID map for an IdPair that has a key that matches the key passed.
key:  Input key to look for

Autodesk.AutoCAD.DatabaseServices.IdMapping.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.IdMapping.DuplicateRecordCloning
Accesses the value for duplicate record cloning, which determines what happens if symbols or dictionary entries are cloned, and a duplicate is found to already exist in the destination database.

Autodesk.AutoCAD.DatabaseServices.IdMapping.DeepCloneContext
Accesses the context of the deepclone operation the IdMapping object is involved in.

Autodesk.AutoCAD.DatabaseServices.IdMapping.OriginalDatabase
Accesses the source database for the deep clone operation.

Autodesk.AutoCAD.DatabaseServices.IdMapping.DestinationDatabase
Accesses the database that is the destination for the deep clone operation for which the IdMapping object is being used.