Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::AcDbAssocLoftedSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.SubentRef[],Autodesk.AutoCAD.DatabaseServices.PathRef[],Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.DatabaseServices.LoftOptions,System.Int32[],System.Double[],System.Boolean)
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::createInstance() method.