Autodesk.AutoCAD.GraphicsSystem.EffectStatus
This .NET class wraps the EffectStatus ObjectARX structure.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.FeatureLevel
Gets and sets the hardware feature level required for effect to be used.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.Enabled
Gets and sets whether the hardware effect is enabled.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.Recommended
Gets and sets whether hardware effect is recommended for use.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.Available
Gets and sets whether the hardware effect is available for use.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.EffectName
Gets and sets the name of the hardware effect.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.EffectUniqueString
Gets and sets the unique string identifier for the hardware effect name.