Autodesk.AutoCAD.DatabaseServices.TextEditorStack
This wraps the ObjectARX AcDbTextEditorStack class.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.FlowAlign
Gets and sets the stack flow alignment.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.DecimalChar
Gets and sets the stack decimal char.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.Scale
Gets and sets the stack scale factor.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.Bottom
Gets and sets the stack bottom string.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.Top
Gets and sets the stack top string.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.Type
Gets and sets the stack type.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.MaxStackScale
This wraps the ObjectARX AcDbTextEditorStack::maxStackScale() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorStack.MinStackScale
This wraps the ObjectARX AcDbTextEditorStack::minStackScale() method.