Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture
This .NET class wraps the AcGiImageFileTexture ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.Clone
Creates a clone of the object and returns a pointer to the clone.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture,Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture)
operator.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture,Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.ImageFileTexture.SourceFileName
Returns the file name of the image file in which the material texture is stored.