Autodesk.AutoCAD.DatabaseServices.Filters.Filter
This .NET class wraps the AcDbFilter ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.Filter.IndexClass
Accesses the class descriptor for the Index for this filter.