Autodesk.AutoCAD.Geometry.Matrix2d
This .NET class wraps the AcGeMatrix2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Matrix2d.#ctor(System.Double[])
This constructor creates a 2D matrix based on values in an array.
array:  Input matrix array

Autodesk.AutoCAD.Geometry.Matrix2d.Multiply(Autodesk.AutoCAD.Geometry.Matrix2d)
Multiplies this object with Matrix2d object.
matrix:  Input matrix to multiply

Autodesk.AutoCAD.Geometry.Matrix2d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Sets this matrix to the product leftSide * (this matrix).
leftSide:  Input left side of matrix

Autodesk.AutoCAD.Geometry.Matrix2d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Sets this matrix to the product (this matrix) * rightSide.
rightSide:  Input right side of matrix

Autodesk.AutoCAD.Geometry.Matrix2d.Inverse
Returns inverse of this matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.IsSingular
This method calls Matrix2d.IsSingular(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Matrix2d.IsSingular(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if either of the vectors e0, e1 returned by the function getCoordSystem(origin,e0,e1) has zero length, or if these vectors are parallel.
tolerance:  Input tolerance data value

Autodesk.AutoCAD.Geometry.Matrix2d.Transpose
Returns the matrix that is the result of transposition of this matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.IsUniscaledOrtho
This method calls Matrix2d.IsUniscaledOrtho(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Matrix2d.IsUniscaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.
tolerance:  Input tolerance data value

Autodesk.AutoCAD.Geometry.Matrix2d.IsScaledOrtho
This method calls Matrix2d.IsScaledOrtho(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Matrix2d.IsScaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors,.
tolerance:  Input tolerance data value

Autodesk.AutoCAD.Geometry.Matrix2d.GetScale
Returns scale factor of matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.GetDeterminant
Returns the determinant of the matrix.

Autodesk.AutoCAD.Geometry.Matrix2d.IsConformal(Autodesk.AutoCAD.Geometry.Matrix2dInfo)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 2D vectors and these two vectors have equal length.
info:  Input matrix to check with

Autodesk.AutoCAD.Geometry.Matrix2d.Displacement(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the displacement vector.
vector:  Input vector to calculate displacement from

Autodesk.AutoCAD.Geometry.Matrix2d.Rotation(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of the rotation by angle angle around the point center.
angle:  Input rotation angle
center:  Input center of rotation

Autodesk.AutoCAD.Geometry.Matrix2d.Scaling(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of uniform scaling by scale factor scaleAll with respect to the point center.
scaleAll:  Input scale factor
center:  Input origin of the scale

Autodesk.AutoCAD.Geometry.Matrix2d.Mirroring(Autodesk.AutoCAD.Geometry.Line2d)
Returns the matrix of mirroring with respect to line.
line:  Input the mirror line

Autodesk.AutoCAD.Geometry.Matrix2d.Mirroring(Autodesk.AutoCAD.Geometry.Point2d)
Returns the matrix of mirroring with respect to point.
point:  Input point that defines the mirror line

Autodesk.AutoCAD.Geometry.Matrix2d.AlignCoordinateSystem(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Returns matrix that maps the coordinate system with the origin fromOrigin and the axes fromE0 and fromE1 to the coordinate system with the origin toOrigin and the axes toE0 and toE1.
fromOrigin:  Input point that defines the origin of the from coordinate system
fromE0:  Input vector that defines the x axis of the from coordinate system
fromE1:  Input vector that defines the y axis of the from coordinate system
toOrigin:  Input point that defines the origin of the to coordinate system
toE0:  Input vector that defines the x axis of the to coordinate system
toE1:  Input vector that defines the y axis of the to coordinate system

Autodesk.AutoCAD.Geometry.Matrix2d.Equals(System.Object)
Returns true if each column of this matrix is equal to the corresponding object matrix column.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Matrix2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2d)
This method calls Matrix2d.IsEqualTo(Matrix2d a, Tolerance tolerance) with tolerance set to Global.
a:  Input matrix to compare against

Autodesk.AutoCAD.Geometry.Matrix2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors.
a:  Input matrix to compare against
tolerance:  Input tolerance data value

Autodesk.AutoCAD.Geometry.Matrix2d.op_Inequality(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Matrix2d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix2d.op_Equality(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Matrix2d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Matrix2d)
Returns matrices a times b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix2d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Matrix2d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
format:  Input format
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Matrix2d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Matrix2d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Matrix2d.ToArray
This method returns this matrix as a 1-dimensional array containing 9 elements of type System.Double.

Autodesk.AutoCAD.Geometry.Matrix2d.CoordinateSystem2d
This function returns the origin and axes of the coordinate system to which this matrix maps the coordinate system with the origin (0, 0) and axes (1, 0) and (0,1).

Autodesk.AutoCAD.Geometry.Matrix2d.Translation
Returns the translation part of this matrix.