Autodesk.AutoCAD.GraphicsInterface.DrawableTraits
This .NET class wraps the AcGiDrawableTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.SetupForEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This call initializes the entire SubEntityTraits and DrawableTraits from the entity.
entity:  Input entity

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.AddLight(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Drawables that emit light can add one (or more) "lights" to the model.
lightId:  Input the added light.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.SelectionFlags
This is SelectionFlags, a member of class DrawableTraits.

Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.LinePattern
This is LinePattern, a member of class DrawableTraits.