Autodesk.AutoCAD.Geometry.Ray2d
This .NET class wraps the AcGeRay2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Ray2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a ray whose start point is point1 and passes through point2.
point1:  Input start point of ray
point2:  Input any 2D point different from point1

Autodesk.AutoCAD.Geometry.Ray2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a ray whose start point is point and whose direction is vector.
point:  Input start point of ray
vector:  Input direction vector of ray

Autodesk.AutoCAD.Geometry.Ray2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Ray2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the ray so that the start point is point1 and it passes through point2.
point1:  Input start point of ray
point2:  Input any 2D point different from point1

Autodesk.AutoCAD.Geometry.Ray2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the ray so the start point is point and the direction of the ray is vector.
point:  Input start point of ray
vector:  Input direction vector of ray