Autodesk.AutoCAD.DatabaseServices.TangentConstraint
This class represents a Tangent constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.TangentConstraint.#ctor
Default constructor.