Autodesk.AutoCAD.Geometry.CircularArc2d
This .NET class wraps the AcGeCircArc2d ObjectARX class.

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Boolean)
Constructs an arc with the specified start and endpoints.
startPoint:  Input start point of arc
endPoint:  Input endpoint of arc
bulge:  Input bulge distance
bulgeFlag:  Input how to interpret bulge distance for arc calculation

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an arc through three points.
startPoint:  Input start point of arc
point:  Input point on arc
endPoint:  Input endpoint of arc

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean)
Constructs a circular arc with the specified center, radius, start angle, and end angle.
center:  Input center of arc
radius:  Input radius of arc
startAngle:  Input angle of start point of arc
endAngle:  Input angle of endpoint of arc
referenceVector:  Input reference vector from which arc angles are measured
isClockWise:  Input direction of arc

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Constructs a full circle with the given center and radius.
center:  Input center of circle
radius:  Input radius of circle

Autodesk.AutoCAD.Geometry.CircularArc2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc2d)
This method calls CircularArc2d.IntersectWith(CircularArc2d arc, Tolerance tolerance) with tolerance set to Global.
arc:  Input any 2D arc

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input arc intersects this arc within a specified tolerance.
arc:  Input any 2D arc
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d)
This method calls CircularArc2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 2D linear entity

Autodesk.AutoCAD.Geometry.CircularArc2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the arc within a specified tolerance value.
line:  Input any 2D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc2d.GetTangent(Autodesk.AutoCAD.Geometry.Point2d)
This method calls CircularArc2d.GetTangent(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input point on full circle

Autodesk.AutoCAD.Geometry.CircularArc2d.GetTangent(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
This method calls CircularArc2d.GetTangent(Point2d point, Tolerance tolerance).
point:  Input point on full circle
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d)
This method calls CircularArc2d.IsInside(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.CircularArc2d.IsInside(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
This function treats the arc as a full circle even if it is bounded, and determines if the input point lies inside the full circle.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc2d.SetAngles(System.Double,System.Double)
Changes the start and end points of the arc to have the specified angles.
startAngle:  Input start angle of arc
endAngle:  Input end angle of arc

Autodesk.AutoCAD.Geometry.CircularArc2d.SetToComplement
Reverses the direction of the arc while keeping the same start and end points.

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the three input curves.
curve1:  Input any 2D curve
curve2:  Input any 2D curve
curve3:  Input any 2D curve
parameter1:  Input parameter value on curve1 where arc touches curve
parameter2:  Input parameter value on curve2 where arc touches curve
parameter3:  Input parameter value on curve3 where arc touches curve

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the two input curves and have the specified radius.
curve1:  Input any 2D curve
curve2:  Input any 2D curve
radius:  Input any 2D curve
parameter1:  Input parameter value on curve1 where arc touches curve
parameter2:  Input parameter value on curve2 where arc touches curve

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Boolean)
Changes the definition of the arc to have the specified start point, endpoint, and bulge distance. If a line is drawn between startPoint and endPoint, then the distance between this line and the midpoint of the arc are equal to the bulge distance. The direction of the arc is changed to counterclockwise regardless of its previous direction. startPoint must be different than endPoint. If bulgeFlag is true, then bulge is interpreted to be the maximum distance between the arc and the chord between the two input points. If bulgeFlag is false, then bulge is interpreted to be the tangent of ¼ the included angle (tan(ang/4)), where ang is the angle of the arc segment between the two input points.
startPoint:  Input start point of arc
endPoint:  Input end point of arc
bulge:  Input bulge distance
bulgeFlag:  Input how to interpret bulge distance for arc calculation

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the arc to have the specified start and end points and pass through point.
startPoint:  Input start point
point:  Input point
endPoint:  Input end point

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean)
Changes the definition of the arc to have the specified center, radius, start angle, and end angle. Angles are measured by drawing a vector between a point on the arc and the center point and taking the angle between this vector and referenceVector. The last parameter specifies whether the angle is to be taken clockwise or counterclockwise. angle2 must be greater than angle1. To construct a full circle, the difference between angle2 and angle1 should be 2 x Pi.
center:  Input center of circle
radius:  Input radius of circle
angle1:  Input angle of start point of arc
angle2:  Input angle of endpoint of arc
referenceVector:  Input reference vector from which arc angles are measured
isClockWise:  Input direction of arc

Autodesk.AutoCAD.Geometry.CircularArc2d.Set(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Changes the definition of the arc to have the specified center and radius.
center:  Input center of circle
radius:  Input radius of circle

Autodesk.AutoCAD.Geometry.CircularArc2d.EndPoint
End point of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.StartPoint
Starting point of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.ReferenceVector
Changes the reference vector of the arc to the specified vector.

Autodesk.AutoCAD.Geometry.CircularArc2d.IsClockWise
Returns whether arc is oriented in a clockwise direction.

Autodesk.AutoCAD.Geometry.CircularArc2d.EndAngle
Angle of the endpoint of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc2d.StartAngle
Angle of the start point of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc2d.Radius
Accesses the radius of the arc.

Autodesk.AutoCAD.Geometry.CircularArc2d.Center
Returns the center point of the arc.