Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::AcDbAssocFilletSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.GetHintPoints
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::getHintPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.SetHintPoints(Autodesk.AutoCAD.Geometry.Point3d[],Autodesk.AutoCAD.Geometry.Vector3d)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::setHintPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.GetRadius(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::radius() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.SetRadius(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::setRadius() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.GetFilletHandleData(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::getFilletHandleData() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.DatabaseServices.FilletTrimMode,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::createInstance( ) method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.TrimMode
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::setTrimMode() and AcDbAssocFilletSurfaceActionBody::trimMode() methods.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.Radius
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::radius() and AcDbAssocFilletSurfaceActionBody::setRadius() methods.