Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam
This wraps the ObjectARX AcDbAssocPathActionParam class.

Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam.#ctor
This wraps the ObjectARX AssocPathActionParam::AcDbAssocPathActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam.GetEdgeRefArray
This wraps the ObjectARX AssocPathActionParam::getEdgeRefArray() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam.SetEdgeRefArray(Autodesk.AutoCAD.DatabaseServices.EdgeRef[])
This wraps the ObjectARX AssocPathActionParam::setEdgeRefArray() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam.UpdateEdgeRef(System.Int32,Autodesk.AutoCAD.DatabaseServices.EdgeRef)
This wraps the ObjectARX AssocPathActionParam::updateEdgeRef() method.