Autodesk.AutoCAD.DatabaseServices.MLeaderStyle
This .NET class wraps the AcDbMLeaderStyle ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.#ctor(Autodesk.AutoCAD.DatabaseServices.MLeaderStyle)
Copy constructor.
MLeaderStyle:  Input object to copy.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.GetTextAttachmentType(Autodesk.AutoCAD.DatabaseServices.LeaderDirectionType)
Returns text attachment type of MText in MLeader content.
leaderDirection:  Input text leader direction type

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.OverwritePropChanged
bool overwritePropChanged () const;.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.PostMLeaderStyleToDb(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
ObjectId styleId postMLeaderStyleToDb (AcDbDatabase* pDb, const ACHAR* styleName);.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.ExtendLeaderToText
Gets and sets the value indicating whether horizontal leader lines are automatically extended to text.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextAttachmentDirection
Accesses the value of the text attachment Direction of MText content.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.Name
Accesses the name of the MLeader style.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.BreakSize
Accesses the size of the gap used for breaking leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.Scale
Accesses the scale of MLeader created by this style.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.BlockConnectionType
Accesses the block connection type.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.EnableBlockRotation
Assesses if the blockRotation value is enabled.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.BlockRotation
Accesses the rotation of the block referenced by MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.EnableBlockScale
Assesses if the blockScale value is enabled.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.BlockScale
Accesses the scale of the block referenced by MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.BlockColor
Accesses the block color in block content.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.BlockId
Accesses the Id of the block table record referenced by MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.EnableFrameText
Accesses whether or not the text frame is displayed around the MText.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextHeight
Accesses the text height of MText.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextColor
Accesses the text color of MText.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextAlignAlwaysLeft
Assesses true if the text is set to always align left.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextAlignmentType
Accesses the text alignment type.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextAngleType
Accesses the angle type of text with respect to the last leader line segment.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextAttachmentType
Accesses the value of the text attachment Type of MText content.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.TextStyleId
Accesses the objectId of text style.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.DefaultMText
Accesses the default MText.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.ArrowSize
Accesses the arrow size.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.ArrowSymbolId
Accesses the objectId of the arrow symbol.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.DoglegLength
Accesses the length of dog-leg leader line.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.EnableDogleg
Assesses if dog-leg leader lines are enabled.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.LandingGap
Accesses the gap between MText and the tail of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.EnableLanding
Accesses whether landing of leader line is enabled.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.LeaderLineWeight
Accesses the line weight of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.LeaderLineTypeId
Accesses the line type of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.LeaderLineColor
Accesses the color of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.LeaderLineType
Accesses the type of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.SecondSegmentAngleConstraint
Accesses the angle constraint of the second segment of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.FirstSegmentAngleConstraint
Accesses the angle constraint of the first segment of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.MaxLeaderSegmentsPoints
Accesses the max number of leader segment points.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.DrawLeaderOrderType
Accesses the type of leader drawing order.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.DrawMLeaderOrderType
Accesses the type of MLeader drawing order.

Autodesk.AutoCAD.DatabaseServices.MLeaderStyle.ContentType
Accesses the content type.