Autodesk.AutoCAD.DatabaseServices.UnderlayReference
This .NET class wraps AcDbUnderlayReference ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.SetClipBoundary(Autodesk.AutoCAD.Geometry.Point2d[])
Sets the clip boundary of the underlay.
points:  Input the clip boundary. An array describing a self intersecting polyline is not allowed. An array of two points is allowed and is treated as the minimum, maximum point of a rectangle.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.GetClipBoundary
Returns an array of points that specify the clip boundary of the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.GenerateClipBoundaryFromPline(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Generates the clip boundary from a polyline.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.IsClipInverted
Accesses the value of the inverted clip flag.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Path
Returns the full path of the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.NameOfSheet
Returns the sheet name.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Name
Returns the name of the object.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Width
Accesses the width of the underlay reference.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Height
Accesses the height of the underlay reference.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.AdjustColorForBackground
Sets or returns a Boolean indicating whether the underlay content is adjusted for the current background color.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.DefaultFade
Returns the default fade value.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.FadeUpperLimit
Returns the upper limit of the legal fade values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.FadeLowerLimit
Returns the lower limit of the legal fade values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.DefaultContrast
Returns the default contrast value.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ContrastUpperLimit
Returns the upper limit of the legal contrast values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ContrastLowerLimit
Returns the lower limit of the legal contrast values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.UnderlayLayerCollection
Returns underlay layers from the database.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Monochrome
Returns a Boolean value indicating whether the underlay content is shown in monochrome.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Fade
Returns the fade value for the underlay ([0-100]).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Contrast
Returns the contrast value for the underlay ([0-100]).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.IsOn
Returns a Boolean indicating whether the underlay content is shown.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.IsClipped
Returns a Boolean value indicating whether the clip boundary should be used.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Transform
Gets the transformation matrix from the underlay coordinate system to the world coordinate system (or block space coordinates if the underlay is part of a block).

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.DefinitionId
Returns the object ID of the UnderlayDefinition that this underlay references.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Normal
Returns the normal of the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Rotation
Returns the rotation value around the axis defined by the point returned by position()> and the vector returned by normal().

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ScaleFactors
Returns the scale factors used to scale the underlay.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.Position
Returns the position of the underlay in WCS (or block space coordinates if the reference is part of a block).