Autodesk.AutoCAD.Geometry.CurveBoundaryData
This class contains data that defines a CurveBoundary object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.GetCurve3ds
This method returns the array of 3D curves for this object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.GetCurve2ds
This method returns the array of 2D curves for this object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.CurveBoundaryData.IsEqualTo(Autodesk.AutoCAD.Geometry.CurveBoundaryData)
This method compares the 2D and 3D orientations and 2D and 3D curves of this boundary to those of a.
a:  Input object to check equivalency

Autodesk.AutoCAD.Geometry.CurveBoundaryData.op_Inequality(Autodesk.AutoCAD.Geometry.CurveBoundaryData,Autodesk.AutoCAD.Geometry.CurveBoundaryData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.CurveBoundaryData.op_Equality(Autodesk.AutoCAD.Geometry.CurveBoundaryData,Autodesk.AutoCAD.Geometry.CurveBoundaryData)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.CurveBoundaryData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.Orientation2d
Returns the logical orientation of parameter space curves.

Autodesk.AutoCAD.Geometry.CurveBoundaryData.Orientation3d
Returns logical orientation of 3dGeometry.