Autodesk.AutoCAD.Runtime.SystemObjects
This class provides access to the Class Dictionary, Service Dictionary, and Dynamic Linker system objects.

Autodesk.AutoCAD.Runtime.SystemObjects.DynamicLinker
Accesses the dynamic linker.

Autodesk.AutoCAD.Runtime.SystemObjects.ServiceDictionary
Accesses the service dictionary.

Autodesk.AutoCAD.Runtime.SystemObjects.ClassDictionary
Accesses the class dictionary.