Autodesk.AutoCAD.GraphicsInterface.ShadowParameters
This .NET class wraps the AcGiShadowParameters ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ExtendedLightRadius
Returns the radius of the extended light source.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ExtendedLightWidth
Returns the width of the extended light source.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ExtendedLightLength
Returns the length of the extended light source.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ExtendedLightShape
Returns the shape of the extended light source.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShapeVisibility
True if the light shape is visible in the rendering.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowSamples
Returns the number of shadow rays to shoot for the light.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowMapSoftness
Returns the softness (or fuzziness) of the edge of the shadow.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowMapSize
Returns the shadow map size.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowType
Returns the method used to calculate shadows cast by this light.

Autodesk.AutoCAD.GraphicsInterface.ShadowParameters.ShadowsOn
Returns Boolean indicating whether or not this light casts shadows.