Autodesk.AutoCAD.DatabaseServices.FullSubentityPath
This .NET class wraps the AcDbFullSubentPath ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId[],Autodesk.AutoCAD.DatabaseServices.SubentityId)
Initializes the embedded ObjectIdCollection withids and the embedded SubentityId with index.
ids:  Input object ID array
index:  Input subent ID object

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.GetObjectIds
Returns an array of object IDs for all objects in this subentity path.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to compare to

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.op_Inequality(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.op_Equality(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.SubentId
Accesses the const copy of the embedded SubentityId.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.IsNull
Compares if the object is a null subentity or not.

Autodesk.AutoCAD.DatabaseServices.FullSubentityPath.Null
Accesses the Null property value.