Autodesk.AutoCAD.Runtime.Variables
A singleton instance of this collection represents all variables in the system.

Autodesk.AutoCAD.Runtime.Variables.GetAllNames
Retrieves the names of all variables currently registered in the system.

Autodesk.AutoCAD.Runtime.Variables.GetEnumerator
Returns an object that implements the System.Collections.IEnumerator interface that can iterate through the Variable objects within this Variables collection.

Autodesk.AutoCAD.Runtime.Variables.Reset(Autodesk.AutoCAD.Runtime.Variable.StorageType)
Resets variables in this collection, filtered by "filter", to their default values.
filter:  Strorage type of variable to reset.

Autodesk.AutoCAD.Runtime.Variables.Changed
Event fired when variables changed.

Autodesk.AutoCAD.Runtime.Variables.Changing
Event fired when variables changing.