Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo
This class is a container for the hit test information returned by DatabaseServices.Section.HitTest()> .

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.SubItem
Returns or null if this is not required.

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.PtOnSegment
Returns the pointer  to receive the actual point on the section plane geometry, or null if this is not required.

Autodesk.AutoCAD.DatabaseServices.SectionHitTestInfo.Index
Returns the zero-based index of the segment  on the section line, which passes near or through the hit point.