Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages
This class encapsulates the information returned by the AcLyLayerFilter.getImages() ObjectARX function.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.#ctor(System.IntPtr,System.Int32,System.Int32)
This constructor initializes default values.
imageListHandle:  Input.
imageIndex:  Input.
selectedImageIndex:  Input.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.SelectedImageIndex
Zero-based index of the selected image in the image list.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.ImageIndex
Zero-based index of the normal image in the image list.

Autodesk.AutoCAD.LayerManager.LayerFilterDisplayImages.ImageListHandle
Upon successful return this is set to the handle of the image list that contains the normal and selected image.