Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs
This class provides data for LayoutRenamed event of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs.NewName
Accesses the new name of the layout.

Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs.Name
Accesses the name of the layout that is changing.

Autodesk.AutoCAD.DatabaseServices.LayoutRenamedEventArgs.Id
Accesses the object ID of the layout that is changing.