Autodesk.AutoCAD.Runtime.Exception
This class provides a container for an ObjectARX Acad.ErrorStatus enumerator value.

Autodesk.AutoCAD.Runtime.Exception.#ctor
Default constructor.

Autodesk.AutoCAD.Runtime.Exception.ErrorStatus
Specifies the ErrorStatus property value.