Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator
This .NET class wraps the AcDbSymbolTableIterator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.MoveNext
Increments the enumerator to the next entry.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.Reset
Resets the enumerator.

Autodesk.AutoCAD.DatabaseServices.SymbolTableEnumerator.Current
Returns the objectId of the current symbol table entry.