Autodesk.AutoCAD.Geometry.NurbCurve3dData
This class contains data that defines a NurbCurve3d object.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.NurbCurve3dData.IsEqualTo(Autodesk.AutoCAD.Geometry.NurbCurve3dData)
Compares this object to a and returns true if they are equal.
a:  Input object to compare against

Autodesk.AutoCAD.Geometry.NurbCurve3dData.op_Inequality(Autodesk.AutoCAD.Geometry.NurbCurve3dData,Autodesk.AutoCAD.Geometry.NurbCurve3dData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve3dData.op_Equality(Autodesk.AutoCAD.Geometry.NurbCurve3dData,Autodesk.AutoCAD.Geometry.NurbCurve3dData)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve3dData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.Weights
Returns the Weights property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.Knots
Returns the Knots property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.ControlPoints
Returns the ControlPoints property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.Periodic
Returns the Periodic property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.Rational
Returns the Rational property value.

Autodesk.AutoCAD.Geometry.NurbCurve3dData.Degree
Returns the Degree property value.