Autodesk.AutoCAD.Geometry.BoundBlock3d
This .NET class wraps the AcGeBoundBlock3d ObjectARX class.

Autodesk.AutoCAD.Geometry.BoundBlock3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a parallelepiped given a vertex and two sides.
point1:  Input origin vertex a corner of the bounding box
dir1:  Input direction and size for first side of the bounding box
dir2:  Input direction and size for second side of the bounding box
dir3:  Input direction and size for third side of the bounding box

Autodesk.AutoCAD.Geometry.BoundBlock3d.#ctor
Constructs a parallelepiped contracted to the origin of the coordinates.

Autodesk.AutoCAD.Geometry.BoundBlock3d.GetMaximumPoint
Returns the maximum point of the coordinate belonging to a block.

Autodesk.AutoCAD.Geometry.BoundBlock3d.GetMinimumPoint
Returns the minimum point of the coordinate belonging to a block.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the block as a parallelepiped with given vertex and sides.
basePoint:  Input origin vertex a corner of the bounding box
dir1:  Input direction and size for first side of the bounding box
dir2:  Input direction and size for second side of the bounding box
dir3:  Input direction and size for third side of the bounding box

Autodesk.AutoCAD.Geometry.BoundBlock3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Sets the block as a parallelepiped contracted to a segment between two points.
basePoint:  Input first point
maximumPoint:  Input second point

Autodesk.AutoCAD.Geometry.BoundBlock3d.Extend(Autodesk.AutoCAD.Geometry.Point3d)
Extends the block to include the new point.
pointToInclude:  Input extension point

Autodesk.AutoCAD.Geometry.BoundBlock3d.Swell(System.Double)
Swells the block by moving the sides for the distance.
distance:  Input distance to expand the block

Autodesk.AutoCAD.Geometry.BoundBlock3d.Contains(Autodesk.AutoCAD.Geometry.Point3d)
Returns true if the point belongs to the block.
pointToTest:  Input point to test whether the point belongs to the block

Autodesk.AutoCAD.Geometry.BoundBlock3d.IsDisjoint(Autodesk.AutoCAD.Geometry.BoundBlock3d)
Returns true if the input block does not intersect with this block.
block:  Input another Autodesk.AutoCAD.Geometry.BoundBlock3d object.

Autodesk.AutoCAD.Geometry.BoundBlock3d.IsBox
Returns true if the block is a coordinate box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Direction3
Returns the direction and size for third side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Direction2
Returns the direction and size for second side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.Direction1
Returns direction and size for first side of the bounding box.

Autodesk.AutoCAD.Geometry.BoundBlock3d.BasePoint
Returns origin vertex, a corner of the bounding area.