Autodesk.AutoCAD.DatabaseServices.NurbSurface
This wraps the ObjectARX AcDbNurbSurface class.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.#ctor(System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection)
This wraps the ObjectARX AcDbNurbSurface::AcDbNurbSurface() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.#ctor
This wraps the ObjectARX AcDbNurbSurface::AcDbNurbSurface() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Set(System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection)
This wraps the ObjectARX AcDbNurbSurface::set () method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.SetControlPoints(System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection)
This wraps the ObjectARX AcDbNurbSurface::setControlPoints() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetControlPointAt(System.Int32,System.Int32)
This wraps the ObjectARX AcDbNurbSurface::getControlPointAt() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.SetControlPointAt(System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
This wraps the ObjectARX AcDbNurbSurface::setControlPointAt() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetWeight(System.Int32,System.Int32)
This wraps the ObjectARX AcDbNurbSurface::getWeight() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.SetWeight(System.Int32,System.Int32,System.Double)
This wraps the ObjectARX AcDbNurbSurface::setWeight() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,System.Int32,Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3dCollection&)
This wraps the ObjectARX evaluate(double u, double v, int derivDegree, AcGePoint3d& point, AcGeVector3dArray& derivatives) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d& pos, AcGeVector3d& uDeriv, AcGeVector3d& vDeriv, AcGeVector3d& uuDeriv, AcGeVector3d& uvDeriv, AcGeVector3d& vvDeriv) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d& pos, AcGeVector3d& uDeriv, AcGeVector3d& vDeriv) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double)
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d& pos) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsPlanar(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This wraps the ObjectARX AcDbNurbSurface::isPlanar() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsPointOnSurface(Autodesk.AutoCAD.Geometry.Point3d)
This wraps the ObjectARX AcDbNurbSurface::isPointOnSurface() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetNormal(System.Double,System.Double)
This wraps the ObjectARX AcDbNurbSurface::getNormal() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetIsolineAtU(System.Double)
This wraps the ObjectARX AcDbNurbSurface::getIsolineAtU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetIsolineAtV(System.Double)
This wraps the ObjectARX AcDbNurbSurface::getIsolineAtV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.InsertKnotAtU(System.Double)
This wraps the ObjectARX AcDbNurbSurface::InsertKnotAtU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.InsertKnotAtV(System.Double)
This wraps the ObjectARX AcDbNurbSurface::InsertKnotAtV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.InsertControlPointsAtU(System.Double,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
This wraps the ObjectARX AcDbNurbSurface::InsertControlPointsAtU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.InsertControlPointsAtV(System.Double,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
This wraps the ObjectARX AcDbNurbSurface::InsertControlPointsAtV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.RemoveControlPointsAtU(System.Int32)
This wraps the ObjectARX AcDbNurbSurface::RemoveControlPointsAtU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.RemoveControlPointsAtV(System.Int32)
This wraps the ObjectARXAcDbNurbSurface::RemoveControlPointsAtV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
This wraps the ObjectARX AcDbNurbSurface::rebuild() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32)
This wraps the ObjectARX AcDbNurbSurface::rebuild() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.ModifyPosition(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d)
This wraps the ObjectARX AcDbNurbSurface::modifyPositionAndTangent() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.ModifyPositionAndTangent(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This wraps the ObjectARX AcDbNurbSurface::modifyPositionAndTangent() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetParameterOfPoint(Autodesk.AutoCAD.Geometry.Point3d,System.Double&,System.Double&)
This wraps the ObjectARX AcDbNurbSurface::getParameterOfPoint() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.NumberOfSpansInV
This wraps the ObjectARX AcDbNurbSurface::getIsolineAtU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.NumberOfSpansInU
This wraps the ObjectARX AcDbNurbSurface::getNormal() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsRational
This wraps the ObjectARX AcDbNurbSurface::isRational() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.PeriodInV
This wraps the ObjectARX AcDbNurbSurface::getPeriodInV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.PeriodInU
This wraps the ObjectARX AcDbNurbSurface::getPeriodInU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsPeriodicInV
This wraps the ObjectARXAcDbNurbSurface::isPeriodicInV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsPeriodicInU
This wraps the ObjectARX AcDbNurbSurface::isPeriodicInU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsClosedInV
This wraps the ObjectARX AcDbNurbSurface::isClosedInV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsClosedInU
This wraps AcDbNurbSurface::isClosedInU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.DegreeInV
This wraps the ObjectARX AcDbNurbSurface::getDegreeInV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.DegreeInU
This wraps the ObjectARX AcDbNurbSurface::getDegreeInU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.NumberOfKnotsInV
This wraps the ObjectARX AcDbNurbSurface::getNumberOfKnotsInV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.NumberOfKnotsInU
This wraps the ObjectARX AcDbNurbSurface::getNumberOfKnotsInU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.VKnots
This wraps the ObjectARX AcDbNurbSurface::getVKnots() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.UKnots
This wraps the ObjectARX AcDbNurbSurface::getUKnots() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.NumberOfControlPointsInV
This wraps the ObjectARX AcDbNurbSurface::getNumberOfControlPointsInV() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.NumberOfControlPointsInU
This wraps the ObjectARX AcDbNurbSurface::getNumberOfControlPointsInU() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.ControlPoints
This wraps the ObjectARX AcDbNurbSurface::getControlPoints() method.