Autodesk.AutoCAD.Geometry.CircularArc3d
This .NET class wraps the AcGeCircArc3d ObjectARX class.

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs an arc through three points.
startPoint:  Input start point of arc
endPoint:  Input endpoint of arc
pnt:  Input point on arc

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Constructor.
center:  Input Autodesk.AutoCAD.Geometry.Point3d object.
normal:  Input Autodesk.AutoCAD.Geometry.Vector3d object.
referenceVector:  Input Autodesk.AutoCAD.Geometry.Vector3d object.
radius:  Input.
startAngle:  Input.
endAngle:  Input.

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs a full circle with the given center, normal vector, and radius.
center:  Input center of arc
normal:  Input normal vector of arc
radius:  Input radius of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.CircularArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls CircularArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input plane

Autodesk.AutoCAD.Geometry.CircularArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this arc that is closest to the given plane.
plane:  Input plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls CircularArc3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input any plane

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input plane intersects this arc.
plane:  Input any plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc3d)
This method calls CircularArc3d.IntersectWith(CircularArc3d arc, Tolerance tolerance) with tolerance set to Global.
arc:  Input any 3D arc

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.CircularArc3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input arc intersects this arc.
arc:  Input any 3D arc
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls CircularArc3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.CircularArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the arc.
line:  Input any 3D linear entity
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.CircularArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls CircularArc3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.CircularArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the arc and line that project into the same point when projected onto a plane whose normal is projectionDirection.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.GetTangent(Autodesk.AutoCAD.Geometry.Point3d)
This method calls CircularArc3d.GetTangent(Point3d pointValue, Tolerance tolerance) with tolerance set to Global.
pointValue:  Input point on full circle

Autodesk.AutoCAD.Geometry.CircularArc3d.GetTangent(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
This function returns true if the input point lies on the full circle of the arc; otherwise, it returns false.
pointValue:  Input point on full circle
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.GetPlane
Returns the infinite plane in which the arc lies.

Autodesk.AutoCAD.Geometry.CircularArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d)
This method calls CircularArc3d.IsInside(Point3d pointValue, Tolerance tolerance) with tolerance set to Global.
pointValue:  Input any 3D point

Autodesk.AutoCAD.Geometry.CircularArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input point lies inside the arc.
pointValue:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.CircularArc3d.SetAxes(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the normal vector and reference vector of the arc to the specified vectors.
normal:  Input normal vector of arc
referenceVector:  Input reference vector of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.SetAngles(System.Double,System.Double)
Changes the start and end points of the arc to have the specified angles.
startAngle:  Input start angle of arc
endAngle:  Input end angle of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the three input curves.
curve1:  Input any 3D curve
curve2:  Input any 3D curve
curve3:  Input any 3D curve
param1:  Input parameter value on curve1 where arc touches curve
param2:  Input parameter value on curve2 where arc touches curve
param3:  Input parameter value on curve3 where arc touches curve

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to be tangent to the two input curves and have the specified radius.
curve1:  Input any 3D curve
curve2:  Input any 3D curve
radius:  Input radius of arc
param1:  Input parameter value on curve1 where arc touches curve
param2:  Input parameter value on curve2 where arc touches curve

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the arc to have the specified start and endpoints and pass through pointOnArc.
startPoint:  Input start point of arc
pointOnArc:  Input point on arc
endPoint:  Input endpoint of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Changes the definition of the arc to have the specified center, normal vector, radius, start angle, and end angle.
center:  Input center of arc
normal:  Input normal vector of arc
referenceVector:  Input reference vector from which arc angles are measured
radius:  Input radius of arc
startAngle:  Input angle of start point of arc
endAngle:  Input angle of endpoint of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Changes the arc definition to be a full circle with the given center, normal vector, and radius.
center:  Input center of arc
normal:  Input normal vector of arc
radius:  Input radius of arc

Autodesk.AutoCAD.Geometry.CircularArc3d.EndPoint
Endpoint of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.StartPoint
Start point of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.EndAngle
Angle of the endpoint of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.StartAngle
Angle of the start point of the arc with respect to the reference vector.

Autodesk.AutoCAD.Geometry.CircularArc3d.Radius
Accesses the radius of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.ReferenceVector
Returns the reference vector of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.Normal
Returns the normal vector of the arc.

Autodesk.AutoCAD.Geometry.CircularArc3d.Center
Returns the center point of the arc.