Autodesk.AutoCAD.DatabaseServices.BlockTable
This .NET class wraps the AcDbBlockTable ObjectARX class, which is the symbol table for BlockTableRecords, which represent block definitions within a drawing database.