Autodesk.AutoCAD.LayerManager.LayerFilter
This .NET class wraps the AcLyLayerFilter ObjectARX class.

Autodesk.AutoCAD.LayerManager.LayerFilter.#ctor
Default constructor.

Autodesk.AutoCAD.LayerManager.LayerFilter.Filter(Autodesk.AutoCAD.DatabaseServices.LayerTableRecord)
Returns true if the given LayerTableRecord is visible with this filter.
layer:  Input object on which the decision is going to be made.

Autodesk.AutoCAD.LayerManager.LayerFilter.CompareTo(Autodesk.AutoCAD.LayerManager.LayerFilter)
Returns true if the two objects are equivalent.
otherFilter:  Input object to compare against

Autodesk.AutoCAD.LayerManager.LayerFilter.ShowEditor
Called by the host application to show an editor window for the filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.GetFilterExpressionTree
Returns a read-only expression tree that represents this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.GenerateNested
Called by the ObjectDBX framework after a filter is loaded from persistent storage.

Autodesk.AutoCAD.LayerManager.LayerFilter.FilterExpression
Returns a filter expression of this form: /*
BNF for the valid boolean expression we evaluate
.=  or  |
.= and  |
.=
.= == | !=
.=A-Z0-9*?~@.,-
.=#A-Z0-9
*/
This function may return null if the filter cannot be described this way.

Autodesk.AutoCAD.LayerManager.LayerFilter.DisplayImages
Accesses the DisplayImages property value.

Autodesk.AutoCAD.LayerManager.LayerFilter.IsIdFilter
Returns true if this filter only filters for the object ID property of a layer.

Autodesk.AutoCAD.LayerManager.LayerFilter.IsProxy
Returns true if this is a proxy filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.AllowDelete
Returns true if this filter can be removed.

Autodesk.AutoCAD.LayerManager.LayerFilter.DynamicallyGenerated
When implemented in a derived class, this function should return true if the filter is dynamically generated by its parent and should not be persisted on its own.

Autodesk.AutoCAD.LayerManager.LayerFilter.AllowNested
Returns true if this filter allows nested filters.

Autodesk.AutoCAD.LayerManager.LayerFilter.NestedFilters
Returns an array containing the nested filters of this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.Parent
Returns the parent filter for this filter.

Autodesk.AutoCAD.LayerManager.LayerFilter.AllowRename
Returns a Boolean value indicating whether or not renaming this filter is allowed.

Autodesk.AutoCAD.LayerManager.LayerFilter.Name
Returns the name of the filter.