Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut
This class encapsulates the values output by the RevolveOptions.CheckRevolveCurve() method.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Planar
Assesses whether the curve is planar.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.EndPointsOnAxis
Assesses whether whether the curve is open and its endpoints lie on the axis of revolution.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Closed
Assesses whether the region is closed.