Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph
This wraps the ObjectARX AcDbTextEditorParagraph class.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.RestartNumbering
This wraps the ObjectARX AcDbTextEditorParagraph::restartNumbering() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.ContinueNumbering
This wraps the ObjectARX AcDbTextEditorParagraph::continueNumbering() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.GetTab(System.Int32)
This wraps the ObjectARX AcDbTextEditorParagraph::getTab() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.AddTab(Autodesk.AutoCAD.DatabaseServices.TextEditorParagraphTab)
This wraps the ObjectARX AcDbTextEditorParagraph::addTab() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.RemoveTab(Autodesk.AutoCAD.DatabaseServices.TextEditorParagraphTab)
This wraps the ObjectARX AcDbTextEditorParagraph::removeTab() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.MaxSpacingValue
Maximum allowable after/before space value.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.MinSpacingValue
Minimum allowable after/before space value.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.MaxLineSpacingFactor
This wraps the ObjectARX AcDbTextEditorParagraph::maxLineSpacingFactor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.MinLineSpacingFactor
This wraps the ObjectARX AcDbTextEditorParagraph::minLineSpacingFactor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.TabsCount
This wraps the ObjectARX AcDbTextEditorParagraph::tabsCount() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.ParaNumberingType
Gets and sets the numbering type for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.SpaceAfter
Gets and sets the after space for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.SpaceBefore
Gets and sets the before space for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.LineSpaceFactor
Gets and sets the line space factor for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.LineSpaceStyle
Gets and sets the line space style for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.RightIndent
Gets and sets the right indent value for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.LeftIndent
Gets and sets the left indent value for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.FirstIndent
Gets and sets the first indent value for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.Alignment
Gets and sets the alignment type for the paragraph.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.EndOfText
This wraps the ObjectARX AcDbTextEditorParagraph::endOfText() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph.StartOfText
This wraps the ObjectARX AcDbTextEditorParagraph::startOfText() method.