Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord
This .NET class wraps the AcDbTextStyleTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.Font
Returns the font definition data from the text style record.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.BigFontFileName
Returns with string, file name, pointing to the name of the big font file for this text style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.FileName
Returns with file name pointing to a copy of the name of the font file for this text style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.PriorSize
Returns the text height used for the last text created using this Text Style.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.FlagBits
Returns the textStyleflagBits value.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.ObliquingAngle
Returns the obliquing angle for the TextStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.XScale
Returns the width factor (also referred to as the relative X-scale factor) for the TextStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.TextSize
Returns the default text size for text drawn with this textStyle.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.IsVertical
Returns true if and only if text drawn with this text style is drawn vertically.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.IsShapeFile
Returns true when the text font file is interpreted as a shape record, otherwise it returns false when it is interpreted as a text record.