Autodesk.AutoCAD.DatabaseServices.Sun
This .NET class wraps the AcDbSun ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Sun.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Sun.SunDirection
Returns the direction (vector) of the sunlight, from the sun to the model.

Autodesk.AutoCAD.DatabaseServices.Sun.Altitude
Returns the altitude of the Sun object.

Autodesk.AutoCAD.DatabaseServices.Sun.Azimuth
Returns the azimuth of the Sun object.

Autodesk.AutoCAD.DatabaseServices.Sun.IsDaylightSavingsOn
Gets the Daylight Savings On/Off option for the Sun Angle Calculator.

Autodesk.AutoCAD.DatabaseServices.Sun.DateTime
Returns the date and the time for the Sun Angle Calculator.

Autodesk.AutoCAD.DatabaseServices.Sun.SkyParameters
Provides access to sky parameters for this light.

Autodesk.AutoCAD.DatabaseServices.Sun.ShadowParameters
Returns the shadow parameters: shadow type, mapsize, softness, and on/off.

Autodesk.AutoCAD.DatabaseServices.Sun.SunColor
Gets the Sun's color.

Autodesk.AutoCAD.DatabaseServices.Sun.Intensity
Returns the intensity of the Sun object.

Autodesk.AutoCAD.DatabaseServices.Sun.IsOn
Gets the Sun's on/off state.