Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult
This class is used to return the codes that describe the results of a field evaluation.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.#ctor(Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatus,System.Int32,System.String)
For internal use only.
s:  _nt_
e:  _nt_
m:  _nt_

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.ErrorMessage
Accesses the ErrorMessage property value.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.ErrorCode
Accesses the ErrorCode property value.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationStatusResult.Status
Accesses the Status property value.