Autodesk.AutoCAD.DatabaseServices.Xline
This .NET class wraps the AcDbXline ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Xline.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.Xline.SecondPoint
Returns the second point of the xline.

Autodesk.AutoCAD.DatabaseServices.Xline.UnitDir
Returns the unit direction vector of the xline.

Autodesk.AutoCAD.DatabaseServices.Xline.BasePoint
Returns the base point of the xline.