Autodesk.AutoCAD.DatabaseServices.RenderEnvironment
This .NET class wraps the AcDbRenderEnvironment ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.EnvironmentImageFileName
Accesses the full path and file name of the environment image.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.EnvironmentImageEnabled
Assesses whether to use an image for the environment.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.Distances
Accesses the near and far distances of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogDensity
Accesses the density of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogColor
Accesses the color of the fog effect.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogBackgroundEnabled
Assesses whether the fog affects the background.

Autodesk.AutoCAD.DatabaseServices.RenderEnvironment.FogEnabled
Assesses whether a fog effect is enabled.