Autodesk.AutoCAD.DatabaseServices.MlineStyleElement
This class encapsulates the color, offset, and linetype ID values that define an element in the ACAD_MLINESTYLE dictionary.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture specific format.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.LinetypeId
Accesses the line type ID.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.Color
Accesses the color property.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElement.Offset
Accesses the offset value.