Autodesk.AutoCAD.DatabaseServices.AuditInfo
This .NET class wraps the AcDbAuditInfo ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.ErrorsFound(System.Int32)
Increments the count of errors found that is maintained in the instance of AuditInfo.
count:  Input the number of errors found

Autodesk.AutoCAD.DatabaseServices.AuditInfo.ErrorsFixed(System.Int32)
Increments the count of errors fixed that is maintained in the instance of AuditInfo by NumFixes.
count:  Input the number of errors fixed

Autodesk.AutoCAD.DatabaseServices.AuditInfo.PrintError(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String,System.String,System.String)
Prints out log information about the errors detected or fixed using the object pointed to by value to construct a "name" string for the object type (using the name method of the RxClass object for the object type pointed to by value).
value:  Input the name string will be extracted.
value2:  Input a string describing the value of the bad data
validation:  Input a string describing the reason the data is bad
defaultValue:  Input a string describing the default value it is set to

Autodesk.AutoCAD.DatabaseServices.AuditInfo.PrintError(System.String,System.String,System.String,System.String)
Prints out log information about the errors detected or fixed.
name:  Input a string describing the type of erroneous data found
value:  Input a string describing the value of the bad data
validation:  Input a string describing the reason the data is bad
defaultValue:  Input a string describing the default value it is set to

Autodesk.AutoCAD.DatabaseServices.AuditInfo.RequestRegen
This method allows objects which are fixing themselves to tell audit that the windows need to be reloaded from the database.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.ResetNumEntities
Resets the count of entities being maintained in the instance of AuditInfo to zero.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.IncNumEntities
Increments the count of entities being maintained in the instance of AuditInfo by 1.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.PrintNumEntities(System.String)
If the current count of entities being maintained in the instance of AuditInfo is a multiple of 100, and msg is not NULL, then this function will print the string pointed to by msg followed by the current entity count out to the audit log file.
msg:  Input the string to be printed

Autodesk.AutoCAD.DatabaseServices.AuditInfo.NumEntities
Returns the count maintained in the instance of AuditInfo of the number of entities that were processed.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.AuditPass
Two passes through each object's data are made during the AUDIT command.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.NumFixes
Returns the count maintained in the instance of AuditInfo of the number of errors fixed.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.NumErrors
Accesses the count maintained in the instance of AuditInfo of the number of errors.

Autodesk.AutoCAD.DatabaseServices.AuditInfo.FixErrors
Returns true if errors are to be fixed by the entity that is being implemented.