Autodesk.AutoCAD.DatabaseServices.TableStyle
This .NET class wraps the AcDbTableStyle ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.TableStyle.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.TableStyle.TextStyle(System.String)
Returns the textstyle id of the specified cell style.
styleName:  Input cell style

Autodesk.AutoCAD.DatabaseServices.TableStyle.TextStyle(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the object ID of the text style for a given row type currently referenced by the TableStyle object.
rowType:  Input row type

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Sets the text style for a cell style.
id:  Input TextStyleTableRecord object ID
styleName:  Input cell style name

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Sets the table object to use the TextStyleTableRecord specified by ID for the specified row types.
id:  Input TextStyleTableRecord object ID
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.TableStyle.TextHeight(System.String)
This is TextHeight, a member of class TableStyle.

Autodesk.AutoCAD.DatabaseServices.TableStyle.TextHeight(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the text height for a given row type of the table style object.
rowType:  Input value specifying the row type for which the text height will be returned

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.String)
This is SetTextHeight, a member of class TableStyle.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.Int32)
Sets the text height for the specified row types.
height:  Input value indicating the new text height
rowTypes:  Input row types for which to set the text height

Autodesk.AutoCAD.DatabaseServices.TableStyle.Alignment(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the cell alignment for a given row type of the table style object.
rowType:  Input value specifying the row type for which the cell alignment value will be returned

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetAlignment(Autodesk.AutoCAD.DatabaseServices.CellAlignment,System.Int32)
Sets the cell alignment for the specified cell style.
alignment:  Input alignment value
rowTypes:  Input row types for which to set the alignment

Autodesk.AutoCAD.DatabaseServices.TableStyle.Color(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the text color for a given row type of the table style object.
rowType:  Input value specifying the row type for which the Color value will be returned

Autodesk.AutoCAD.DatabaseServices.TableStyle.BackgroundColor(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the background color for a given row type of the table style object.
rowType:  Input value specifying the row type for which the Color value will be returned

Autodesk.AutoCAD.DatabaseServices.TableStyle.IsBackgroundColorNone(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns true if the background color for a given row type of the table style object is set to no color value.
rowType:  Input value specifying the row type for which to return the Boolean indicating whether the background color is set to none

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetBackgroundColorNone(System.Boolean,System.Int32)
Enables or disables the background color for the specified row types. Different row types can be OR'd.
value:  Input Boolean indicating whether to enable the background color for the specified row type
rowTypes:  Input row types for which to enable or disable the background color

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridLineWeight(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid color for a given grid line weight of the table style object.
gridLineType:  Input type of grid line for which to return the LineWeight value
rowType:  Input row type for which to return the grid line weight value

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridLineWeight(Autodesk.AutoCAD.DatabaseServices.LineWeight,System.Int32,System.Int32)
Sets the lineweight for the specified grid line types and row types.
lineWeight:  Input lineweight value
gridLineTypes:  Input grid line types for which to set the lineweight
rowTypes:  Input row types for which to set the lineweight

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridColor(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid color for a given grid line type of the table style object.
gridLineType:  Input type of grid line for which to return the Color value
rowType:  Input row type for which to return the color value

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridVisibility(Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the grid color for a given grid line visibility of the table style object.
gridLineType:  Input type of grid line for which to return the grid visibility value
rowType:  Input row type for which to return the grid visibility value

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Sets the grid visibility for the specified grid line types and row types. Different grid line and row types can be OR'd.
visible:  Input visibility value
gridLineTypes:  Input grid line types for which to set the visibility
rowTypes:  Input row types for which to set the visibility

Autodesk.AutoCAD.DatabaseServices.TableStyle.PostTableStyleToDatabase(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
Adds a table style to the specified database.
databasePointer:  Input the database to which to add the table style
styleName:  Input name for the table style; must be a non-empty string that is less than 256 characters long and conforms to the requirements for Dictionary key strings

Autodesk.AutoCAD.DatabaseServices.TableStyle.DataType(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the data type for a given row type of the table style object.
rowType:  Input value specifying the row type for which the DataType value will be returned

Autodesk.AutoCAD.DatabaseServices.TableStyle.UnitType(Autodesk.AutoCAD.DatabaseServices.RowType)
Gets the unit type.
rowType:  Input row type

Autodesk.AutoCAD.DatabaseServices.TableStyle.Format(Autodesk.AutoCAD.DatabaseServices.RowType)
Returns the string format for a given row type of the table style object.
rowType:  Input value specifying the row type for which the string format value will be returned

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetFormat(System.String,Autodesk.AutoCAD.DatabaseServices.RowType)
Sets the format string of the specified cell style.
pFormat:  Input format to set
rowTypes:  Input row types for which to set the format string

Autodesk.AutoCAD.DatabaseServices.TableStyle.CellClass(System.String)
Returns the cell classification value for the specified cell style.
styleName:  Input cell style name

Autodesk.AutoCAD.DatabaseServices.TableStyle.Margin(Autodesk.AutoCAD.DatabaseServices.CellMargins,System.String)
This .NET method wraps the ObjectARX method AcDbTableStyle::margin().

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetMargin(Autodesk.AutoCAD.DatabaseServices.CellMargins,System.Double,System.String)
This .NET method wraps the ObjectARX method AcDbTableStyle::setMargin().

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridDoubleLineSpacing(Autodesk.AutoCAD.DatabaseServices.GridLineType,System.String)
Gets the grid double line spacing in the specified cell style.
gridLineType:  Input grid line type.
styleName:  Input cell style name.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridDoubleLineSpacing(System.Double,Autodesk.AutoCAD.DatabaseServices.GridLineType,System.String)
Sets the grid double line spacing in the specified cell style.
spacing:  Input grid double line spacing to set.
gridLineTypes:  Input grid line type. Multiple grid line types can be combined using OR.
styleName:  Input cell style name.

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridLineStyle(Autodesk.AutoCAD.DatabaseServices.GridLineType,System.String)
Gets the grid line style of the specified cell style.
gridLineType:  Input grid line type.
styleName:  Input cell style name.

Autodesk.AutoCAD.DatabaseServices.TableStyle.GridLinetype(Autodesk.AutoCAD.DatabaseServices.GridLineType,System.String)
Gets the grid double line spacing in the specified cell style.
gridLineType:  Input grid line type.
styleName:  Input cell style name.

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridLinetype(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.GridLineType,System.String)
Sets the grid double line spacing in the specified cell style.
linetype:  Input grid double line spacing to set.
gridLineTypes:  Input grid line type. Multiple grid line types can be combined using OR.
styleName:  Input cell style name.

Autodesk.AutoCAD.DatabaseServices.TableStyle.CellStyles
Accesses the cell styles in the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Template
Accesses the ID of the Template object in the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.IsHeaderSuppressed
Assesses if the header is suppressed.

Autodesk.AutoCAD.DatabaseServices.TableStyle.IsTitleSuppressed
Assesses if the title is suppressed.

Autodesk.AutoCAD.DatabaseServices.TableStyle.VerticalCellMargin
Accesses the vertical cell margin value used by the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.HorizontalCellMargin
Accesses the horizontal cell margin value used by the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.FlowDirection
Accesses the flow direction of the table.

Autodesk.AutoCAD.DatabaseServices.TableStyle.BitFlags
Accesses an integer representing the operation bit SetFlowDirection flags set for the TableStyle object.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Description
Accesses the description of the table style.

Autodesk.AutoCAD.DatabaseServices.TableStyle.Name
Accesses the name of the table style.