Autodesk.AutoCAD.DatabaseServices.Shape
This .NET class wraps the AcDbShape ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Shape.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double)
Copy constructor.
position:  Input insertion point of the shape, in WCS coordinates
size:  Input height of the shape
rotation:  Input rotation of the shape
widthFactor:  Input width factor of the shape

Autodesk.AutoCAD.DatabaseServices.Shape.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Shape.ShapeIndex
Returns the object ID of the font symbol table record containing this shape's SHX font.

Autodesk.AutoCAD.DatabaseServices.Shape.StyleId
Returns the object ID of the font symbol table record containing this shape's SHX font.

Autodesk.AutoCAD.DatabaseServices.Shape.ShapeNumber
Returns the number of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Normal
Returns the normal vector of the plane containing the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Thickness
Returns the thickness of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Oblique
Returns the oblique angle of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.WidthFactor
Returns the width factor (sometimes referred to as the relative X-scale factor).

Autodesk.AutoCAD.DatabaseServices.Shape.Rotation
Returns the rotation angle of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Name
Returns the name of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Size
Returns the height of the shape.

Autodesk.AutoCAD.DatabaseServices.Shape.Position
Returns the insertion point of the shape in WCS coordinates.