Autodesk.AutoCAD.LayerManager.LayerCollection
This .NET class wraps the AcArray ObjectARX class.

Autodesk.AutoCAD.LayerManager.LayerCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.LayerManager.LayerCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.LayerManager.LayerCollection.Add(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the object represented by value to this collection.
value:  Input object to add.

Autodesk.AutoCAD.LayerManager.LayerCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the object represented by value from this collection.
value:  Input object to be removed.

Autodesk.AutoCAD.LayerManager.LayerCollection.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input object to be matched with this object.

Autodesk.AutoCAD.LayerManager.LayerCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.ObjectId[],System.Int32)
Copies objects in array to this collection.
array:  Input the target array.
index:  Input the zero-based index from which the array objects will be copied.

Autodesk.AutoCAD.LayerManager.LayerCollection.Count
Returns the number of objects in this collection.