Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder
This is a helper class that is used to populate a DatabaseServices.LoftOptions object from the loft options sysvars.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.LoftOptions)
This constructor creates an object from an existing LoftOptions object.
value:  LoftOptions object to create from

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.SetOptionsFromSysvars
Set loft options from the current values of system variables.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.ToLoftOptions
Returns a DatabaseServices.LoftOptions object.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.NormalOption
Accesses the plane normal option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.VirtualGuide
Accesses the state of the virtual guide option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.Ruled
Accesses the value of the ruled option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.Closed
Accesses the value of the closed option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.Simplify
Accesses the value of the simplify option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.AlignDirection
Accesses the value of the AlignDirection option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.NoTwist
Accesses the value of the noTwist option.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.ArcLengthParam
Accesses the arc length  parametrization.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftEndMag
Accesses the end draft magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftStartMag
Accesses the start draft magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftEnd
Accesses the end draft angle in radians.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsBuilder.DraftStart
Accesses the start draft angle in radians.