Autodesk.AutoCAD.GraphicsInterface.Drawable
This .NET class wraps the AcGiDrawable ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.Drawable.SetAttributes(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits)
This function will take the input DrawableTraits object and set the values for the current object’s subentity traits.
traits:  Input object to be set. Traits are filled in with the calling objects subentity traits values.

Autodesk.AutoCAD.GraphicsInterface.Drawable.DrawStream
This is DrawStream, a member of class Drawable.

Autodesk.AutoCAD.GraphicsInterface.Drawable.Bounds
Accesses the bounds of the drawable, if available.

Autodesk.AutoCAD.GraphicsInterface.Drawable.DrawableType
Accesses the type of the current drawable.

Autodesk.AutoCAD.GraphicsInterface.Drawable.Id
Returns the database ID that corresponds to this drawable (if the drawable is persistent).

Autodesk.AutoCAD.GraphicsInterface.Drawable.IsPersistent
Returns true if the Drawable object is database resident (belongs to an Model that requires the use of open and close functions).