Autodesk.AutoCAD.Runtime.PointCloudExtractor
This wraps the AcPointCloudExtractor, which can extract point cloud in a plan and output line/pline.

Autodesk.AutoCAD.Runtime.PointCloudExtractor.Extract(Autodesk.AutoCAD.DatabaseServices.PointCloudEx,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Runtime.ExtractOption,Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback)
The extract method returns the extract result.
pointCloud:  The point cloud to be extracted.
planZDirection:  The plan's normal direction.
planXDirection:  The plan's X direction.
pointOnPlan:  A point on plan.
extractOption:  The extract option.
progress:  The callback of extraction, which can manulate the extract to cancel, update, etc.

Autodesk.AutoCAD.Runtime.PointCloudExtractor.AppendLineProfile(Autodesk.AutoCAD.Runtime.PointCloudExtractResult,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String,Autodesk.AutoCAD.Colors.Color)
Appends line according to the extract result.
profile:  The output of extraction.
spaceId:  The space to be added in of lines.
layer:  Layer of lines.
color:  Color of lines.

Autodesk.AutoCAD.Runtime.PointCloudExtractor.AppendPolylineProfile(Autodesk.AutoCAD.Runtime.PointCloudExtractResult,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String,Autodesk.AutoCAD.Colors.Color,System.Double)
Appends polylines according to the extract result.
profile:  The output of extraction.
spaceId:  The space to be added in the lines.
layer:  Layer of lines.
color:  Color of lines.
polylineWidth:  Polyline width.