Autodesk.AutoCAD.Colors.Transparency
This .NET class wraps the AcCmTransparency ObjectARX class.

Autodesk.AutoCAD.Colors.Transparency.#ctor(System.Byte)
Creates a Transparency based on an alpha value.
alpha:  Input alpha value

Autodesk.AutoCAD.Colors.Transparency.#ctor(Autodesk.AutoCAD.Colors.TransparencyMethod)
Copy constructor.
method:  Input transparency to copy

Autodesk.AutoCAD.Colors.Transparency.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare.

Autodesk.AutoCAD.Colors.Transparency.op_Inequality(Autodesk.AutoCAD.Colors.Transparency,Autodesk.AutoCAD.Colors.Transparency)
Returns true if a is not equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Colors.Transparency.op_Equality(Autodesk.AutoCAD.Colors.Transparency,Autodesk.AutoCAD.Colors.Transparency)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Colors.Transparency.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Colors.Transparency.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Colors.Transparency.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.Colors.Transparency.IsSolid
Assesses if the transparency method is ByAlpha and the alpha value is 255.

Autodesk.AutoCAD.Colors.Transparency.IsClear
Assesses if the transparency method is ByAlpha and the alpha value is zero.

Autodesk.AutoCAD.Colors.Transparency.IsInvalid
Indicates whether this object is currently set to an invalid value (the default for a newly created Entity object).

Autodesk.AutoCAD.Colors.Transparency.IsByLayer
Assesses if the transparency method is ByLayer.

Autodesk.AutoCAD.Colors.Transparency.IsByBlock
Assesses if the transparency method is ByBlock.

Autodesk.AutoCAD.Colors.Transparency.IsByAlpha
Assesses if the transparency method is ByAlpha.

Autodesk.AutoCAD.Colors.Transparency.Alpha
Accesses the alpha value.