Autodesk.AutoCAD.LayerManager.LayerFilterCollection
This .NET class wraps the AcArray ObjectARX class.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Add(Autodesk.AutoCAD.LayerManager.LayerFilter)
Adds the object represented by value to this collection.
value:  Input object to be added.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Remove(Autodesk.AutoCAD.LayerManager.LayerFilter)
Removes the object represented by value from this collection.
value:  Input object to be removed.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Contains(Autodesk.AutoCAD.LayerManager.LayerFilter)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input Autodesk.AutoCAD.LayerManager.LayerFilter object that matches to this collection object.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.CopyTo(Autodesk.AutoCAD.LayerManager.LayerFilter[],System.Int32)
Copies objects in array to this collection.
array:  Input the target array.
index:  Input the zero-based index from which the array object will be copied.

Autodesk.AutoCAD.LayerManager.LayerFilterCollection.Count
Returns the number of objects in this collection.