Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping
This class encapsulates the data returned by the Viewport.getFrontAndBackClipValues() ObjectARX function.

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.#ctor(System.Boolean,System.Boolean,System.Double,System.Double)
Fills in the parameters with information about the existence and location of front and back display clipping planes.
clipFront:  Input Boolean indicating if front clip plane is active
clipBack:  Input Boolean indicating if back clip plane is active
front:  Input eye coordinate Z value of front clipping plane
back:  Input eye coordinate Z value of front clipping plane

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object with which to check against

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.IsEqualTo(Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping)
This method calls FrontAndBackClipping.IsEqualTo(FrontAndBackClipping a, Tolerance tolerance) with tolerance set to Global.
a:  Input object with which to check against

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.IsEqualTo(Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a for equality to this object by comparing the Front, Back, ClipFront, and ClipBack properties.
a:  Input object with which to check against
tolerance:  Input tolerance value

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping,Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.op_Equality(Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping,Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.Back
Returns Back property value.

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.Front
Returns Front property value.

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.ClipBack
Returns the location of the back clipping plane as a world space distance from the camera target along the eye vector away from the camera position.

Autodesk.AutoCAD.GraphicsInterface.FrontAndBackClipping.ClipFront
Returns the location of the front clipping plane as a world space distance from the camera target along the eye vector towards the camera position.