Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody
This is class Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.#ctor
This wraps the ObjectARXAcDbAssocBlendSurfaceActionBody::AcDbAssocBlendSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetStartEdgeContinuity(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.SetStartEdgeContinuity(System.Int16,System.String,System.String)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setStartEdgeContinuity () method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetEndEdgeContinuity(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.SetEndEdgeContinuity(System.Int16,System.String,System.String)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setEndEdgeContinuity () method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetStartEdgeBulge(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.SetStartEdgeBulge(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setStartEdgeBulge () method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetEndEdgeBulge(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.SetEndEdgeBulge(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setEndEdgeBulge () method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetContinuityGripPoints(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Point3d&)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getContinuityGripPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetProfiles(Autodesk.AutoCAD.DatabaseServices.LoftProfile&,Autodesk.AutoCAD.DatabaseServices.LoftProfile&)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getProfiles() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.BlendOptions,System.Boolean)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.BlendOption
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getBlendOptions() and AcDbAssocBlendSurfaceActionBody::setBlendOptions() methods.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.EndEdgeBulge
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeBulge() and AcDbAssocBlendSurfaceActionBody::setEndEdgeBulge() methods.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.StartEdgeBulge
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeBulge() and AcDbAssocBlendSurfaceActionBody::setStartEdgeBulge() methods.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.EndEdgeContinuity
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeContinuity() and AcDbAssocBlendSurfaceActionBody::setEndEdgeContinuity () methods.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.StartEdgeContinuity
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeContinuity() and AcDbAssocBlendSurfaceActionBody::setStartEdgeContinuity () methods.