Autodesk.AutoCAD.DatabaseServices.AttributeReference
This .NET class wraps the AcDbAttribute ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.SetAttributeFromBlock(Autodesk.AutoCAD.DatabaseServices.AttributeDefinition,Autodesk.AutoCAD.Geometry.Matrix3d)
Uses definition as a template for the attributes textual, entity, and starting geometric properties (in other words, it copies this information from the attribute definition into the attribute).
definition:  Input the the attribute definition entity to be used as a data template
blockTransform:  Input a block transformation matrix.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.SetAttributeFromBlock(Autodesk.AutoCAD.Geometry.Matrix3d)
Applies blockTransform to the attribute's geometric data to transform the position, sizing, and obliquing as would be done by the INSERT command.
blockTransform:  Input a block transformation matrix.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.UpdateMTextAttribute
Updates the internal MText entity from the basic AttributeReference properties.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.MTextAttribute
Accesses the internal MText entity, to replace or modify it.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsMTextAttribute
Returns true if the attribute is a multi-line attribute.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.LockPositionInBlock
Returns true if the AttributeReference object is set to be immovable relative to the geometry in the block.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.FieldLength
Accesses the attribute’s field length value.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsPreset
Returns true if the attribute object has a preset value and will not prompt for user input.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsVerifiable
Returns true if the attribute object is set to verify user input.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.IsConstant
Returns true if the AttributeReference object is set to be constant.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.Invisible
Accesses the visibility flag of the AttributeReference.

Autodesk.AutoCAD.DatabaseServices.AttributeReference.Tag
Accesses the tag string, which is the identifier you see if you explode the BlockReference that owns the attribute, so that the attribute reverts back to the AttributeDefinition that was part of the original reference’s block definition.