Autodesk.AutoCAD.DatabaseServices.Group
This .NET class wraps the AcDbGroup ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Group.#ctor(System.String,System.Boolean)
Initializes the group object to use a copy of the description string as the description.
description:  Input null terminated string describing the group
selectable:  Input Boolean value indicating whether the group is selectable or not

Autodesk.AutoCAD.DatabaseServices.Group.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Group.SetAnonymous
Sets the group to be anonymous.

Autodesk.AutoCAD.DatabaseServices.Group.Append(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Appends the objects whose objectIds are in the ids collection to the group.
ids:  Input objectId collection containing the objectIds of the objects to be appended

Autodesk.AutoCAD.DatabaseServices.Group.Append(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Appends the object identified by id to the group.
id:  Input objectId of the object to be appended to group

Autodesk.AutoCAD.DatabaseServices.Group.Prepend(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Prepends the objects whose objectIds are in the ids collection to the group.
ids:  Input objectId collection containing the objectIds of the objects to be prepended

Autodesk.AutoCAD.DatabaseServices.Group.Prepend(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Prepends the object identified by id to the group.
id:  Input objectId of the object to be prepended to group

Autodesk.AutoCAD.DatabaseServices.Group.InsertAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Inserts the objects whose objectIds are in the ids collection into the group just after the entry at index.
index:  Input insertion index
ids:  Input objectId collection containing objects to be inserted

Autodesk.AutoCAD.DatabaseServices.Group.InsertAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts the object specified by id into the group just after the entry at the index.
index:  Input insertion index
id:  Input objectId of the object to be inserted

Autodesk.AutoCAD.DatabaseServices.Group.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Removes from the group, all objects whose object IDs are in the ids collection.
ids:  Input array of objectIds of objects to be removed from the group

Autodesk.AutoCAD.DatabaseServices.Group.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes from the group, the object whose object ID is id.
id:  Input objectId of the object to be removed

Autodesk.AutoCAD.DatabaseServices.Group.RemoveAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Removes, from the group, the objects whose object IDs are in the ids collection.
index:  Input starting index of the objects to be removed
ids:  Input objectId array of objects to be removed after start index

Autodesk.AutoCAD.DatabaseServices.Group.RemoveAt(System.Int32)
Removes from the group, the object at the index index.
index:  Input index of the object to be removed

Autodesk.AutoCAD.DatabaseServices.Group.Replace(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Replaces the oldId entity with the newId entity in the group.
oldId:  Input objectId of the object to be removed from the group
newId:  Input objectId of the object to be added to the group in place of oldId

Autodesk.AutoCAD.DatabaseServices.Group.Transfer(System.Int32,System.Int32,System.Int32)
Starting with the item at index fromIndex and going upwards in index values, this function transfers numItems from the index fromIndex to the index toIndex.
fromIndex:  Input start index to transfer from
toIndex:  Input start index to transfer to
numItems:  Input number of items to transfer

Autodesk.AutoCAD.DatabaseServices.Group.Clear
Resets or clears the contents of a group.

Autodesk.AutoCAD.DatabaseServices.Group.Has(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns true if entity is present in the group or false if entity is not part of the group.
entity:  Input the entity being looked up

Autodesk.AutoCAD.DatabaseServices.Group.GetAllEntityIds
Returns an array with the objectIds of the entities in the group.

Autodesk.AutoCAD.DatabaseServices.Group.GetIndex(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns the index of the object identified by id.
id:  Input objectId of the object whose index is being queried

Autodesk.AutoCAD.DatabaseServices.Group.Reverse
Reverses the indices of all the objects in the group.

Autodesk.AutoCAD.DatabaseServices.Group.SetColor(Autodesk.AutoCAD.Colors.Color)
All the entities in the group will be set to the color specified by color.
color:  Input Color object representing the color to be set

Autodesk.AutoCAD.DatabaseServices.Group.SetColorIndex(System.Int32)
All the entities in the group will be set to the color specified by color.
color:  Input AutoCAD color index to be set for entities in the group (color index must be in the range 0 to 256)

Autodesk.AutoCAD.DatabaseServices.Group.SetLayer(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets all entities in the group to use the LayerTableRecord with objectId value.
value:  Input objectId of the layer to use

Autodesk.AutoCAD.DatabaseServices.Group.SetLayer(System.String)
Sets the LayerTableRecord with name value to be the layer for all entities in the group.
value:  Input null terminated string that is the name of the new layer

Autodesk.AutoCAD.DatabaseServices.Group.SetLinetype(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the LinetypeTableRecord with objectId value to be the line type for all entities in the group.
value:  Input objectId of the line type

Autodesk.AutoCAD.DatabaseServices.Group.SetLinetype(System.String)
Sets the LinetypeTableRecord with name value to be the line type for all entities in the group.
value:  Input objectId null terminated string that is the name of the new line type

Autodesk.AutoCAD.DatabaseServices.Group.SetLinetypeScale(System.Double)
Sets the line type scale to value for all entities in the group.
value:  Input new value for the line type scale

Autodesk.AutoCAD.DatabaseServices.Group.SetVisibility(System.Boolean)
Sets the visibility to value for all entities in the group.
value:  Input enum value for visibility

Autodesk.AutoCAD.DatabaseServices.Group.SetHighlight(System.Boolean)
If newVal == true, then all entities in the group will be highlighted. If newVal == false, then all entities in the group will be unhighlighted.
value:  Input Boolean indicating whether to highlight or not

Autodesk.AutoCAD.DatabaseServices.Group.NumEntities
Accesses the number of entities in the group.

Autodesk.AutoCAD.DatabaseServices.Group.IsAnonymous
Assesses true if the group is an anonymous group.

Autodesk.AutoCAD.DatabaseServices.Group.IsNotAccessible
Assesses true if the group is marked as inaccessible.

Autodesk.AutoCAD.DatabaseServices.Group.Name
Accesses the name string for the group.

Autodesk.AutoCAD.DatabaseServices.Group.Selectable
Assesses true if the entire group is selected and manipulated as one unit.

Autodesk.AutoCAD.DatabaseServices.Group.Description
Accesses the group description string.