Autodesk.AutoCAD.GraphicsInterface.GradientFill
This is class Autodesk.AutoCAD.GraphicsInterface.GradientFill.

Autodesk.AutoCAD.GraphicsInterface.GradientFill.#ctor(System.Double,System.Double,System.Boolean,Autodesk.AutoCAD.Colors.Color[],Autodesk.AutoCAD.GraphicsInterface.GradientType)
This is GradientFill, a member of class GradientFill.

Autodesk.AutoCAD.GraphicsInterface.GradientFill.Type
This is Type, a member of class GradientFill.

Autodesk.AutoCAD.GraphicsInterface.GradientFill.GradientColors
This is GradientColors, a member of class GradientFill.

Autodesk.AutoCAD.GraphicsInterface.GradientFill.IsAdjustAspect
This is IsAdjustAspect, a member of class GradientFill.

Autodesk.AutoCAD.GraphicsInterface.GradientFill.GradientShift
This is GradientShift, a member of class GradientFill.

Autodesk.AutoCAD.GraphicsInterface.GradientFill.GradientAngle
This is GradientAngle, a member of class GradientFill.