Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection
This class represents a collection of DynamicDimenionData objects.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Add(Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData)
Adds a new DynamicDimensionData object to the collection.
data:  A DynamicDimensionData object to add.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.RemoveAt(System.Int32)
Removes the item at position i from the collection.
i:  The position of the item to be removed.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Clear
Clears the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData[],System.Int32)
Copies the element in array starting from index into the collection.
array:  Array to copy from
index:  Zero-based index to begin at

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionDataCollection.Count
Accesses the number of elements in the count.