Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits
This .NET class wraps the AcGiGroundPlaneBackgroundTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorGroundPlaneFar
Returns the color of the near ground plane.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorGroundPlaneNear
Returns the color of the far ground plane.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorUndergroundAzimuth
Returns the color of the underground azimuth.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorUndergroundHorizon
Returns the color of the underground horizon.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorSkyHorizon
Returns the color of the sky at the horizon.

Autodesk.AutoCAD.GraphicsInterface.GroundPlaneBackgroundTraits.ColorSkyZenith
Returns the sky color at the zenith.