Autodesk.AutoCAD.ComponentModel.TypeDescriptor
This class implements Autodesk.AutoCAD.ComponentModel Classes.ITypeDescriptor, which provides methods for adding/removing properties as well as adding and removing per-instance PropertyProviders.

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.#ctor(System.Type)
Creates a new TypeDescriptor of type type.
type:  Input type of descriptor

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.ModifyPropertyCollection(System.ComponentModel.PropertyDescriptorCollection,System.Object)
Returns the final collection of all property descriptors including per-instance props.
defaultProps:  Input default properties
instance:  Input instance of object

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.AddProperty(System.ComponentModel.PropertyDescriptor)
Adds a new property.
prop:  New property to add

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.RemoveProperty(System.ComponentModel.PropertyDescriptor)
Removes the property.
prop:  Input property to remove

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.GetPerInstancePropertyProviders
Returns a collection of the per instance property providers.

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.AddPerInstancePropertyProvider(Autodesk.AutoCAD.ComponentModel.IPropertyProvider)
Adds a new per-instance property provider.
pp:  Input provider to add

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.RemovePerInstancePropertyProvider(Autodesk.AutoCAD.ComponentModel.IPropertyProvider)
Removes the PerInstancePropertyProvider.
pp:  Input per instance property provider to remove

Autodesk.AutoCAD.ComponentModel.TypeDescriptor.HasPerInstancePropertyProviders
Assesses of per-instance property providers exists or not.