Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector
This .NET class wraps the AcGeSurfSurfInt ObjectARX class.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.#ctor(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface)
The intersection class constructor references surface objects, but the intersection object does not own them.
surface2:  Input second surface object
surface1:  Input first surface object

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectCurve(System.Int32,System.Boolean)
Returns NULL if the dimension of this intersection is not 1.
number:  Input index of the intersection
isExternal:  Input Boolean to return curve on first or second surface

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectParameterCurve(System.Int32,System.Boolean,System.Boolean)
Returns NULL if the dimension of this intersection is not 1.
If isFirst is true, returns parameter curve on first surface. Otherwise, returns parameter curve on second surface.
number:  Input index of the intersection
isExternal:  Input Boolean to return curve on first or second surface
isFirst:  Input Boolean flag to return curve on first or second surface

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.IntersectPoint(System.Int32)
Invalid return if the dimension of this intersection is not 0.
number:  Input index of the intersection

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetIntersectPointParameters(System.Int32)
Returns the point parameters required for intersection.
number:  Input index of the intersection

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetIntersectionConfigurations(System.Int32)
Returns the configuration data required for intersection.
number:  Input index of the intersection

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetDimension(System.Int32)
Returns the dimension of surface intersection.
number:  Input index of the intersection

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.GetType(System.Int32)
Returns the type of the intersection at the index.
number:  Input index of the intersection

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Set(Autodesk.AutoCAD.Geometry.Surface,Autodesk.AutoCAD.Geometry.Surface)
This method calls Set(Surface surface1, Surface surface2, Tolerance tolerance) with tolerance set to Global.
surface1:  Input first surface object
surface2:  Input second surface object

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Tolerance
Returns the tolerance value.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.NumResults
Counts the number of intersection results of any dimension.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Surface2
Returns the second surface object.

Autodesk.AutoCAD.Geometry.SurfaceSurfaceIntersector.Surface1
Returns the first surface object.