Autodesk.AutoCAD.DatabaseServices.Hatch
This .NET class wraps the Hatch ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Hatch.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Hatch.LoopTypeAt(System.Int32)
Returns the loop type of a selected hatch boundary loop from the hatch entity.
loopIndex:  Input index of the selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.GetLoopAt(System.Int32)
Gets the loop definition data (polyline) of a selected hatch boundary loop from the hatch entity.
loopIndex:  Input index of selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
It is a wrapper for method AcDbHatch::appendLoop(Adesk::Int32, AcGePoint2dArray&, AcGeDoubleArray&).
loopType:  Input type of loop.
vertexCollection:  Input set of point 2d.
bulgeCollection:  Input set of double values.

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.Geometry.Curve2dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
It is a wrapper for method AcDbHatch::appendLoop(Adesk::Int32, AcGeVoidPointerArray&, AcGeIntArray&).
loopType:  Input loop type.
edgePtrCollection:  Input set of curve 2d.
edgeTypeCollection:  Input set of enumerated edge types.

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Appends a new boundary loop (path or polyline) to the hatch entity.
loopType:  Input loop type
dbObjIds:  Input set of object IDs

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoop)
Appends a new boundary loop (polyline) to the hatch entity.
hatchLoop:  Input type of loop

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Inserts a new boundary loop (path or polyline) to the hatch entity.
loopIndex:  Input index for the selected loop
loopType:  Input loop type
dbObjIds:  Input set of object IDs

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoop)
Inserts a new boundary loop (path or polyline) to the hatch entity.
loopIndex:  Input index for the selected loop
hatchLoop:  Input loop type

Autodesk.AutoCAD.DatabaseServices.Hatch.RemoveLoopAt(System.Int32)
Removes a loop and its data from the hatch entity.
loopIndex:  Input index for the selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.GetAssociatedObjectIdsAt(System.Int32)
Gets the object IDs of the source boundary geometries associative to the selected loop.
loopIndex:  Input index for the selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.GetAssociatedObjectIds
Gets all the object IDs of the source boundary geometries associative to the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.RemoveAssociatedObjectIds
Removes all the object IDs of the source boundary geometries associative to the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.SetGradient(Autodesk.AutoCAD.DatabaseServices.GradientPatternType,System.String)
Provides the mechanism for specifying the shape definition of the gradient fill.
gradientType:  Input gradient type
gradientName:  Input name of the gradient to apply

Autodesk.AutoCAD.DatabaseServices.Hatch.GetGradientColors
Returns the colors and interpolation values describing how the gradient fill definition will be applied.

Autodesk.AutoCAD.DatabaseServices.Hatch.SetGradientColors(Autodesk.AutoCAD.DatabaseServices.GradientColor[])
Provides the mechanism for defining the colors to be applied to the gradient definition.
value:  Input array of floats representing the interpolation values defining the gradient

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateGradientColorAt(System.Single)
Provides a way to evaluate the interpolated color that the current gradient definition and colors will produce at a specified location along the gradient.
value:  Input normalized value, [0.0...1.0], at which to evaluate the gradient color

Autodesk.AutoCAD.DatabaseServices.Hatch.SetHatchPattern(Autodesk.AutoCAD.DatabaseServices.HatchPatternType,System.String)
Sets both pattern type and pattern name for hatch entity.
patternType:  Input enumerated number of pattern type
patternName:  Input name of the pattern

Autodesk.AutoCAD.DatabaseServices.Hatch.GetPatternDefinitionAt(System.Int32)
Gets the pattern definition line data from the hatch entity at the selected pattern line.
index:  Input pattern index

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateHatch(System.Boolean)
Evaluates the hatch lines or solid fill for the hatch entity using the specified hatch pattern. For regular hatch patterns, except for solid, this function performs intersection calculations between pattern definition lines and hatch boundary curves to form hatch lines. For a solid fill hatch pattern, this function performs triangulation of the hatch area and fills in the triangular meshes with the given color. Note Be sure to call SetHatchPattern() before using this method in order to update the display.
underEstimateNumLines:  If true, underestimates the count before deciding to abort. That is, if Hatch::EvaluateHatch(true) is used, the function will abort if the count is in excess of 100,000.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLinesData
Gets the hatch line data from the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLineDataAt(System.Int32)
Gets the hatch line data from the hatch entity.
index:  Input number at which the hatch line data will be returned

Autodesk.AutoCAD.DatabaseServices.Hatch.Origin
Accesses the origin point for the hatch pattern of this hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.Area
Accesses the area of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfHatchLines
Accesses the total number of hatch lines contained in the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.HatchStyle
Accesses the hatch style of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfPatternDefinitions
Accesses the total number of pattern definition lines contained in the pattern of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternDouble
Accesses the value of double pattern flag for the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternScale
Accesses the pattern scale of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternSpace
Accesses the pattern space of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternAngle
Accesses the pattern angle (in radians) of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternName
Accesses the pattern name of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.PatternType
Accesses an enumerated pattern type of either UserDefined, PreDefined, or CustomDefined for the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientShift
Accesses the current interpolation value between the gradient definition's default and shifted values.

Autodesk.AutoCAD.DatabaseServices.Hatch.ShadeTintValue
Accesses the one-color tint shade (luminance) value.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientOneColorMode
Assesses whether the gradient hatch is transitioning from a start to a stop color (two-color) or from a color to an adjusted luminance version of the same color (one-color).

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientAngle
Accesses the angle, in radians, at which the current gradient definition is applied.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientName
Accesses the name of the current gradient.

Autodesk.AutoCAD.DatabaseServices.Hatch.GradientType
Accesses an enumerator specifying the type of the gradient pattern.

Autodesk.AutoCAD.DatabaseServices.Hatch.IsSolidFill
Assesses if the hatch object is configured for solid fill.

Autodesk.AutoCAD.DatabaseServices.Hatch.IsHatch
Assesses if the Hatch object is a hatched pattern as opposed to a solid or gradient fill pattern.

Autodesk.AutoCAD.DatabaseServices.Hatch.IsGradient
Assesses if the Hatch object is a gradient.

Autodesk.AutoCAD.DatabaseServices.Hatch.HatchObjectType
Accesses the current state of the gradient object.

Autodesk.AutoCAD.DatabaseServices.Hatch.Associative
Accesses true or false depending on whether this hatch entity is associative with its source boundary geometries.

Autodesk.AutoCAD.DatabaseServices.Hatch.NumberOfLoops
Accesses the total number of boundary loops contained in the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.BackgroundColor
Gets and sets the background color information for the hatch entity within an instance of Color.

Autodesk.AutoCAD.DatabaseServices.Hatch.Normal
Accesses the normal vector of the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.Elevation
Accesses the elevation for the hatch entity.