Autodesk.AutoCAD.Runtime.ProgressMeter
This .NET class wraps the AcDbHostApplicationProgressMeter ObjectARX class.

Autodesk.AutoCAD.Runtime.ProgressMeter.Start
Sets the progress meter to its initial reading and make it visible.

Autodesk.AutoCAD.Runtime.ProgressMeter.Start(System.String)
Sets the progress meter to its initial reading and make it visible.
displayString:  Input optional string to display with the meter.

Autodesk.AutoCAD.Runtime.ProgressMeter.Stop
Cause the meter to cease to be visible.

Autodesk.AutoCAD.Runtime.ProgressMeter.MeterProgress
You should maintain a long data member to count the number of times MeterProgress() has been called.

Autodesk.AutoCAD.Runtime.ProgressMeter.SetLimit(System.Int32)
Called to identify the maximum number of times MeterProgress() is called.
max:  Input maximum number of meter updates.