Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection
This .NET class wraps the AcDbObjectContextCollection ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.GetContext(System.String)
Gets a copy of a context with the specified name.
contextName:  The name of the context to copy and return.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.HasContext(System.String)
Determines whether a context with the specified name exists in the collection.
contextName:  The name of the context to find.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.AddContext(Autodesk.AutoCAD.DatabaseServices.ObjectContext)
Adds a copy of a context to the collection.
ctxt:  The context to copy and add to the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.RemoveContext(System.String)
Removes a context from the collection.
contextName:  The name of the context to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.CurrentContext
Accesses the current context for the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection.Name
Accesses the name of the context collection.