Autodesk.AutoCAD.DatabaseServices.HighlightStateOverrule
This wraps the ObjectARX AcDbHighlightStateOverrule class.

Autodesk.AutoCAD.DatabaseServices.HighlightStateOverrule.PushHighlight(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.GraphicsInterface.HighlightStyle)
This wraps the ObjectARX AcDbHighlightStateOverrule::pushHighlight() method.

Autodesk.AutoCAD.DatabaseServices.HighlightStateOverrule.PopHighlight(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This wraps the ObjectARX AcDbHighlightStateOverrule::popHighlight( AcDbEntity* pSubject, const AcDbFullSubentPath& subId) method.

Autodesk.AutoCAD.DatabaseServices.HighlightStateOverrule.HighlightState(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
this wraps the ObjectARX AcDbHighlightStateOverrule::highlightState() method.