Autodesk.AutoCAD.Geometry.Sphere
This .NET class wraps the AcGeSphere ObjectARX class.

Autodesk.AutoCAD.Geometry.Sphere.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Constructs a spherical segment defined by the input data.
radius:  Input radius for the sphere
center:  Input center point for the sphere
northAxis:  Input direction to the north pole
referenceAxis:  Input direction to the zero meridian
startAngleU:  Input start longitude
endAngleU:  Input end longitude
startAngleV:  Input start latitude
endAngleV:  Input end latitude

Autodesk.AutoCAD.Geometry.Sphere.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a sphere with the input radius centered at the input center.
radius:  Input radius
center:  Input center

Autodesk.AutoCAD.Geometry.Sphere.#ctor
Constructs a valid default sphere.

Autodesk.AutoCAD.Geometry.Sphere.GetAnglesInU
Computes start and end longitudes.

Autodesk.AutoCAD.Geometry.Sphere.GetAnglesInV
Computes start and end latitudes.

Autodesk.AutoCAD.Geometry.Sphere.IsClosed
This method calls CircularArc2d.IsClosed(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Sphere.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if spherical segment is a full circular belt with respect to the tolerance specified.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Sphere.SetAnglesInU(System.Double,System.Double)
Changes sphere definition to satisfy the input data.
startAngle:  Input start longitude
endAngle:  Input end longitude

Autodesk.AutoCAD.Geometry.Sphere.SetAnglesInV(System.Double,System.Double)
Changes sphere definition to satisfy the input data.
startAngle:  Input start latitude
endAngle:  Input end latitude

Autodesk.AutoCAD.Geometry.Sphere.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Changes sphere definition to satisfy the input data.
radius:  Input radius of sphere
center:  Input center of sphere
northAxis:  Input axis of sphere
referenceAxis:  Input reference axis
startAngleU:  Input start longitude
endAngleU:  Input end longitude
startAngleV:  Input start latitude
endAngleV:  Input end latitude

Autodesk.AutoCAD.Geometry.Sphere.Set(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Changes sphere definition to satisfy the input data.
radius:  Input radius of sphere
center:  Input center of sphere

Autodesk.AutoCAD.Geometry.Sphere.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls Sphere.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.Sphere.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersections with a linear entity.
linearEntity:  Input liner entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Sphere.IsOuterNormal
Returns flag indicating if the sphere normal is pointing outwards.

Autodesk.AutoCAD.Geometry.Sphere.SouthPole
Returns position of the south pole.

Autodesk.AutoCAD.Geometry.Sphere.NorthPole
Returns position of the north pole.

Autodesk.AutoCAD.Geometry.Sphere.ReferenceAxis
Returns direction to the zero meridian.

Autodesk.AutoCAD.Geometry.Sphere.NorthAxis
Returns direction to the north pole.

Autodesk.AutoCAD.Geometry.Sphere.Center
Returns sphere's center.

Autodesk.AutoCAD.Geometry.Sphere.Radius
Returns the radius of the sphere.