Autodesk.AutoCAD.DatabaseServices.RevolvedSurface
This .NET class wraps the AcDbRevolvedSurface ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveOptions
Accesses the revolve options for this surface.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.StartAngle
Accesses the starting angle.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveAngle
Accesses the angle of revolution, in radians.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.AxisDirection
Accesses the axis direction.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.AxisPoint
Accesses the axis point around which the entity will be revolved.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveProfile
This wraps the ObjectARX AcDbRevolvedSurface::revolveProfile() method.

Autodesk.AutoCAD.DatabaseServices.RevolvedSurface.RevolveEntity
Accesses the entity which is being revolved.