Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator
This enumerator walks the linked list of an underlying resbuf ObjectARX structure.

Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator.MoveNext
Advances this enumerator to the next node in the ResultBuffer list, or to the first node if the current node is null.

Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator.Reset
Sets the current ResultBuffer node to null.

Autodesk.AutoCAD.DatabaseServices.ResultBufferEnumerator.Current
Accesses the current item.