Autodesk.AutoCAD.Runtime.Overrule
This .NET class wraps the ObjectARX class AcRxOverrule.

Autodesk.AutoCAD.Runtime.Overrule.AddOverrule(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Runtime.Overrule,System.Boolean)
This .NET method wraps the ObjectARX method AcRxOverrule::addOverrule().

Autodesk.AutoCAD.Runtime.Overrule.RemoveOverrule(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Runtime.Overrule)
This .NET method wraps the ObjectARX method AcRxOverrule::removeOverrule().

Autodesk.AutoCAD.Runtime.Overrule.HasOverrule(Autodesk.AutoCAD.Runtime.RXObject,Autodesk.AutoCAD.Runtime.RXClass)
This .NET method wraps the ObjectARX method AcRxOverrule::hasOverrule().

Autodesk.AutoCAD.Runtime.Overrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.Runtime.Overrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.Runtime.Overrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.Runtime.Overrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.

Autodesk.AutoCAD.Runtime.Overrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.

Autodesk.AutoCAD.Runtime.Overrule.IsApplicable(Autodesk.AutoCAD.Runtime.RXObject)
This .NET method wraps the ObjectARX method AcRxOverrule::isApplicable().

Autodesk.AutoCAD.Runtime.Overrule.Overruling
This .NET property wraps the ObjectARX methods AcRxOverrule::isOverruling() and AcRxOverrule::setIsOverruling().