Autodesk.AutoCAD.DatabaseServices.PointCurveConstraint
This class represents a PointCurve (coincident) constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.PointCurveConstraint.#ctor
Default constructor.