Autodesk.AutoCAD.Geometry.ClipBoundary2dData
This class contains data used by various ClipBoundary2d operations.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.IsEqualTo(Autodesk.AutoCAD.Geometry.ClipBoundary2dData)
This method tests a against this object for equivalency.
a:  Input object to check against

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.op_Inequality(Autodesk.AutoCAD.Geometry.ClipBoundary2dData,Autodesk.AutoCAD.Geometry.ClipBoundary2dData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.op_Equality(Autodesk.AutoCAD.Geometry.ClipBoundary2dData,Autodesk.AutoCAD.Geometry.ClipBoundary2dData)
.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.ClippedSegmentSourceLabel
Returns the ClippedSegmentSourceLabel property value.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.ClipCondition
Returns the ClipCondition property value.

Autodesk.AutoCAD.Geometry.ClipBoundary2dData.ClippedVertices
Returns the ClippedVertices property value.