Autodesk.AutoCAD.DatabaseServices.Xrecord
This .NET class wraps the AcDbXrecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Xrecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Xrecord.Append(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Allows custom applications to add to the Xrecord without getting the existing data, appending to the end of resbuf chain and setting the data back into the xrecord.
data:  Input first result buffer (not its address) in a linked list of result buffer that contain the data for the xrecord.

Autodesk.AutoCAD.DatabaseServices.Xrecord.GetEnumerator
This is GetEnumerator, a member of class Xrecord.

Autodesk.AutoCAD.DatabaseServices.Xrecord.IEnumerableTypedValueGetEnumerator
This is IEnumerableTypedValueGetEnumerator, a member of class Xrecord.

Autodesk.AutoCAD.DatabaseServices.Xrecord.IEnumerableGetEnumerator
This is IEnumerableGetEnumerator, a member of class Xrecord.

Autodesk.AutoCAD.DatabaseServices.Xrecord.MergeStyle
Sets the merge style for insert operations.

Autodesk.AutoCAD.DatabaseServices.Xrecord.XlateReferences
Returns a Boolean indicating whether references are to be translated.

Autodesk.AutoCAD.DatabaseServices.Xrecord.Data
Accesses the XRecord data.