Autodesk.AutoCAD.Geometry.NurbCurve2dFitData
This class contains the data returned by the NurbCurve2d.FitData property.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.IsEqualTo(Autodesk.AutoCAD.Geometry.NurbCurve2dFitData)
Compares this object to a and returns true if they are equal.
a:  Input object to check against

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.op_Inequality(Autodesk.AutoCAD.Geometry.NurbCurve2dFitData,Autodesk.AutoCAD.Geometry.NurbCurve2dFitData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.op_Equality(Autodesk.AutoCAD.Geometry.NurbCurve2dFitData,Autodesk.AutoCAD.Geometry.NurbCurve2dFitData)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.EndTangent
Returns the EndTangent property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.StartTangent
Returns the StartTangent property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.TangentsExist
Returns the TangentsExist property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.FitTolerance
Returns the FitTolerance property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.Degree
Returns the Degree property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dFitData.FitPoints
Returns the FitPoints property value.