Autodesk.AutoCAD.DatabaseServices.DataTable
This .NET class wraps the AcDbDataTable ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataTable.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DataTable.Assign(Autodesk.AutoCAD.DatabaseServices.DataTable)
Assigns a new table to this object.
other:  New table to assign.

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnAt(System.Int32)
Gets the column at the specified column index.
index:  Index of column

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnNameAt(System.Int32)
Gets the name of the column at the specified column index.
index:  Column index

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnTypeAt(System.Int32)
Gets the type of the column at the specified column index.
index:  Column index

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnIndexAtName(System.String)
Gets the index of the column with the specified column name.
name:  Name of column

Autodesk.AutoCAD.DatabaseServices.DataTable.AppendColumn(Autodesk.AutoCAD.DatabaseServices.CellType,System.String)
Creates a new column and adds it as the last column of the table.
type:  Type of the column being added
columnName:  Name of the column

Autodesk.AutoCAD.DatabaseServices.DataTable.InsertColumnAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.CellType,System.String)
Creates a new column and inserts it into the table at the specified column index.
index:  Column index at which to insert the new column
type:  Type of new column
columnName:  Name of new column

Autodesk.AutoCAD.DatabaseServices.DataTable.RemoveColumnAt(System.Int32)
Removes the specified column from the table.
index:  Index of column to remove

Autodesk.AutoCAD.DatabaseServices.DataTable.GetRowAt(System.Int32)
Gets the row of data at the specified row index.
index:  Row index

Autodesk.AutoCAD.DatabaseServices.DataTable.SetRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
Replaces the row at the specified index .
Set the validate parameter to true if the type of each cell in the new row should be validated against the type of each corresponding column and if the number of columns in the row should be validated with regard to the number of columns in the table.
index:  Row index of the row to be replaced
row:  New row of data
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.AppendRow(Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
Appends a row to the end of the table.
Set the validate parameter to true if the type of each cell in the new row should be validated against the type of each corresponding column and if the number of columns in the row should be validated with regard to the number of columns in the table.
row:  Row being added
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.InsertRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
Inserts a row of data into the table immediately before the row at the specified index.
index:  Row index of position at which to insert the row
row:  Row of data to insert
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.RemoveRowAt(System.Int32)
Removes the specified row from the table.
index:  Index of row to remove

Autodesk.AutoCAD.DatabaseServices.DataTable.GetCellAt(System.Int32,System.Int32)
Gets the cell at the specified row and column indexes.
row:  Row index of cell to access
col:  Column index of cell to access

Autodesk.AutoCAD.DatabaseServices.DataTable.SetCellAt(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
Replaces the cell in the table at the specified row and column with the specified cell.
row:  Row index of the cell to be replaced
col:  Column index of the cell to be replaced
cell:  New cell

Autodesk.AutoCAD.DatabaseServices.DataTable.TableName
Accesses the table name.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumColsGrowSize
Accesses the grow size for the number of physical columns of a table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumColsPhysicalSize
Accesses the number of columns allocated for the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumRowsGrowSize
Accesses the grow size for the number of physical rows of a table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumRowsPhysicalSize
Accesses the number of rows allocated for the physical size of the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumRows
Accesses the number of rows in the table.

Autodesk.AutoCAD.DatabaseServices.DataTable.NumColumns
Accesses the number of columns in the table.