Autodesk.AutoCAD.DatabaseServices.Cell
This class represents table cells.

Autodesk.AutoCAD.DatabaseServices.Cell.Column
Returns the number of columns.

Autodesk.AutoCAD.DatabaseServices.Cell.Row
Returns the number of rows.