Autodesk.AutoCAD.Geometry.LinearEntity2d
This .NET class wraps the AcGeLinearEnt2d ObjectARX class.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d)
This method calls LinearEnt2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 2D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity2d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines intersect and if so returns their intersection point.
line:  Input any 2D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity2d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity2d)
Overloads for the LinearEntity2d.Overlap method.
line:  Input any 2D linear entityDetermines if two lines overlap and if so returns the line that coincides with their region of overlap. The returned overlap line may be an object of any derived class of LinearEnt2d, depending on the types of the two lines.This method calls LinearEnt2d.Overlap(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap.
line:  Input any 2D linear entity
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity2d)
This method calls LinearEnt2d.IsParallelTo(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 2D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are parallel.
line:  Input any 2D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity2d)
This method calls LinearEnt2d.IsPerpendicularTo(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 2D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are perpendicular to each other.
line:  Input any 2D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity2d)
This method calls LinearEnt2d.IsColinearTo(LinearEntity2d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 2D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity2d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are colinear.
line:  Input any 2D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity2d.GetPerpendicularLine(Autodesk.AutoCAD.Geometry.Point2d)
Returns a line that is perpendicular to this line and passes through the input point.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.LinearEntity2d.GetLine
Returns an infinite line that is coincident with this line.

Autodesk.AutoCAD.Geometry.LinearEntity2d.Direction
Returns direction vector of line.

Autodesk.AutoCAD.Geometry.LinearEntity2d.PointOnLine
Returns an arbitrary point on the line.