Autodesk.AutoCAD.DatabaseServices.ArcDimension
This .NET class wraps the AcDbArcDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
The primary constructor.
centerPoint:  Input the center of the arc being dimensioned
xLine1Point:  Input the first extension line end point
xLine2Point:  Input the second extension line end point
arcPoint:  Input the point on arc being dimensioned
dimensionText:  Input the dimension text to use instead of calculated value
dimensionStyle:  Input the dimension style object ID.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.HasLeader
Determines whether the arc length dimension has an extra leader drawn to resolve ambiguity.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.IsPartial
Reserved for future use.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcSymbolType
Accesses the type of symbol to use in the arc length dimension's text string.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.XLine2Point
Accesses the start point for the arc length dimension's second extension line.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.XLine1Point
Accesses the start point for the arc length dimension's first extension line.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.Leader2Point
Accesses the end point for the arc length dimension's extra leader, if drawn.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.Leader1Point
Accesses the start point for the arc length dimension's extra leader, if drawn.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.CenterPoint
Accesses the center point of the arc dimensioned by the arc length dimension.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcPoint
Accesses the point through which the arc length dimension's dimension arc passes.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcEndParam
Accesses the parameter of the arc being dimensioned corresponding to the arc length dimension's second definition point.

Autodesk.AutoCAD.DatabaseServices.ArcDimension.ArcStartParam
Accesses the point through which the arc length dimension's dimension arc passes.