Autodesk.AutoCAD.DatabaseServices.AssocAsmBodyActionParam
This is class Autodesk.AutoCAD.DatabaseServices.AssocAsmBodyActionParam.

Autodesk.AutoCAD.DatabaseServices.AssocAsmBodyActionParam.#ctor
This wraps the ObjectARX AcDbAssocAsmBodyActionParam::AcDbAssocAsmBodyActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocAsmBodyActionParam.SetBody(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocAsmBodyActionParam::setBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocAsmBodyActionParam.SetBody(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocAsmBodyActionParam::setBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocAsmBodyActionParam.DependentOnCompoundObject
This wraps the ObjectARX AcDbAssocAsmBodyActionParam::getDependentOnCompoundObject() method.