Autodesk.AutoCAD.Geometry.LineSegment3d
This .NET class wraps the AcGeLineSeg3d ObjectARX class.

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a line segment between point1 and point2.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a line segment whose start point is point and whose endpoint is point+vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.LineSegment3d.GetBisector
Sets the input plane to the unbounded plane that is perpendicular to the line segment and passes through its midpoint.

Autodesk.AutoCAD.Geometry.LineSegment3d.BaryComb(System.Double)
Returns the point that is the weighted average of the start and end points of the line segment.
blendCoefficient:  Input y real number

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Point3d,System.Double)
Changes the definition of the line segment so that the line segment passes through the input point and is tangent to the input curve.
curve:  Input any 3D curve
point:  Input any 3D point
parameter:  Input point on curve where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double)
Changes the definition of the line segment so that the line segment is tangent to the two input curves.
curve1:  Input any 3D curve
curve2:  Input any 3D curve
parameter1:  Input point on curve1 where line segment is tangent to curve
parameter2:  Input point on curve2 where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the line segment so that the start point is point1 and the endpoint is point2.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the definition of the line segment so that the start point is point and the endpoint is point+vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment

Autodesk.AutoCAD.Geometry.LineSegment3d.Length
Returns the length of the line segment (the distance between the start point and endpoint).

Autodesk.AutoCAD.Geometry.LineSegment3d.EndPoint
Returns the endpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.MidPoint
Returns the midpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment3d.StartPoint
Returns the start point of the line segment.