Autodesk.AutoCAD.DatabaseServices.MTextFragment
This .NET class wraps the AcDbMTextFragment ObjectARX struct.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetUnderLinePoints
Returns an array of two points that define the underline for this object, if any is defined.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetOverLinePoints
Returns an array of two points that define the overline for this object, if any is defined.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetStrikethroughPoints
Returns an array of two points that define the strike through for this object, if any is defined.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Italic
Assesses if the text is TrueType and italic.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Bold
Assesses if text is TrueType and bold.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.TrueTypeFont
Accesses the TrueType font.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Strikethrough
Assesses if strike through is on.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Overlined
Assesses if overlining is on.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Underlined
Assesses if underlined is on.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.StackBottom
Assesses if the text is bottom part of stacked text.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.StackTop
Accesses if the text is top part of stacked text.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Color
Accesses the text color.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.TrackingFactor
Accesses the text tracking factor.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.ObliqueAngle
Accesses the text oblique angle.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.WidthFactor
Accesses the text width factor.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.CapsHeight
Accesses the text height.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Extents
Accesses the text extents.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.BigFont
Accesses the bigfont text.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.ShxFont
Accesses the SHX font.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Text
Accesses the text string.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Direction
Accesses the text flow direction vector.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Normal
Accesses the normal vector.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Location
Accesses the text insertion point.