Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection
This collection class provides a container for MlineStyleElement objects.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.Add(Autodesk.AutoCAD.DatabaseServices.MlineStyleElement,System.Boolean)
Adds a new element to the collection.
If checkIfReferenced is true and the mline style object is referenced, then the set operation will be aborted. This indicates that it is not safe to change this mline style object.
Returns the index of the new element.
element:  Input element to add
checkIfReferenced:  Input Boolean indicating whether to check if the style is referenced

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.RemoveAt(System.Int32)
Removes an object from the collection at the specified index.
index:  Index of item to remove

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.MlineStyleElement[],System.Int32)
Copies objects in array starting from index to this collection.
array:  Target array.
index:  The zero-based index in array at which copying begins.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection.Count
Accesses the number of elements in the collection.