Autodesk.AutoCAD.DatabaseServices.PointCloudCrop
This class defines a cropping boundary for the PointCloudEx entity.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.Create(System.IntPtr)
Creates a PointCloudCrop instance.
unmanagedObjPtr:  Specifies the AcDbPointCloudCrop pointer. For a valid pointer, it binds the created PointCloudCrop with it; if it is System::IntPtr::Zero, it creates a non-binded PointCloudCrop.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.IsValid
Checks if this object represents a valid cropping boundary.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.Clear
Clears all cropping boundary information.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.Dispose
This is Dispose, a member of class PointCloudCrop.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.Inverted
Gets or sets whether this cropping region's results are to be inverted.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.Inside
Gets or sets whether this cropping boundary is allowing points inside of itself or outside.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.CropType
Gets or set the cropping boundary type for this object.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.Vertices
Gets or sets the points array for point cloud crop boundary.

Autodesk.AutoCAD.DatabaseServices.PointCloudCrop.CropPlane
Gets or sets the plane on which this cropping boundary is defined.