Autodesk.AutoCAD.Geometry.SplineEntity3d
This .NET class wraps AcGeSplineEnt3d ObjectARX class.

Autodesk.AutoCAD.Geometry.SplineEntity3d.GetContinuityAtKnot(System.Int32)
Returns the degree of the highest derivative that is continuous at a knot.
i:  Input knot index

Autodesk.AutoCAD.Geometry.SplineEntity3d.GetContinuityAtKnot(System.Int32,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the degree of the highest derivative that is continuous at a knot.
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.
index:  Input knot index

Autodesk.AutoCAD.Geometry.SplineEntity3d.KnotAt(System.Int32)
Returns a knot value from the spline's knot vector.
i:  Input index of a knot

Autodesk.AutoCAD.Geometry.SplineEntity3d.SetKnotAt(System.Int32,System.Double)
Resets the value of a knot at a given index i.
i:  Input index of knot
value:  Input value of knot

Autodesk.AutoCAD.Geometry.SplineEntity3d.ControlPointAt(System.Int32)
Returns a control point from the array of spline's control points.
i:  index of a control point

Autodesk.AutoCAD.Geometry.SplineEntity3d.SetControlPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets a control point from the spline's control array.
i:  Input index of a control point in the control array
point:  Input value of the point

Autodesk.AutoCAD.Geometry.SplineEntity3d.HasFitData
Returns true if the spline is constructed by using any interpolating fit data.

Autodesk.AutoCAD.Geometry.SplineEntity3d.EndPoint
Returns the point on the spline at the maximal parametric value.

Autodesk.AutoCAD.Geometry.SplineEntity3d.StartPoint
Returns the point on the curve at the minimal parameter value.

Autodesk.AutoCAD.Geometry.SplineEntity3d.EndParameter
Returns the maximal parameter on the spline.

Autodesk.AutoCAD.Geometry.SplineEntity3d.StartParameter
Returns the minimal parameter on the curve.

Autodesk.AutoCAD.Geometry.SplineEntity3d.NumberOfControlPoints
Returns the number of control points in the control array.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Knots
Return the spline's knot vector.

Autodesk.AutoCAD.Geometry.SplineEntity3d.NumberOfKnots
Returns the number of knots in the knot vector.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Order
Returns spline's order.

Autodesk.AutoCAD.Geometry.SplineEntity3d.Degree
Returns the degree of spline.

Autodesk.AutoCAD.Geometry.SplineEntity3d.IsRational
Returns a flag indicating if the spline is a polynomial or rational.