Autodesk.AutoCAD.DatabaseServices.BeginWblockObjectsEventArgs
This class provides data for the BeginWblockObjects event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockObjectsEventArgs.IdMapping
Get the IdMapping that maps the source objects to the destination objects.

Autodesk.AutoCAD.DatabaseServices.BeginWblockObjectsEventArgs.From
Gets the database being wblock'ed.