Autodesk.AutoCAD.GraphicsInterface.VertexData
This .NET class wraps the AcGiVertexData ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.VertexData.SetNormalVectors(Autodesk.AutoCAD.Geometry.Vector3d[])
Sets normal to be the array of face normal vectors used by this object.
normal:  Input array of normal vectors

Autodesk.AutoCAD.GraphicsInterface.VertexData.SetTrueColors(Autodesk.AutoCAD.Colors.EntityColor[])
Overloads for the VertexData.SetTrueColors method.
colors:  Input array of colors

Autodesk.AutoCAD.GraphicsInterface.VertexData.GetTrueColors
Returns the true colors defined for this entity.

Autodesk.AutoCAD.GraphicsInterface.VertexData.GetNormalVectors
Returns the vertex normal currently in use by the VertexData object.

Autodesk.AutoCAD.GraphicsInterface.VertexData.OrientationFlag
Returns the current orientation type for vertices.