Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits
This .NET class wraps the AcGiNonEntityTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetupForEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This call initializes the entire SubEntityTraits and DrawableTraits from the entity.
entity:  Input entity

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetSelectionMarker(System.IntPtr)
Sets the SubEntityTraits object to use markerId as the graphics marker for all graphics primitives drawn until the next call to this function, or the end of the WorldDraw() or ViewportDraw() execution.
markerId:  Input non-zero integer to use as graphics system marker

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.AddLight(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Drawables that emit light can add one (or more) "lights" to the model.
lightId:  Input the added light.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SetHighlightProperty(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.HighlightProperty,System.Object)
This is SetHighlightProperty, a member of class NonEntityTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.GetHighlightProperty(Autodesk.AutoCAD.GraphicsInterface.DrawableTraits.HighlightProperty)
This is GetHighlightProperty, a member of class NonEntityTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SelectionFlags
This is SelectionFlags, a member of class NonEntityTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LinePattern
This is LinePattern, a member of class NonEntityTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Fill
This is Fill, a member of class NonEntityTraits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.SelectionOnlyGeometry
Returns if the following geometry is only intended for selection.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.ShadowFlags
Returns the current shadow flags value, as specified by the last valid call to SetShadowFlags().The default is ShadowsCastAndReceive.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.DrawFlags
Returns the current draw flags value.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.VisualStyle
Returns the object ID of the visual style in the subentity traits.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Sectionable
Returns true if the graphics primitives drawn with this object will participate in sectioning.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Mapper
Returns a pointer to the active mapper definition.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Material
Returns the database ID of the current material assignment.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.PlotStyleDescriptor
Returns PlotStyleDescriptor property value.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Thickness
Thickness is an extrusion in WCS units along the positive Z axis.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineTypeScale
The scaling factor of linetype can be varied by this trait.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineWeight
Returns the lineweight as defined by the enum LineWeight.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.FillType
Returns the FillType currently set in the SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.LineType
Returns the objectId of the linetypeTableRecord that is currently set in the SubEntityTraits object to be used to when drawing graphics primitives.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Layer
Returns the objectId of the layerTableRecord that is currently set in the SubEntityTraits object to be used to draw graphics primitives on.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.TrueColor
Returns color through EntityColor class.

Autodesk.AutoCAD.GraphicsInterface.NonEntityTraits.Color
Returns the AutoCAD color index value currently set within the SubEntityTraits object.