Autodesk.AutoCAD.Geometry.PlanarEquationCoefficients
This class encapsulates the data returned by the PlanarEnt.getCoefficients() ObjectARX function.

Autodesk.AutoCAD.Geometry.PlanarEquationCoefficients.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructor overloads used to create an instance of the PlanarEquationCoefficients.PlanarEquationCoefficients class.
a:  Input.
b:  Input.
c:  Input.
d:  Input.

Autodesk.AutoCAD.Geometry.PlanarEquationCoefficients.D
Returns output coefficient D.

Autodesk.AutoCAD.Geometry.PlanarEquationCoefficients.C
Returns output coefficient C.

Autodesk.AutoCAD.Geometry.PlanarEquationCoefficients.B
Returns output coefficient B.

Autodesk.AutoCAD.Geometry.PlanarEquationCoefficients.A
Returns output coefficient A.