Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule
This .NET class wraps ObjectARX class AcDbDimensionStyleOverrule.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.DimensionStyle(Autodesk.AutoCAD.DatabaseServices.Dimension)
This .NET method wraps the ObjectARX AcDbDimensionStyleOverrule::dimensionStyle Method.
dimension:  Dimension that this overrule is applied against.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetDimensionStyle(Autodesk.AutoCAD.DatabaseServices.Dimension,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This .NET method wraps the ObjectARX AcDbDimensionStyleOverrule::setDimensionStyle Method.
dimension:  Dimension that this overrule is applied against.
id:  Input the object ID of the desired DimStyleTableRecord to be used by the dimension.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.Dimension,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This .NET method wraps the ObjectARX method AcDbDimensionStyleOverrule::setDimstyleData Method.
dimension:  Dimension that this overrule is applied against.
dimstyleId:  Object ID of DimStyleTableRecord from which to copy dimension variable information.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.Dimension,Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
This .NET method wraps the ObjectARX AcDbDimensionStyleOverrule::setDimstyleData Method.
dimension:  Dimension that this overrule is applied against.
style:  DimStyleTableRecord from which to copy the dimension variable information.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.GetDimstyleData(Autodesk.AutoCAD.DatabaseServices.Dimension,Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
This .NET method wraps the ObjectARX AcDbDimensionStyleOverrule::getDimstyleData Method.
dimension:  Dimension that this overrule is applied against.
style:  Existing DimStyleTableRecord to which the dimension variable data will be copied.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Name of the registered application.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Name of dictionary entry.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Array of ids defining the lookup table

Autodesk.AutoCAD.DatabaseServices.DimensionStyleOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.