Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry
This lightweight class represents an entry in a DatabaseServices.DBDictionary object.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.#ctor(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor creates a new object with the provided key and value.
key:  Original key
value:  Original object ID value

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.Value
Accesses the Value property value.

Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry.Key
Accesses the Key property value.