Autodesk.AutoCAD.Geometry.Tolerance
This .NET class wraps AcGeTol ObjectARX class.

Autodesk.AutoCAD.Geometry.Tolerance.#ctor(System.Double,System.Double)
Constructs an object with the given vector and point.
equalVector:  Input default vector
equalPoint:  Input default point

Autodesk.AutoCAD.Geometry.Tolerance.Global
Returns the Global property value.

Autodesk.AutoCAD.Geometry.Tolerance.EqualVector
Returns equalVector tolerance.

Autodesk.AutoCAD.Geometry.Tolerance.EqualPoint
Returns EqualPoint tolerance.