Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse
This class represents a constrained ellipse node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained ellipse is holding on.

Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.CenterPoint
Gets the center point of the constrained ellipse, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.MinorRadius
Gets the minor radius of the constrained ellipse.

Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.MajorRadius
Gets the major radius of the constrained ellipse.

Autodesk.AutoCAD.DatabaseServices.ConstrainedEllipse.Direction
Gets the direction unit vector of the major axis of the constrained ellipse, relative to the work plane of the owning Assoc2dConstraintGroup object.