Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId
The concrete derived AssocPersSubentityId class that simply keeps the SubentityId when it is persistent and does not change.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.#ctor(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Constructor.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.TransientSubentCount(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns number 1 if not null or 0 if null.
entity:  Not used.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.SubentType(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns the type of the stored SubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.SubentId(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns the stored SubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Returns true if this and the other AssocSimplePersSubentityId reference exactly the same subentity of the same entity.
entity:  The entity owning the subentities of this and the other AssocPersSubentityId.
other:  The other AssocSimplePersSubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to write the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to write the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
The standard protocol.
auditInfo:  See the AuditInfo documentation.

Autodesk.AutoCAD.DatabaseServices.AssocSimplePersSubentId.IsNull
Indicates whether the SubentityId stored in this AssocSimplePersSubentityId is null.