Autodesk.AutoCAD.DatabaseServices.UnderlayLayer
This .NET class wraps the AcUnderlayLayer ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayLayer.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.UnderlayLayer.State
Returns the state of the underlay layer.

Autodesk.AutoCAD.DatabaseServices.UnderlayLayer.Name
Returns the name of the underlay layer.