Autodesk.AutoCAD.DatabaseServices.LinkedTableData
This .NET class wraps the AcDbLinkedTableData ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetEnumerator(Autodesk.AutoCAD.DatabaseServices.TableEnumeratorOption)
Returns an enumerator iterator.
option:  Input iterator option.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetSize(System.Int32,System.Int32)
Resizes the table.
numRows:  Input new row size.
numCols:  Input new column size.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetColumnName(System.Int32)
This function gets the name of the column at the specified column index.
index:  Input column index

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetColumnName(System.Int32,System.String)
Gets the columns name.
index:  Input zero based index of the column
name:  Input column name to set. This can be an empty string.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.AppendColumn(System.Int32)
Appends one or more columns.
columnsNumber:  Input number of columns to append

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.InsertColumn(System.Int32,System.Int32)
Inserts one or more columns at the specified index.
index:  Input index at which to insert the new columns
columnsNumber:  Input number of columns to insert

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.DeleteColumn(System.Int32,System.Int32)
Deletes one or more columns.
index:  Input starting index of the columns to delete
columnsNumberToDelete:  Input number of columns to delete

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.AppendRow(System.Int32)
Appends one or more rows.
rowsNumber:  Input number of rows to append

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.InsertRow(System.Int32,System.Int32)
Inserts one or more rows at the specified index.
index:  Input index at which to insert the new rows.
rowsNumber:  Input number of rows to insert

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.DeleteRow(System.Int32,System.Int32)
Deletes one or more rows.
index:  Input starting index of the rows to delete
rowsNumberToDelete:  Input number of rows to delete

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.DeleteContent(System.Int32,System.Int32)
Deletes all the contents in a cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetContentTypes(System.Int32,System.Int32)
Gets the content type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.IsContentEditable(System.Int32,System.Int32)
Checks if the content of the specified cell can be modified.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetCellState(System.Int32,System.Int32)
Gets the cell state of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetCellState(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellStates)
Sets the cell state.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Cell state to set. This will replace all the bits of the current state.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.DataType(System.Int32,System.Int32)
Gets the data type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.UnitType(System.Int32,System.Int32)
Gets the unit type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetDataFormat(System.Int32,System.Int32)
Gets the data format at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetDataFormat(System.Int32,System.Int32,System.String)
Sets the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
format:  Input data format to set

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetValue(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.FormatOption)
Gets the value of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
content:  Input content index. It should be more than or equal to 0 and less than the number of contents.
formatOption:  Input format option for formatting the cell value. See Remarks for description of each option.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetValue(System.Int32,System.Int32)
Gets the value of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetValue(System.Int32,System.Int32,System.Int32,System.Object,Autodesk.AutoCAD.DatabaseServices.ParseOption)
Sets the value of the content at the specified content index
Only the following values of ParseOption enum are valid for this function.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
content:  Input content index. It should be more than or equal to 0 and less than the number of contents.
value:  Input value to set.
parseOption:  Input parse option. See remarks.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetValue(System.Int32,System.Int32,System.Object)
Sets the value of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input value to set

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetFieldId(System.Int32,System.Int32)
Returns the id of the field if the first content is a field; returns null id if there is no field.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetFieldId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the id of the field as the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input field id to set

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetBlockTableRecordId(System.Int32,System.Int32)
Returns the id of the block table record if the first content is a block; returns null id if the first content is not a block.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetBlockTableRecordId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the id of the block table record as the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input attribute value to set

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the block attribute value if the first content is a block with attributes.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
attributeDefinitionId:  Input object ID of the AttributeDefinition object

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Sets the block attribute value if the first content is a block with attributes.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
attributeDefinitionId:  Input object ID of the AttributeDefinition object
value:  Input attribute value to set

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetToolTip(System.Int32,System.Int32)
Gets the tooltip string for cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetToolTip(System.Int32,System.Int32,System.String)
Sets the tooltip string for cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
value:  Input tool tip string to set

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetCustomData(System.Int32,System.Int32,System.String)
Gets the custom data value set in cell, row, or column as key-value pairs.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
key:  Input key to retrieve the custom data

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetCustomData(System.Int32,System.Int32,System.String,System.Object)
Sets the custom data value set in cell, row, or column as key-value pairs.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
key:  Input key to use for the custom data
value:  Input custom data to set. This can be NULL. If it is NULL it deletes the custom data.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.IsLinked(System.Int32,System.Int32)
Checks if a cell is linked to a data source.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange)
Gets the datalinks set in the specified range.
range:  Input range to get the data links. If this is NULL it gets all the data links in the table

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetDataLink
Returns a collection of all the data links.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.GetDataLink(System.Int32,System.Int32)
Gets the id of the data link if the specified cell is linked to a data source using a data link.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell range.
The current contents of the cells in the specified range will be deleted. If the top-left cell of the specified range is top-left cell of an existing linked range this will overwrite the current data link. If the range overlaps any other cells in any linked range the function will fail. This function does not automatically update the data. Call UpdateDataLink to update the data.
range:  Range of cells to link to external source.
dataLinkId:  Id of the data link to set
bUpdate:  Input true if the data link has is to be updated after setting it, false if not

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.SetDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell.
If the specified cell is top-left cell of an existing linked range this will overwrite the current data link. If it is any other cell in a linked range the function will fail. This function does not automatically update the data. Call UpdateDataLink to update the data.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dataLinkId:  Input id of the data link to set
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.UpdateDataLink(Autodesk.AutoCAD.DatabaseServices.UpdateDirection,Autodesk.AutoCAD.DatabaseServices.UpdateOption)
Updates all the data links in the table.
dir:  Input direction of update
option:  Input option flag

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.UpdateDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.UpdateDirection,Autodesk.AutoCAD.DatabaseServices.UpdateOption)
Updates the data link at the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dir:  Input direction of update
option:  Input option flag

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.NumberOfRows
Accesses the number of rows.

Autodesk.AutoCAD.DatabaseServices.LinkedTableData.NumberOfColumns
Accesses the number of columns.