Autodesk.AutoCAD.DatabaseServices.SectionViewStyle
The style object for a section view.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.GetViewLabelPattern(Autodesk.AutoCAD.DatabaseServices.Field)
Gets the pattern for view label.
field:  Input: a field object to be updated with the view label pattern master field.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.SetViewLabelPattern(System.String,Autodesk.AutoCAD.DatabaseServices.Field)
Sets the pattern for view label.
pattern:  Input: the pattern string for the view label.
field:  Input: optional pointer to a Field object to provide the field data to be used in the view label pattern.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.SetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
Sets this object's properties to the default values of given database.
dataBasePointer:  Input: database to be used

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PostViewStyleToDb(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
Add this view style object to the given database using the given name.
dataBasePointer:  Input: database to be updated
styleName:  Input: name to be used for this view style.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.DefaultViewName(System.Int32)
Returns the default section name based on the given index.
index:  The index of the default name.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ValidateViewName(System.String)
Validates the given name as a section name.
name:  Input: section name to validate.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ValidateIdentifierExcludeCharacters(System.String)
Checks whether the identifier exclude character string is correctly formatted and contains valid characters.
characters:  Input: the characters to validate.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowHatching
Indicates whether the section view should display hatching.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowEndAndBendLines
Indicates whether the section symbol should display the end and bend lines.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowAllBendIndentifiers
Indicates whether the section symbol should display the all the bend identifiers.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowAllPlaneLines
Indicates whether the section symbol should display all the plane lines.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowViewLabel
Indicates whether the section view should display the view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ShowArrowheads
Indicates whether the section symbol should display the arrowheads.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IsContinuousLabeling
Indicates whether the section view symbol should be created with continuous labeling at every bend.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchTransparency
The transparency for the hatching to be used by the section view.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchAngles
The list of angles to be used by the hatching within a section view.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchScale
The scale for the hatching to be used by the section view.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchBackgroundColor
The color for the hatching background to be used by the section view.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchColor
The color for the hatching to be used by the section view.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.HatchPattern
The name of the hatch pattern to be used by the section view hatching.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelPattern
The pattern for the section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelAlignment
The type of alignment for the section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelAttachment
The type of attachment for the section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelOffset
The offset distance for the section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelTextHeight
The height for the section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelTextColor
The color for section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ViewLabelTextStyleId
The id of the text style table record to be associated to the section view label text.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.EndLineLength
The length for the section symbol end lines.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineLength
The length for the section symbol bend lines.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineTypeId
The ObjectId of the linetype for the section symbol bend lines.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineWeight
The line weight for the section symbol bend lines.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.BendLineColor
The color for the section bend line.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PlaneLineTypeId
The ObjectId of the linetype for the section symbol plane line.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PlaneLineColor
The color for the section symbol plane line.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.PlaneLineWeight
The line weight for the section symbol plane line.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowSymbolExtensionLength
The length for the section symbol arrow extension line.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowSymbolSize
The size for the section symbol arrow.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowSymbolColor
The color for the section symbol arrow.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowEndSymbolId
The objectId of the block table record used to represent the arrow end symbol.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowStartSymbolId
The objectId of the block table record used to represent the arrow start symbol.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.EndLineOvershoot
The length of the end line overshoot.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.ArrowPosition
The section view symbol arrow direction setting which can be towards the cutting plane or away from the cutting plane.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierOffset
The distance the section view symbol identifiers are offset from the section view symbol arrowheads.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierPosition
The identifier offset type.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierExcludeCharacters
The characters excluded from use by section symbol identifiers.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierHeight
The text height to be used by the identifier of section view symbols.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierColor
The color to be used for the identifier of section view symbols.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IdentifierStyleId
The id of the text style table record to be associated to section symbol identifiers.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.IsModifiedForRecompute
Indicates whether the section view style has been modified and associated section views and section view symbols need to be updated.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.Description
The description of the section view style.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.Name
The name of the section view style.