Autodesk.AutoCAD.Runtime.IMenuItem
This is class Autodesk.AutoCAD.Runtime.IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Click
This is Click, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.OnClicked(System.EventArgs)
This is OnClicked, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Items
This is Items, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Icon
This is Icon, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Checked
This is Checked, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Visible
This is Visible, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Enabled
This is Enabled, a member of class IMenuItem.

Autodesk.AutoCAD.Runtime.IMenuItem.Text
This is Text, a member of class IMenuItem.