Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction
This wraps the ObjectARX AcDbAssocObjectPointer template.

Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction.#ctor(Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody)
Constructor.
dependencyBodyBeingEvaluated:  The action that is just being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction.#ctor(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Constructor.
dependencyBeingEvaluated:  The action that is just being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction.#ctor(Autodesk.AutoCAD.DatabaseServices.AssocActionBody)
Constructor.
actionBodyBeingEvaluated:  The action that is just being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction.#ctor(Autodesk.AutoCAD.DatabaseServices.AssocAction)
Constructor.
actionBeingEvaluated:  The action that is just being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction.GetDBObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
GetDBObject.
objectId:  ObjectId of the object that should be opened.
openMode:  ForRead, ForWrite, ForNotify.
openErased:  Opens the object even if it is erased.
openOnLockedLayer:  Opens the object even on the locked layer.

Autodesk.AutoCAD.DatabaseServices.AssocObjectTransaction.IsSubstituteObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Indicates whether there is a substitute object.
dbObject:  Object for which it finds out whether there is a substitute object.