Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder
Used to build the BlendOptions.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.ToBlendOptions
Returns the generated BlendOptions.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.DriveMode
Gets and sets the driveMode option.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.CoplanarDirection
Gets and sets the coplanar direction option.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.CoplanarPoint
Gets and sets the coplanar point option.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.Quality
Gets and sets the quality option.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.Solid
Gets and sets the solid option.

Autodesk.AutoCAD.DatabaseServices.BlendOptionsBuilder.Simplify
Gets and sets the simplify option.