Autodesk.AutoCAD.DatabaseServices.BeginInsertEventArgs
This class provides data for the BeginInsert event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginInsertEventArgs.From
Gets the database being inserted.