Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
This wraps the ObjectARX AcDbAssocSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocSurfaceActionBody::AcDbAssocSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.ResultingSurfaceDep(System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocSurfaceActionBody::resultingSurfaceDep() method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.ResultingSurfaceDep(System.Boolean)
This wraps the ObjectARX AcDbAssocSurfaceActionBody::resultingSurfaceDep() method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.SetResultingSurface(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This wraps the ObjectARX AcDbAssocSurfaceActionBody::setResultingSurface() method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.EvaluateOverride
This wraps the ObjectARX AcDbAssocSurfaceActionBody::evaluateOverride() method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.FindActionsThatAffectedTopologicalSubentity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARX AcDbAssocSurfaceActionBody::findActionsThatAffectedTopologicalSubentity(); method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.IsSemiAssociative
This wraps the ObjectARXAcDbAssocSurfaceActionBody::isSemiAssociative( ) method.

Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody.ResultingSurface
This wraps the ObjectARX AcDbAssocSurfaceActionBody::resultingSurface() andAcDbAssocSurfaceActionBody::setResultingSurface ()methods.