Autodesk.AutoCAD.ComponentModel.ITypeDescriptor
This interface is implemented by TypeDescriptor and provides facilities for adding/removing PropertyDescriptors and IPropertyProviders.

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.ModifyPropertyCollection(System.ComponentModel.PropertyDescriptorCollection,System.Object)
Returns the final collection of all property descriptors including per-instance props.
defaultProps:  Input default properties.
instance:  Input instance of object.

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.AddProperty(System.ComponentModel.PropertyDescriptor)
Adds the property with the prop description.
prop:  Input the property descriptor.

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.RemoveProperty(System.ComponentModel.PropertyDescriptor)
Removes the Property.
prop:  Input property to remove

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.GetPerInstancePropertyProviders
Returns the per-instance property providers as a read-only collection.

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.AddPerInstancePropertyProvider(Autodesk.AutoCAD.ComponentModel.IPropertyProvider)
Adds the per instance property.
pp:  Input item to obtain properties from

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.RemovePerInstancePropertyProvider(Autodesk.AutoCAD.ComponentModel.IPropertyProvider)
Removes the specified PerInstancePropertyProvider object.
pp:  Input per-instance property to remove

Autodesk.AutoCAD.ComponentModel.ITypeDescriptor.HasPerInstancePropertyProviders
Assesses of per-instance property providers exists or not.