Autodesk.AutoCAD.DatabaseServices.AssocNetwork
The AssocNetwork class keeps a network of AssocActions.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.AddAction(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Adds an AssocAction to be owned by this network. The action being added must not be owned by any network. Every action except for the topmost AssocNetwork is "logically" owned by a single AssocNetwork.
The network becomes the "logical" owner of the action. It may also become the "physical" database owner of the action (the network has hard-ownership id of the action), but the "physical" owner may be some other object. For example, for networks attached to BlockTableRecords, the "logical" owner is the top-level network of the whole database but the "physical" database owner is the subdictionary of the extension dictionary of the AcBdBlockTableRecord.
actionId:  AssocAction being added to the network.
alsoSetAsDatabaseOwner:  Make this network the database owner of the action.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.RemoveAction(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Removes an AssocAction from the network and optionally erases it. The action being removed must be owned by this network.
actionId:  AssocAction being removed from the network.
alsoEraseIt:  Erase the action after removing it.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.AddActions(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
Adds the given AssocActions to be owned by this network. The actions being added must not be owned by any network.
The network becomes the "logical" owner of the action. It may also become the "physical" database owner of the actions (the network has hard-ownership id of the actions), but the "physical" owner may be some other object. For example, for networks attached to BlockTableRecords, the "logical" owner is the top-level network of the whole database but the "physical" database owner is the subdictionary of the extension dictionary of the BlockTableRecord.
actionIds:  AssocActions being added to the network.
alsoSetAsDatabaseOwner:  Make this network the database owner of the actions.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.RemoveAllActions(System.Boolean)
Removes all AssocActions from the network and optionally erases them. The network will become empty.
alsoEraseThem:  Erase the actions after removing them.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.OwnedActionStatusChanged(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
This callback is called from AssocAction.SetStatus(..., true) and notifies the network owing the action that the status of the action has just been changed.
ownedAction:  The action whose status has just been changed.
previousStatus:  Previous status of the action.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.GetInstanceFromDatabase(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean,System.String)
Returns ObjectId of the AssocNetwork owned by the given database, optionally creating a new one if it does not exist yet. Returns ObjectId::Null if the network cannot be obtained.
The network is owned by a special sub-dictionary owned by the named object dictionary of the database.
database:  Database owning the network.
createIfDoesNotExist:  If it does not exist yet, create a new subdictionary under the named object dictionary of the database. Create an AssocNetwork and make it owned by this newly created subdictionary.
dictionaryKey:  The name of the sub-dictionary under which the network belongs. If no key name is given, the default "ACAD_ASSOCNETWORK" key is used.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.GetInstanceFromObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean,System.String)
Returns ObjectId of the AssocNetwork owned by the extension dictionary of the given DBObject, optionally creating a new one if it does not exist yet. Returns ObjectId.Null if the network cannot be obtained.
The network is owned by a special sub-dictionary owned by the extension dictionary of the given object.
owningObjectId:  The Object owning the sub-dictionary that owns the AssocNetwork.
createIfDoesNotExist:  If it does not exist yet, create a new subdictionary of the extension dictionary of the object. Create an AssocNetwork and make it owned by this newly created subdictionary.
addToTopLevelNetwork:  If the network is newly created, it also adds it to the the top-level network of the database that owns the owningObjectId. It has no effect if the network already exists or if createIfDoesNotExist is false.
dictionaryKey:  The name of the sub-dictionary under which the network belongs. If no key name is given, the default "ACAD_ASSOCNETWORK" key is used.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.RemoveInstanceFromObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.String)
Removes the network and the sub-dictionary that owns it from the extension dictionary of the object.
owningObjectId:  The DBObject whose extension dictionary owns the sub-dictionary that owns the AssocNetwork.
alsoEraseIt:  Erase the network after removing it.
dictionaryKey:  The name of the sub-dictionary under which the network belongs. If no key name is given, the default "ACAD_ASSOCNETWORK" key is used.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.RemoveInstanceFromDatabase(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean,System.String)
Removes the network and the sub-dictionary that owns it from the named object dictionary of the database.
alsoEraseIt:  Erase the network after removing it.
dictionaryKey:  The name of the sub-dictionary under which the network belongs. If no key name is given, the default "ACAD_ASSOCNETWORK" key is used.
owningObjectId:  The database whose named object dictionary owns the sub-dictionary that owns the AssocNetwork.

Autodesk.AutoCAD.DatabaseServices.AssocNetwork.GetActions
Gets the reference to the *internal* array of ObjectIds of all owned AssocActions.