Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback
Client needs to implement this callback to provide constraint priorities and priority override for autconstraint evaluation.

Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.GetConstraintPriorityOverride(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.ConstraintType,Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[])
This function will be called when the system finds a possible constraint between a given set of constrained geometries.
type:  Geometric constraint type that is possible between given set of constrained geometry.
geometries:  List of constrained geometry, which are potential candidate for provided constraint type. User may

Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.GetAutoConstrainPriority
Defines the order in which constraint types can be used for autoConstrain.
constraintList:  List of constraint types to be considered for autoConstrain in decending order of priority. Constraint type not present in the list will not be considered for autoconstraint.

Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.GetTotalConstraints(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&)
Returns a list of constraints found by autoconstraint evaluation.
constraints:  reference to array of constraints, to return list of constraints found by autoconstraint evaluation. This parameter can be null if caller doesn't want list of constraints.

Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.IsEvaluationCancelled
Indicates whether the evaluation was canceled by the caller.