Autodesk.AutoCAD.Geometry.Curve3dCollection
This class represents a collection of Curve3d objects.

Autodesk.AutoCAD.Geometry.Curve3dCollection.#ctor
Constructor.

Autodesk.AutoCAD.Geometry.Curve3dCollection.GetEnumerator
Returns an enumerator for this collection.

Autodesk.AutoCAD.Geometry.Curve3dCollection.RemoveAt(System.Int32)
This function removes the item at the given index if one exists.
index:  Input index of item to remove

Autodesk.AutoCAD.Geometry.Curve3dCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Geometry.Curve3dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Curve3d[],System.Int32)
Copies the elements of this collection into the provided array starting at the given index.
array:  Input array to copy to
index:  Input index to begin copying from

Autodesk.AutoCAD.Geometry.Curve3dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Curve3d)
Inserts value in to the collection, at the index specified by index.
index:  Input index to insert at
value:  Input item to insert

Autodesk.AutoCAD.Geometry.Curve3dCollection.Remove(Autodesk.AutoCAD.Geometry.Curve3d)
This function removes value from the collection if it exists.
value:  Input item to remove

Autodesk.AutoCAD.Geometry.Curve3dCollection.Contains(Autodesk.AutoCAD.Geometry.Curve3d)
Returns a Boolean indicating whether value is contained in this collection.
value:  Input value to check for

Autodesk.AutoCAD.Geometry.Curve3dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Curve3d)
Finds the index of an item in the collection based on value.
value:  Input value to retrieve index

Autodesk.AutoCAD.Geometry.Curve3dCollection.Add(Autodesk.AutoCAD.Geometry.Curve3d)
Adds a curve to this collection.
value:  Input item to add

Autodesk.AutoCAD.Geometry.Curve3dCollection.IsReadOnly
Returns true if Curve3dCollection is read-only; otherwise false.

Autodesk.AutoCAD.Geometry.Curve3dCollection.IsFixedSize
Returns true if Curve3dCollection has fixed size; otherwise false.

Autodesk.AutoCAD.Geometry.Curve3dCollection.Count
Returns the number of objects in this collection.