Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition
This class contains the data returned by the NurbSurface.GetDefinition method.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.IsEqualTo(Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition)
Compares this object to a and returns true if they are equal.
a:  Input object to compare against

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.op_Inequality(Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition,Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.op_Equality(Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition,Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInV
Returns V dimension of control array.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInU
Returns U dimension of control array.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.PropertiesInV
Returns the PropertiesInV property value.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.PropertiesInU
Returns the PropertiesInU property value.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.DegreeInV
Return V degree of surface.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.DegreeInU
Return U degree of surface.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.VKnots
Computes array of the V knots.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.UKnots
Computes array of the U knots.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.Weights
Computes array of the weights.

Autodesk.AutoCAD.Geometry.NurbSurfaceDefinition.ControlPoints
Computes array of surface's control points.