Autodesk.AutoCAD.Runtime.WrapperAttribute
This class defines an attribute that identifies the corresponding wrapped ObjectARX class or member.

Autodesk.AutoCAD.Runtime.WrapperAttribute.#ctor(System.String)
Constructor.
wrappedClass:  Input.

Autodesk.AutoCAD.Runtime.WrapperAttribute.WrappedClass
Returns the WrappedClass property value.