Autodesk.AutoCAD.DatabaseServices.Polyline3d
This .NET class wraps the AcDb3dPolyline ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.ConvertToPolyType(Autodesk.AutoCAD.DatabaseServices.Poly3dType)
Uses the SplineFit() method to convert the polyline to the type specified by the type argument value.
newVal:  Input type to which the polyline should be converted

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Straighten
Removes all spline and curve-fit vertices from the polyline or mesh and sets all remaining vertices to be simple vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.SplineFit
Removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
Appends the PolylineVertex3d object pointed to by vertexToAppend to the vertex list of the polyline and establishes the polyline as the vertex's owner.
vertexToAppend:  Input pointer to the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
Inserts the PolylineVertex3d object pointed to by newVertex into the vertex list of the polyline just after the PolylineVertex3d object pointed to by indexVertexId and establishes the polyline as the vertex's owner.
indexVertexId:  Input vertex in polyline after which the new vertex is to be inserted
newVertex:  Input vertex to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
Inserts the PolylineVertex3d object pointed to by newVertex into the vertex list of the polyline just after the PolylineVertex3d object with objectId indexVertId, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
indexVertex:  Input objectId of the vertex in the polyline after which the new vertex is to be inserted
newVertex:  Input vertex to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline3d.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Length
Accesses the total length of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.PolyType
Accesses the Poly3dType, which indicates the spline-fit type for this 3D polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.Closed
Assesses if the polyline to be closed.