Autodesk.AutoCAD.GraphicsSystem.StereoParameters
This class is a container for the GraphicsSystem.View.StereoParameters properties.

Autodesk.AutoCAD.GraphicsSystem.StereoParameters.#ctor(System.Double,System.Double)
Constructs an object with set values.
magnitude:  Input magnitude of view separation
parallax:  Input parallax

Autodesk.AutoCAD.GraphicsSystem.StereoParameters.Parallax
Returns the current parallax.

Autodesk.AutoCAD.GraphicsSystem.StereoParameters.Magnitude
Returns magnitude of view separation.