Autodesk.AutoCAD.DatabaseServices.LinkedData
This .NET class wraps the AcDbLinkedData ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LinkedData.Clear
Deletes the data.

Autodesk.AutoCAD.DatabaseServices.LinkedData.Name
Accesses the name of the data.

Autodesk.AutoCAD.DatabaseServices.LinkedData.IsEmpty
Assesses whether the object has data or not.