Autodesk.AutoCAD.Geometry.LinearEntity3d
This .NET class wraps the AcGeLinearEnt3d ObjectARX class.

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls LinearEntity3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input any planar entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line intersects input plane and if so returns their intersection point.
plane:  Input any planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls LinearEntity3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines intersect and if so returns their intersection point.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls LinearEntity3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.LinearEntity3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the two lines which project into the same point when projected onto a plane whose normal is projectionDirection.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls LinearEntity3d.Overlap(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.Overlap(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines overlap and if so returns the line that coincides with their region of overlap.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsOn(Autodesk.AutoCAD.Geometry.Plane)
This method calls LinearEntity3d.IsOn(Plane plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input any plane

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsOn(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line lies on input plane.
plane:  Input any plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls LinearEntity3d.IsParallelTo(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input any planar entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line is parallel to input plane.
plane:  Input any planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls LinearEntity3d.IsParallelTo(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are parallel.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
Determines if two lines are perpendicular.
plane:  Input any planar entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if line is perpendicular to input plane.
plane:  Input any planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls LinearEntity3d.IsPerpendicularTo(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are perpendicular.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls LinearEntity3d.IsColinearTo(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.LinearEntity3d.IsColinearTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if two lines are colinear.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.LinearEntity3d.GetPerpendicularPlane(Autodesk.AutoCAD.Geometry.Point3d)
Returns a plane that is perpendicular to this line and passes through the input point.
intersectionPoint:  Input any 3D point

Autodesk.AutoCAD.Geometry.LinearEntity3d.GetLine
Returns an infinite line that is coincident with this line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.Direction
Returns direction vector of line.

Autodesk.AutoCAD.Geometry.LinearEntity3d.PointOnLine
Returns an arbitrary point on the line.