Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord
This .NET class wraps the AcDbAbstractViewTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the UCS for the view or viewport table record.
id:  Input the object which references a UcsTableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
This function sets the UCS for the view or viewport table record.
view:  Input the object for the UCS view

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the UCS for the view or viewport table record.
origin:  Input the object to act as an origin
y:  Input the object to act as a Y-coordinate

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcsToWorld
Sets the UCS for the view or viewport table record to the world UCS.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetViewDirection(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the view direction of the view or view table record to the specified orthographic view (relative to UCSBASE).
view:  Input the orthographic view

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ToneOperatorParameters
Accesses the tone operator parameters for this view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.VisualStyleId
Accesses the object ID of the visual style in effect for this viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Background
Accesses the background associated with this view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ViewOrthographic
Accesses the orthographic view from the view's target to the view's camera.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Elevation
Accesses the elevation of the UCS plane for the view or viewport table record.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.UcsName
Accesses the name of the UCS.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.UcsOrthographic
Accesses the orthographic view associated with the UCS.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Ucs
Accesses the UCS for the view or viewport table record.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SunId
Accesses the object id associated as a sun object with this viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.AmbientLightColor
Accesses the ambient light color for the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Contrast
Accesses the contrast factor for the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Brightness
Accesses the brightness factor for this viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.DefaultLightingType
Accesses the type of default lighting being used in the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.DefaultLightingOn
Accesses the state of default lighting for the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.FrontClipAtEye
Accesses the front clipping plane for perspective views.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.BackClipEnabled
If set to true, the back clipping is On for TableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.FrontClipEnabled
If set to true, the front clipping is On in the TableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.PerspectiveEnabled
If true, this function sets perspective mode to On in the TableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.BackClipDistance
Accesses the distance (along the camera-target line) from the target to the back clipping plane.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.FrontClipDistance
Accesses the value of the distance (along the camera-target line) from the target to the front clipping plane.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.LensLength
Accesses the lens length when perspective mode is on in the TableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ViewTwist
Accesses the twist angle (in radians) of the view in the viewport.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.ViewDirection
Accesses the vector (in WCS coordinates) from the view's target to the view's camera.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Target
Accesses the location of the view's target, in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Width
Accesses the width of the view in DCS coordinates.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.Height
Accesses the TableRecord height (in DCS coordinates) as the height of the view.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.CenterPoint
Accesses the center point of the view in DCS coordinates.