Autodesk.AutoCAD.DatabaseServices.TextEditorColumn
This wraps the ObjectARX AcDbTextEditorColumn class.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumn.Height
Gets and sets the height of the column object.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumn.EndOfText
This wraps the ObjectARX AcDbTextEditorColumn::endOfText() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumn.StartOfText
This wraps the ObjectARX AcDbTextEditorColumn::startOfText() method.