Autodesk.AutoCAD.DatabaseServices.AssocFaceActionParam
This wraps the ObjectARX AcDbAssocFaceActionParam class.

Autodesk.AutoCAD.DatabaseServices.AssocFaceActionParam.#ctor
This wraps the ObjectARX AcDbAssocFaceActionParam::AcDbAssocFaceActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocFaceActionParam.GetFaceRef
This wraps the ObjectARX AcDbAssocFaceActionParam::getFaceRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocFaceActionParam.SetFaceRef(Autodesk.AutoCAD.DatabaseServices.FaceRef,System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocFaceActionParam::setFaceRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocFaceActionParam.SetFaceRef(Autodesk.AutoCAD.DatabaseServices.FaceRef)
This wraps the ObjectARX AcDbAssocFaceActionParam::setFaceRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocFaceActionParam.DependentOnCompoundObject
This wraps the ObjectARX AcDbAssocFaceActionParam::getDependentOnCompoundObject() method.