Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord
This .NET class wraps the AcDbSymbolTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.IsResolved
Returns true if the SymbolTableRecord is part of an xref which has been successfully "resolved" (loaded into the drawing).

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.IsDependent
Returns true when the SymbolTableRecord is a dependent (that is, part of) of an attached xref drawing; otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord.Name
Returns the name of the symbol table record.