Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator
This .NET class wraps the AcDbPlotSettingsValidator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotConfigurationName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String,System.String)
Specifies a system printer or PC3 file containing the "how to plot" information.
plotSet:  Input PlotSettings object
plotDeviceName:  Input pointer to plot device name
mediaName:  Input media name

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCanonicalMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Sets a locale-independent identifier for a specific media size.
plotSet:  Input
mediaName:  Input pointer to canonical media name

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotOrigin(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.Geometry.Point2d)
Sets the plot origin offset that is applied inside of the paper margins.
plotSet:  Input PlotSettings object
origin:  Input offset coordinates

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotPaperUnits(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit)
Sets the units for plotting using the enumeration PlotPaperUnits.
plotSet:  Input PlotSettings object
units:  Input units by which the margins, offset, and paper size are interpreted

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotRotation(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotRotation)
Sets the rotation of the plot on the paper.
plotSet:  Input PlotSettings object
rotationType:  Input enumeration indicating rotation

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotCentered(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Sets whether the plot will be centered.
If true, the paper margins are automatically computed to position the plot in the center of the sheet.
plotSet:  Input PlotSettings object
isCentered:  Input Boolean indicating whether the plot should be centered

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotType(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.PlotType)
Specifies the area of the model to output to the media.
plotSet:  Input PlotSettings object
plotAreaType:  Input enumeration indicating the portion of the layout to plot

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotWindowArea(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.Extents2d)
Specifies the two points in which define the area to be output to the specified media.
plotSet:  Input PlotSettings object
windowArea:  Input window coordinates (coordinates must be in DCS)

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetPlotViewName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Specifies the named view that in which defines the area of the model to output.
plotSet:  Input PlotSettings object
viewName:  Input named view indicating the portion of the model to plot

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetUseStandardScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Determines whether the layout will use the StdScaleType property to calculate the current plot scale.
The UseStandardScale property indicates whether the StdScaleType property is used to compute the scale of the plot. If true, the CustomPrintScale property reflects the computed scale corresponding to the StdScaleType. If false, the CustomPrintScale property and the StdScaleType properties are unrelated, and only the CustomPrintScale property is valid.
In other words, the CustomPrintScale property always reflects the current scale used to plot, regardless of whether it was computed based on a standard scale or was specified directly by the user. The UseStandardScale property indicates how the CustomPrintScale was obtained (by calculating it from a standard scale, including scale-to-fit, or by the user specifying it directly). The StdScaleType property always has a value, but is only used to compute the CustomPrintScale when the UseStandardScale property is true.
plotSet:  Input
useStandard:  Input Boolean indicating whether to use standard scale

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCustomPrintScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.CustomScale)
This method sets the custom scale, a ratio of paperspace units to media units.
plotSet:  Input
scale:  Input paperspace units

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetCurrentStyleSheet(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
This method is used to set a specific plot style table on a layout.
plotSet:  Input
styleSheetName:  Input pointer to plot style table name

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetStdScaleType(Autodesk.AutoCAD.DatabaseServices.PlotSettings,Autodesk.AutoCAD.DatabaseServices.StdScaleType)
Sets the standard scale from a value in the enumerated type StdScaleType.
plotSet:  Input plot set
scaleType:  Input standard scale

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetStdScale(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Double)
Sets the standard scale value as a floating point scale.
plotSet:  Input
standardScale:  Input standard scale value

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetPlotDeviceList
Returns a collection of all available plot devices found on the system This list is built only once per AutoCAD session.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetCanonicalMediaNameList(Autodesk.AutoCAD.DatabaseServices.PlotSettings)
Returns all available canonical media names available for the plot device configured on the PlotSettings object pointed to by plotSet.
plotSet:  Input pointer to PlotSettings object

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetPlotStyleSheetList
Returns an array of all available plot style tables found on the system This list is built only once per AutoCAD session.

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Int32)
Given an index into the canonical media name list returned by GetCanonicalMediaNameList(), returns the localized version of the media name at the index.
plotSet:  Input
index:  Input index into collection returned by GetCanonicalMediaNameList()

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.String)
Given the canonical (locale-independent) representation for a given media name, returns the localized version.
plotSet:  Input
canonicalName:  Input locale independent media name identifier (item type returned by GetCanonicalMediaNameList())

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetClosestMediaName(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.PlotPaperUnit,System.Boolean)
For the configured plot device, sets the closest matching media size on the given PlotSettings object using the input criteria.
This function is not implemented.
plotSet:  _nt_
paperWidth:  _nt_
paperHeight:  _nt_
units:  _nt_
matchPrintableArea:  _nt_

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.RefreshLists(Autodesk.AutoCAD.DatabaseServices.PlotSettings)
Rebuilds the plot, canonical media, and plot style table arrays to reflect the current system state.
plotSet:  Input

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetZoomToPaperOnUpdate(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
Sets a flag on an Layout object to indicate that a zoom to the associated paper image represented by the underlying Layout be performed if the paper receives update notification. An update notification can occur in a number of ways, but the most explicit is to call the UpdateCurrentPaper() method on the Layout Manager. It doesn't get notification, however, merely by setting attributes on the Layout object.
plotSet:  Input
doZoom:  Input Boolean indicating whether to zoom

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetDefaultPlotConfig(Autodesk.AutoCAD.DatabaseServices.PlotSettings)
Sets default plot configuration values on the given PlotSettings object pointed to by plotSet.
plotSet:  Input

Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.Current
Accesses the current item.