Autodesk.AutoCAD.DatabaseServices.ObjectClosedEventArgs
This is class Autodesk.AutoCAD.DatabaseServices.ObjectClosedEventArgs.

Autodesk.AutoCAD.DatabaseServices.ObjectClosedEventArgs.Id
This is Id, a member of class ObjectClosedEventArgs.