Autodesk.AutoCAD.DatabaseServices.MLeader
This .NET class wraps the AcDbMLeader ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MLeader.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetPlane
Return the WCS plane which the MLeader resides on.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetPlane(Autodesk.AutoCAD.Geometry.Plane)
Sets the plane that will contain the MLeader object.
value:  Input desired plane within which the MLeader will reside.

Autodesk.AutoCAD.DatabaseServices.MLeader.MoveMLeader(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.MoveType)
Moves MLeader according to the vector.
vec:  Input vector indicate direction and distance the MLeader will be moved.
type:  Input MoveType indicate how the MLeader will be moved.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetContentGeomExtents
Gets the extents of content in this MLeader object.

Autodesk.AutoCAD.DatabaseServices.MLeader.AddLeader
Adds a new leader cluster to this MLeader object.

Autodesk.AutoCAD.DatabaseServices.MLeader.RemoveLeader(System.Int32)
Removes the leader cluster with specified index.
index:  Input the index of the leader to be removed.

Autodesk.AutoCAD.DatabaseServices.MLeader.AddLeaderLine(Autodesk.AutoCAD.Geometry.Point3d)
Adds a new leader line to this MLeader object.
point:  Input position of the first(head) vertex of the new leader line.

Autodesk.AutoCAD.DatabaseServices.MLeader.AddLeaderLine(System.Int32)
Adds a leaderline to the leader cluster with specified index.
leaderIndex:  Index of the leader cluster.

Autodesk.AutoCAD.DatabaseServices.MLeader.RemoveLeaderLine(System.Int32)
Removes the leader line with specified index.
leaderLineIndex:  Input the index of leader cluster.

Autodesk.AutoCAD.DatabaseServices.MLeader.AddFirstVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Inserts a vertex to the leader line with specified index as new leader head.
leaderLineIndex:  Input index of the leader line.
point:  Input the vertex position.

Autodesk.AutoCAD.DatabaseServices.MLeader.RemoveFirstVertex(System.Int32)
Removes the head of the leader line with specified index.
leaderLineIndex:  Input leader line index.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetFirstVertex(System.Int32)
Gets head point of specified leader line.
leaderLineIndex:  Input leader line index.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetFirstVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets the leader head with specified point.
leaderLineIndex:  Input the leader line index.
point:  Input the point where the new leader head is on.

Autodesk.AutoCAD.DatabaseServices.MLeader.AddLastVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Appends a vertex to the specified leader line as the new leader tail.
leaderLineIndex:  Input leader line index.
point:  Input the vertex position.

Autodesk.AutoCAD.DatabaseServices.MLeader.RemoveLastVertex(System.Int32)
Removes the leader tail of specified leader line.
leaderLineIndex:  Input leader line index.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLastVertex(System.Int32)
Gets the tail vertex position of specified leader line.
leaderLineIndex:  Input leader line index.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetLastVertex(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets leader tail with specified point.
leaderLineIndex:  Input the leader line index.
point:  Input the point where the new leader tail is on.

Autodesk.AutoCAD.DatabaseServices.MLeader.VerticesCount(System.Int32)
Returns the number of vertices on a leader line.
leaderLineIndex:  Input leader line index.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetVertex(System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets the vertex with specified index in the leader line with a new position specified by point.
leaderLineIndex:  Input leader line index.
index:  Input the index of vertex.
point:  Input the new position of this vertex.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetVertex(System.Int32,System.Int32)
Gets position of the vertex with specified index in the leader line with a new position specified by point.
leaderLineIndex:  Input leader line index.
index:  Input index of the vertex.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderIndex(System.Int32)
Gets the index of leader cluster which the specified leader line is in.
leaderLineIndex:  Input leader line index.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderLineIndexes(System.Int32)
Gets the indexes of leaderlines of the specific leader.
leaderIndex:  Input leader index.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetDogleg(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the dog-leg in the leader cluster specified by leaderIndex with vector.
leaderIndex:  Input leader index.
vector:  Input the vector represents the new length and new direction of dog-leg.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetDogleg(System.Int32)
Gets the dog-leg in the leader cluster specified by leaderIndex.
leaderIndex:  Input leader index.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetLeaderLineType(System.Int32,Autodesk.AutoCAD.DatabaseServices.LeaderType)
This is SetLeaderLineType, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderLineType(System.Int32)
This is GetLeaderLineType, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetLeaderLineColor(System.Int32,Autodesk.AutoCAD.Colors.Color)
This is SetLeaderLineColor, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderLineColor(System.Int32)
This is GetLeaderLineColor, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetLeaderLineTypeId(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This is SetLeaderLineTypeId, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderLineTypeId(System.Int32)
This is GetLeaderLineTypeId, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetLeaderLineWeight(System.Int32,Autodesk.AutoCAD.DatabaseServices.LineWeight)
This is SetLeaderLineWeight, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderLineWeight(System.Int32)
This is GetLeaderLineWeight, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetDoglegLength(System.Int32,System.Double)
Set the length of doglegs in the leader cluster specified by leaderIndex.
leaderIndex:  Input leader index
doglegLength:  Input the length of dog-leg leader line

Autodesk.AutoCAD.DatabaseServices.MLeader.GetDoglegLength(System.Int32)
Gets the length of doglegs in the leader cluster specified by leaderIndex.
leaderIndex:  Input leader index

Autodesk.AutoCAD.DatabaseServices.MLeader.SetArrowSymbolId(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the arrow head symbol id for the specific leaderline.
leaderLineIndex:  Input the index of the specific leaderline.
id:  Input the object id of the arrow head symbol.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetArrowSymbolId(System.Int32)
Returns the object id of the arrow head symbol of the specific leaderline.
leaderLineIndex:  Input the index of the specific leaderline.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetArrowSize(System.Int32,System.Double)
This is SetArrowSize, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetArrowSize(System.Int32)
This is GetArrowSize, a member of class MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetTextAttachmentType(Autodesk.AutoCAD.DatabaseServices.LeaderDirectionType)
Returns text attachment type of MText in MLeader content.
leaderDirection:  Input text leader direction type

Autodesk.AutoCAD.DatabaseServices.MLeader.SetContextDataManager(System.IntPtr)
Sets the context data manager to MLeader.
contextDataManager:  Input the pointer of context data manager.

Autodesk.AutoCAD.DatabaseServices.MLeader.getContextDataManager
Returns the context data manager in MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.HasContent
Returns true if MLeader has content; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.MLeader.recomputeBreakPoints
Recalculates the dim break point.

Autodesk.AutoCAD.DatabaseServices.MLeader.PostMLeaderToDb(Autodesk.AutoCAD.DatabaseServices.Database)
Adds current MLeader object to the modal space of input database.
db:  Input database into which the current MLeader object should be added.

Autodesk.AutoCAD.DatabaseServices.MLeader.ConnectionPoint(Autodesk.AutoCAD.Geometry.Vector3d)
Gets the leader connection point of the specific direction.
direction:  Input the specific direction.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetBlockAttribute(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets attribute in block content determined by attribute definition id.
attDefId:  Input attribute definition id.

Autodesk.AutoCAD.DatabaseServices.MLeader.SetBlockAttribute(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.AttributeReference)
Set attribute in block content with attribute definition id.
attDefId:  Input attribute definition id.
attributeValue:  Input attribute value.

Autodesk.AutoCAD.DatabaseServices.MLeader.GetLeaderIndexes
Gets the indexes of leaders.

Autodesk.AutoCAD.DatabaseServices.MLeader.ExtendLeaderToText
Gets and Sets the value indicating whether horizontal leader lines are automatically extended to text.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextAttachmentDirection
Accesses the value of the text attachment Direction of MText content.

Autodesk.AutoCAD.DatabaseServices.MLeader.MText
Accesses the cloned MText.

Autodesk.AutoCAD.DatabaseServices.MLeader.ToleranceLocation
Accesses the location of MLeader tolerance content.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextLocation
Accesses the location of MLeader MText content.

Autodesk.AutoCAD.DatabaseServices.MLeader.BlockPosition
Accesses the position of MLeader block content.

Autodesk.AutoCAD.DatabaseServices.MLeader.MLeaderStyle
Accesses the object ID of current MLeader style.

Autodesk.AutoCAD.DatabaseServices.MLeader.EnableAnnotationScale
Assesses if annotation scale is enabled.

Autodesk.AutoCAD.DatabaseServices.MLeader.BlockConnectionType
Accesses how the block is connected with leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeader.BlockRotation
Accesses the rotation of referenced block.

Autodesk.AutoCAD.DatabaseServices.MLeader.BlockScale
Accesses the scale of referenced block.

Autodesk.AutoCAD.DatabaseServices.MLeader.BlockColor
Accesses the block color in block content.

Autodesk.AutoCAD.DatabaseServices.MLeader.BlockContentId
Accesses the id of referenced block.

Autodesk.AutoCAD.DatabaseServices.MLeader.EnableFrameText
Assesses if text frame of MText is visible.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextHeight
Accesses the text height of MText in MLeader content.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextColor
Accesses the text color of Mtext in MLeader content.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextAlignmentType
Accesses the text alignment type of Mtext in MLeader content.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextAngleType
Accesses the angle type of text with respect to the last leader line segment.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextAttachmentType
Accesses the text attachment type of MText in MLeader content.

Autodesk.AutoCAD.DatabaseServices.MLeader.TextStyleId
Accesses the objectId of current text style.

Autodesk.AutoCAD.DatabaseServices.MLeader.ContentType
Accesses the content type of MLeader object.

Autodesk.AutoCAD.DatabaseServices.MLeader.ArrowSize
Accesses the arrow size.

Autodesk.AutoCAD.DatabaseServices.MLeader.ArrowSymbolId
Accesses the objectId of current arrow symbol.

Autodesk.AutoCAD.DatabaseServices.MLeader.DoglegLength
Accesses the length of dog-leg leader line.

Autodesk.AutoCAD.DatabaseServices.MLeader.EnableDogleg
Assesses if dog-leg leader line is enabled.

Autodesk.AutoCAD.DatabaseServices.MLeader.EnableLanding
Assesses whether landing of leader line is enabled.

Autodesk.AutoCAD.DatabaseServices.MLeader.LandingGap
Accesses the gap between leader tail and MText.

Autodesk.AutoCAD.DatabaseServices.MLeader.LeaderLineWeight
Accesses the line weight of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeader.LeaderLineTypeId
Accesses the objectId of leader line type.

Autodesk.AutoCAD.DatabaseServices.MLeader.LeaderLineColor
Accesses the color of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeader.LeaderLineType
Accesses the leader line type.

Autodesk.AutoCAD.DatabaseServices.MLeader.LeaderLineCount
Accesses the number of leader lines.

Autodesk.AutoCAD.DatabaseServices.MLeader.LeaderCount
Accesses the number of leaders.

Autodesk.AutoCAD.DatabaseServices.MLeader.Scale
Gets or sets the scale for the MLeader.

Autodesk.AutoCAD.DatabaseServices.MLeader.Normal
Accesses the unit normal vector (in WCS coordinates) of the plane that contains the leader.