Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE
AcRx protocol extension pure virtual base class that defines protocol to get and set arbitrary simple scalar values of DBObjects.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.#ctor
Default Constructor.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.CanGetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Checks whether it is possible to get the value identified by valueName.
valueName:  The name of the queried value.
object:  The object must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.CanSetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Checks whether it is possible to set the value identified by valueName.
valueName:  The name of the queried value.
object:  The object must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.GetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Gets the value identified by valueName.
valueName:  The name of the queried value.
object:  The object must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocValueProviderPE.SetValue(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String,Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Sets the value identified by valueName.
valueName:  The name of the value to be set.
newValue:  The new value.
object:  The object must be open for write.