Autodesk.AutoCAD.DatabaseServices.DbHomeView
This .NET class wraps the AcDbHomeView ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.ToggleDefaultSettings
Fills the members of this class with default settings.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Equals(System.Object)
Returns true if the two objects are equal.
obj:  Input object to compare against

Autodesk.AutoCAD.DatabaseServices.DbHomeView.op_Equality(Autodesk.AutoCAD.DatabaseServices.DbHomeView,Autodesk.AutoCAD.DatabaseServices.DbHomeView)
Returns true if lhvm equals rhvm.
rhvw:  Right operand
lhvm:  Left operand

Autodesk.AutoCAD.DatabaseServices.DbHomeView.op_Inequality(Autodesk.AutoCAD.DatabaseServices.DbHomeView,Autodesk.AutoCAD.DatabaseServices.DbHomeView)
Returns true if lhvm does not equal rhvm.
lhvm:  Left operand
rhvw:  Right operand

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Perspective
Assesses if the view is perspective.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Height
Accesses the orthogonal height of the view.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Width
Accesses the orthogonal width of the view.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Up
Accesses the up direction of the view.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Center
Accesses the center point of the view.

Autodesk.AutoCAD.DatabaseServices.DbHomeView.Eye
Accesses the eye point of the view.