Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase
AssocDimDependencyBodyBase ties together the following objects that define a dimensional constraint:
AssocVariable Keeps dimensional constraint name and expression.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.UpdateDependentOnObjectOverride
This method needs to be overriden and implemented by derived classes.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.Constraint
Returns the corresponding dimensional constraint node.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetSubentityGeoms(Autodesk.AutoCAD.Geometry.Vector3d)
Returns all constrained subentities of Entities constrained by this dimensional constraint.
distanceDirection:  Direction of the distance constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetVariableNameAndExpression(System.String&,System.String&,System.String)
Returns name, expression and current value of the AssocVariable that corresponds to this dimensional constraint.
name:  Variable name.
expression:  Variable expression.
value:  Variable value.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetEntityNameAndExpression(System.String&,System.String&)
Returns name and expression from the text that the managed entity is displaying.
name:  Name from the managed entity display text.
expression:  Expression from the managed entity display text.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetVariableNameAndExpression(System.String,System.String)
Sets new name and expression of the AssocVariable that corresponds to this dimensional constraint.
name:  New name of the AssocVariable.
expression:  New expression of the AssocVariable.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetEntityNameAndExpression(System.String,System.String,System.String)
Sets name and expression that the managed entity should display.
name:  New name the managed entity should display.
expression:  New expression the managed entity should display.
value:  New value the managed entity should display.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetNameAndExpression(System.String,System.String)
Sets name and expression on both the AssocVariable that corresponds to this dimensional constraint and on the managed entity that serves as the graphical representation of this dimensional constraint.
name:  New name to be set.
expression:  New expression to be set.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ValidateEntityText(System.String)
Checks if the given entityTextToValidate can be used as the text the managed entity displays.
entityTextToValidate:  The entity text to check.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ComposeEntityText(System.Int32)
Composes the text that the managed entity should display.
requiredNameFormat:  The constraint name format display, deafault value if -1. If requiredNameFormat == -1, CONSTRAINTNAMEFORMAT sysvar is used for choosing the text format.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetVariableValueToMeasuredValue
Measures the current dimensional constraint based on the current positions and sizes of the constrained geometries and sets the corresponding AssocVariable to this measured value.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.DeactivateConstraint
Deactivates the constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ReactivateConstraint
Reactivates the constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetNameAndExpressionFromEntityText(System.String,System.Boolean,System.Double,System.Boolean,System.String&,System.String&)
Parses the given entityText string and extracts name and expression components from it. It is mainly for internal use.
entityText:  The string to extract name and expression from.
useMeasurementIfNoText:  Indicates whether to use measurement value if no text is given.
measurement:  The provided entity measurement.
isAngular:  Indicates that the constraint is angular.
name:  Name component extracted from entityText.
expression:  Expression component extracted from entityText.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetFromEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the AssocDimDependencyBodyBase from the dependent-on Entity, such as from the AcDbDimension it controls.
entityId:  The entity id of the dependent-on Entity, such as of an Dimension.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.EntityAttachmentPointMoved(Autodesk.AutoCAD.DatabaseServices.SubentityGeometry[],System.Double)
Updates the constraint geometry when dimension grip points are moved.
newAttachedGeometries:  The new attached geometries to be updated.
measurement:  New measurement, default value is 0.0.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.EvaluateOverride
This function sets the name and expression in the controlled entity text to be the same as the name and expression of the corresponding AssocVariable.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ModifiedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject)
If the controlled entity text changed, this function sets the name and expression of the AssocVariable to be the same as the name and expression in the entity text.
dbObj:  The controlled entity.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ErasedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
When the dependent-on object (such as an Dimension) is erased, the corresponding AssocVariable is also erased.
isErasing:  Boolean isErasing.
pDbObj:  The controlled entity.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SubErase(System.Boolean)
Overridden method from the DBObject base class. It erases the controlled entity, such as the Dimension.
erasing:  Boolean erasing.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.FormatToCurrentPrecision(System.String,System.Boolean)
Formats the given expression to current precision.
expression:  The expression to be formatted.
isAngular:  Indicates it is an angular constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SetEraseDimensionIfDependencyIsErased(System.Boolean)
Under normal circumstances the controlled Dimension object is erased if the AssocDimDependencyBodyBase is erased. This static method allows this behaviorto be suppressed, i.e., not erasing the Dimension if the AssocDimDependencyBodyBase is erased. This can be useful for the creation of reference constraints since the same dimension should be retained and used for a reference constraint later on.
yesNo:  Indicates to suppress the erase behavior or not.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetEraseDimensionIfDependencyIsErased
Under normal circumstances an associated Dimension object is erased if the AssocDimDependencyBodyBase is erased.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.IsRelevantChangeOverride
Overridden property from AssocDependencyBody base class.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetCurrentlyUsedEntityNameFormat
Gets the format that is used to display the entity name and expression by looking at the currently displayed entity text.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.IsReferenceOnly
Sets whether the constraint is reference only.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetMeasuredValue
Gets the current dimensional constraint based on the current positions and sizes of the constrained geometries.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.IsConstraintActive
Indicates whether the constraint is active.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.SubentityConstrainedGeoms
Gets all constrained subentities of Entities constrained by this dimensional constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.ConstrainedGeoms
Gets all ConstrainedGeometries constrained by this dimensional constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.Variable
Gets the object id of the corresponding AssocVariable.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.IsEntityAttachmentChangedOverride
Derived classes need to override this pure virtual read only property to inform whether the attachment of the entity they manage changed, such as whether the entity has been repositioned.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.EntityMeasurementOverride
Derived classes needs to override this pure virtual read only property to provide the current measurement of the entity they manage.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.EntityTextOverride
Derived classes needs to override this pure virtual property.