Autodesk.AutoCAD.DatabaseServices.XrefVetoableSubCommandEventArgs
This class provides data for the XrefVetoableSubCommand event.

Autodesk.AutoCAD.DatabaseServices.XrefVetoableSubCommandEventArgs.abortOp
Returns a Boolean indicating whether the operation is aborted or not.