Autodesk.AutoCAD.DatabaseServices.DwgFiler
This abstract class provides the interface for derived classes that are used for I/O operations that work with the DWG information format.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ResetFilerStatus
This interface when implemented resets the filer status.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHardOwnershipId
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHardOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadSoftOwnershipId
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteSoftOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHardPointerId
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHardPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadSoftPointerId
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteSoftPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadString
This interface, when implemented, checks filer status.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteString(System.String)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadHandle
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteHandle(Autodesk.AutoCAD.DatabaseServices.Handle)
The implementation of this function should follow that of the ObjectARX internal filers.
handle:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt64
This .NET method wraps the ObjectARX method AcDbDwgFiler::readInt64.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt64(System.Int64)
This .Net method wraps the ObjectARX method AcDbDwgFiler::writeInt64.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt32
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt32(System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadInt16
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteInt16(System.Int16)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt64
This .Net method wraps the ObjectARX method AcDbDwgFiler::readUInt64.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt64(System.UInt64)
This .Net method wraps the ObjectARX method AcDbDwgFiler::writeUInt64.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt32
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt32(System.UInt32)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadUInt16
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteUInt16(System.UInt16)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadByte
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteByte(System.Byte)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBoolean
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBoolean(System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should: check the current filer status.write out value.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadDouble
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteDouble(System.Double)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadPoint2d
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WritePoint2d(Autodesk.AutoCAD.Geometry.Point2d)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadPoint3d
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WritePoint3d(Autodesk.AutoCAD.Geometry.Point3d)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadVector2d
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteVector2d(Autodesk.AutoCAD.Geometry.Vector2d)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadVector3d
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteVector3d(Autodesk.AutoCAD.Geometry.Vector3d)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadScale3d
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteScale3d(Autodesk.AutoCAD.Geometry.Scale3d)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBytes(System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers.
value:  A pre-allocated memory area to read bytes into

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBytes(System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadBinaryChunk
A BChunk is stored as a length (a short) followed by its data.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteBinaryChunk(System.Byte[])
A BChunk is stored as a length (a short) followed by a pointer to its data.
chunk:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ReadAddress
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.WriteAddress(System.IntPtr)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  Location to write to

Autodesk.AutoCAD.DatabaseServices.DwgFiler.Seek(System.Int64,System.Int32)
This .Net method wraps the ObjectARX method AcDbDwgFiler::seek.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.Position
This function is not implemented.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.ExtendedMinorVersion
This is ExtendedMinorVersion, a member of class DwgFiler.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.DwgVersion
Accesses the drawing file version, such as Release 13 or Release 14.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.FilerType
Accesses the actual type of the filer.

Autodesk.AutoCAD.DatabaseServices.DwgFiler.FilerStatus
Accesses the current status of the filer.