Autodesk.AutoCAD.DatabaseServices.LayerTableRecord
This .NET class wraps the AcDbLayerTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.GetViewportOverrides(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Retrieves all of the table record's overrides.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.RemoveAllOverrides
Removes all overrides associated with this layer, for all viewports.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.HasViewportOverrides(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if this layer has one or more property overrides that are associated with the viewport whose object id is passed in to the method.
viewportId:  The object id of the viewport.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.HasOverrides
Assesses if this layer has any property overrides associated with any viewport in the drawing.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsReconciled
Assesses if the layer is reconciled.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsHidden
Assesses if the layer is frozen.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.Description
Accesses the user-defined descriptive text for the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.PlotStyleNameId
Accesses the objectId of the entry in the PlotStyleName dictionary for the PlotStyleName of the layer table record.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.PlotStyleName
Accesses the PlotStyleName of the layer table record.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.LineWeight
Accesses the LineWeight of the layer table record.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsPlottable
Assesses if the layer is plottable.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.MaterialId
Accesses the id of the associated Material.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.LinetypeObjectId
Accesses the ObjectId referenced by the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.Transparency
Accesses the transparency value of the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.EntityColor
Accesses the color settings of the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.Color
Accesses the color value of the layer.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsLocked
Assesses if the layer is frozen.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.ViewportVisibilityDefault
Assesses if the layer is frozen by default in new viewports.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsOff
Assesses if the layer is off.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsFrozen
Assesses if the layer is frozen.

Autodesk.AutoCAD.DatabaseServices.LayerTableRecord.IsUsed
Assesses if the layer is used.