Autodesk.AutoCAD.DatabaseServices.HelpParameter
This class represents a help parameter node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.HelpParameter.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.HelpParameter.Value
Gets the value of this help parameter; the value is always larger than or equal to 0.0.

Autodesk.AutoCAD.DatabaseServices.HelpParameter.ConnectedEqualparamConstraints
Gets the array of references to EqualHelpParameterConstraint objects which this constraint is connected to.

Autodesk.AutoCAD.DatabaseServices.HelpParameter.ConnectedConstraint
Gets the reference to the GeometricalConstraint which this help parameter is connected to.

Autodesk.AutoCAD.DatabaseServices.HelpParameter.ConnectedGeometry
Gets the reference to the ConstrainedGeometry which this help parameter is connected to.