Autodesk.AutoCAD.DatabaseServices.Database
This .NET class wraps the AcDbDatabase ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Database.#ctor(System.Boolean,System.Boolean)
Constructor with additional options.
buildDefaultDrawing:  System.Boolean specifying whether or not to build an empty object
noDocument:  System.Boolean specifying whether or not to associate this database to the current document

Autodesk.AutoCAD.DatabaseServices.Database.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Database.Equals(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.Database)
Compares the runtime ID of two databases to see if they are equal.
db1:  Input database to compare
db2:  Input database to compare against

Autodesk.AutoCAD.DatabaseServices.Database.GetHashCode
Gets the Hash Code of the database.

Autodesk.AutoCAD.DatabaseServices.Database.RuntimeId
Get this database instance's runtime ID.

Autodesk.AutoCAD.DatabaseServices.Database.IdFromDb(Autodesk.AutoCAD.DatabaseServices.Database)
Looks up a database in a map and returns its runtime ID.
dataBase:  Input Database of which to get its runtime ID

Autodesk.AutoCAD.DatabaseServices.Database.DbFromId(System.Int64)
Looks up a runtime ID in a map and returns the associated Database object.
id:  Input integer that represents the runtime ID of the Database to return

Autodesk.AutoCAD.DatabaseServices.Database.MarkObjectNonPersistent(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Marks an object non-persistent or persistent. Objects in the drawing database are persistent by default (if they have an owner). This function allows objects to be marked non-persistent.
id:  Input ID of the object to be modified
value:  Input true to make the object non-persistent, or false to make it persistent

Autodesk.AutoCAD.DatabaseServices.Database.IsObjectNonPersistent(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the object denoted by id is non-persistent.
id:  Input ID of the object to be interrogated

Autodesk.AutoCAD.DatabaseServices.Database.ReclaimMemoryFromErasedObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Deletes the objects underneath the input object ids and performs some related cleanup.
ids:  A collection of object ids whose memory is to be reclaimed by deleting their objects. All object ids in the collection must correspond to erased objects, which must be entirely closed.

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph)
This version of the purge() method works in one pass.
idGraph:  Input graph of objects in the database. The graph will be returned containing only those objects that may safely be removed from the database.

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Searches through the database to see if there are any hard references to objects with object ID entities in the ids array.
ids:  Input collection of object ID entities of objects

Autodesk.AutoCAD.DatabaseServices.Database.CountHardReferences(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32[])
This function traverses the database looking for objects with a hard reference to any of the objects whose objectId entities are in the ids array.
ids:  Input collection of objectId entities of objects to find the count of hard references to those objects
count:  Input array of the same size as ids that will be filled in with the counts for each corresponding element in ids

Autodesk.AutoCAD.DatabaseServices.Database.GetObjectId(System.Boolean,Autodesk.AutoCAD.DatabaseServices.Handle,System.Int32)
Returns the objectId of the object that has the handle value contained in objHandle. If createIfNotFound is true and the handle is not found in the database, then a new objectId stub object is created using the handle sought.
Use of the createIfNotFound argument is intended for AutoCAD internal use only (there is no way for an ObjectARX program to do anything with a objectId stub object that is not associated with any database object), so ObjectARX programs should always set this argument to false.
createIfNotFound:  Input Boolean indicating to create a objectId stub if input handle is not found
objHandle:  Input Handle object containing the handle being passed in
identifier:  Reserved for future use

Autodesk.AutoCAD.DatabaseServices.Database.ClassDxfName(Autodesk.AutoCAD.Runtime.RXClass)
This function returns the DXF name for the class.
getMyDxfName:  Input Autodesk.AutoCAD.Runtime.RXClass object to get the name of.

Autodesk.AutoCAD.DatabaseServices.Database.ReadDwgFile(System.IntPtr,System.Boolean,System.String)
Reads the drawing file specified by drawingFile into the database object executing this function.
This function uses the "lazy-load" mechanism, which means that pieces of the drawing are read in only as needed. So, the drawing file is left open until the database object is deleted, at which point the database destructor closes the drawing file. It always tries to open files with read access. It fails if read access is not available.
The allowCPConversion argument controls the behavior when the user tries to read a dwg file where the NLS files are not available to convert from the codepage of the drawing to the codepage of the system (for example, a Japanese drawing on an English OS). If allowCPConversion is false, AutoCAD will pop up a dialog explaining the situation and asking if the user wants to allow some kind of default conversion, which might cause a data loss. If allowCPConversion is true, the file will be opened and the conversion will happen silently.
If password is NULL, the user is prompted for a password if one is required and if no applicable password exists in the password cache.
Warning
This function should only be used on a newly created Database that was created with its constructor's buildDefaultDrawing argument set to false. If this method is used on an Database that was created with buildDefaultDrawing set to true, or an Database that already has information in it (for any reason including a previous call to this function), then memory leaks, or worse, will result.
drawingFile:  Input pointer to DWG file to read
allowCPConversion:  Input Boolean indicating whether to allow codepage conversion
password:  Input string containing a DWG password

Autodesk.AutoCAD.DatabaseServices.Database.ReadDwgFile(System.String,Autodesk.AutoCAD.DatabaseServices.FileOpenMode,System.Boolean,System.String)
Reads the drawing file specified by fileName into the database object executing this function. fileName must include the extension of the file (which does not have to be .dwg) if the file to open has one, even if the extension is .dwg. fileName may be a URL.
This function uses the "lazy-load" mechanism, which means that pieces of the drawing are read in only as needed. So, the drawing file is left open until the database object is deleted, at which point the database destructor closes the drawing file. It always tries to open files with read access. It fails if read access is not available.
The mode describes how other applications may access the file when the same file has already been opened.
The allowCPConversion argument controls the behavior when the user tries to read a dwg file where the NLS files are not available to convert from the codepage of the drawing to the codepage of the system (for example, a Japanese drawing on an English OS). If allowCPConversion is false, AutoCAD will pop up a dialog explaining the situation and asking if the user wants to allow some kind of default conversion, which might cause a data loss. If allowCPConversion is true, the file will be opened and the conversion will happen silently.
If password is NULL, the user is prompted for a password if one is required and if no applicable password exists in the password cache. Warning
This function should only be used on a newly created Database that was created with its constructor's buildDefaultDrawing argument set to false. If this method is used on an Database that was created with buildDefaultDrawing set to true, or an Database that already has information in it (for any reason including a previous call to this function), then memory leaks, or worse, will result.
fileName:  Input name or URL of file to read
mode:  Input open mode
allowCPConversion:  Input Boolean indicating whether to allow codepage conversion
password:  Input string containing a DWG password

Autodesk.AutoCAD.DatabaseServices.Database.SaveAs(System.String,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
Runs the save process on the database and writes the drawing information out to fileName.
fileName:  Input file name or URL to write database out to
version:  Input dwg version to which to save the file

Autodesk.AutoCAD.DatabaseServices.Database.Save
Currently not implemented.

Autodesk.AutoCAD.DatabaseServices.Database.DxfIn(System.String,System.String)
This function reads the DXF file specified into the database object.
fileName:  Input full path of the DXF file to be read into database
logFilename:  Log file to record all warning/error messages from reading the DXF file

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
Creates an DXF file.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Input number of bits of accuracy, from 0 to 16
version:  Sets the DWG version major and minor number

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,System.Boolean)
Creates an DXF file.
Note
The precision may also be set to -1 to change the output format from the default ASCII DXF format to the binary DXF format.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Input number of bits of accuracy, from 0 to 16
saveThumbnailImage:  Input Boolean indicating whether to save thumbnail

Autodesk.AutoCAD.DatabaseServices.Database.CloseInput(System.Boolean)
If a drawing file is associated with this Database, then this function forces an immediate read of all necessary information from the file into the Database object and disconnects the file from the Database.
If closeFile is true, the drawing file will be closed when it has been fully read into, and disconnected from, the Database. If closeFile is false, the drawing file will still be disconnected from the Database, but the drawing file will remain open until the host application session ends.
This function will only execute once per Database, so multiple calls will have no effect after the first call.
Passing true for this argument is recommended.
If a drawing file is associated with this database, then this function forces an immediate read of all necessary information from the file into the database object. If closeFile is true, the drawing file will be closed when it has been fully read into the Database.
closeFile:  Input System.Boolean indicating whether to close the drawing file

Autodesk.AutoCAD.DatabaseServices.Database.ResolveXrefs(System.Boolean,System.Boolean)
Resolves existing xrefs in the working database.
If useThreadEngine is true, and other factors haven't disabled it, then the multi-thread engine is used for resolving the xrefs.
If doNewOnly is true, only unresolved xref records are processed. Existing resolved xref LayerTableRecords, LinetypeTableRecords, and BlockTableRecords are ignored. In this case, the useThreadEngine argument also is ignored, and the multi-thread engine is not used. Warning
No document locking is done by this function; the caller is responsible for locking the document.
This function is available to non-AutoCAD-based host applications.
useThreadEngine:  Input Boolean indicating whether to use the thread engine for xref resolution
doNewOnly:  Input Boolean indicating whether to process only newly added xrefs

Autodesk.AutoCAD.DatabaseServices.Database.AttachXref(System.String,System.String)
Attaches the xref file specified by fileName to the database, thus creating a new xref BlockTableRecord.
fileName:  Input xref file path name
blockName:  Input xref block name symbol to use

Autodesk.AutoCAD.DatabaseServices.Database.OverlayXref(System.String,System.String)
Overlays the xref file specified by fileName to the database, thus creating a new xref BlockTableRecord.
fileName:  Input xref file path name
blockName:  Input xref block name symbol to use

Autodesk.AutoCAD.DatabaseServices.Database.DetachXref(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Detaches the xref in the database whose BlockTableRecord is specified by xrefId.
xrefId:  Input object ID of the xref block to detach

Autodesk.AutoCAD.DatabaseServices.Database.UnloadXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Unloads the xrefs whose BlockTableRecord ObjectIds are in xrefIds.
xrefIds:  Input collection of ObjectIds for the xref BlockTableRecords to unload

Autodesk.AutoCAD.DatabaseServices.Database.ReloadXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Reloads the xrefs whose BlockTableRecord ObjectIds are in xrefIds.
xrefIds:  Input collection of ObjectIds for the xref BlockTableRecords to unload

Autodesk.AutoCAD.DatabaseServices.Database.BindXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
This function binds the xrefs whose BlockTableRecord object IDs are in xrefIds. If insertBind is true, then the symbolTable record names will be changed from the xref naming convention to normal insert block names.
The object IDs in xrefIds must all be from the database and they must all be resolved.
xrefIds:  Input collection of ObjectIds for the xref BlockTableRecords to bind.
insertBind:  Input System.Boolean to indicate whether or not to convert xref symbols to insert-like bind names.

Autodesk.AutoCAD.DatabaseServices.Database.XBindXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
Binds the xref symbolTable records whose ObjectIds are in xrefSymbolIds. If insertBind is true, then the symbolTable record names will be changed from the xref naming convention to normal insert symbolTable record names.
The ObjectIds in xrefSymbolIds must all be from the working database and they must all be from resolved xrefs. xrefSymbolIds may contain ObjectIds for the following symbol table record types: BlockTableRecord, LayerTableRecord, LinetypeTableRecord, TextStyleTableRecord (if it does not represent a shape file), RegAppTableRecord, and DimStyleTableRecord.
xrefSymbolIds:  Input collection of ObjectIds of SymbolTableRecord objects to be bound.
insertBind:  Input bool to indicate whether or not to convert xref symbols to insert-like bind names.

Autodesk.AutoCAD.DatabaseServices.Database.GetHostDwgXrefGraph(System.Boolean)
Returns the node associated with the host drawing.
includeGhosts:  If set to true, includes ghost nodes.

Autodesk.AutoCAD.DatabaseServices.Database.LoadMlineStyleFile(System.String,System.String)
Loads the MlineStyle specified by mlineStyleName from the file specified by fileName.
mlineStyleName:  Input MlineStyle name string (no wild cards)
fileName:  Input path/filename or URL of file to load from (path is optional)

Autodesk.AutoCAD.DatabaseServices.Database.DxfOutEx(System.String,System.Int32,Autodesk.AutoCAD.DatabaseServices.DwgVersion,System.Boolean,System.Int32)
Saves this drawing to a DXF file and allows the caller to specify a code page.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Input number of bits of accuracy, from 0 to 16
version:  Input as a constant which represents the DXF format version to create, R12 through current
saveThumbnailImage:  Input Boolean indicating whether to save thumbnail
nCodePage:  Input code page to use for pre-2007 dxf formats

Autodesk.AutoCAD.DatabaseServices.Database.GetSupportedSaveVersions
Returns an array with the major and minor version numbers of the saving ability.

Autodesk.AutoCAD.DatabaseServices.Database.GetSupportedDxfOutVersions
Returns an array with the major and minor version numbers of outputting DXF.

Autodesk.AutoCAD.DatabaseServices.Database.Wblock
Creates a new Database object, and then uses the wblockClone mechanism to write the entire contents of the database on which this function is being called out to the new database.

Autodesk.AutoCAD.DatabaseServices.Database.ForceWblockDatabaseCopy
This function causes the next (and only the next) Database.wblock() call on this database to result in a copy of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Creates a new block table record in the database executing this function. This new block table record is given the name pointed to by destinationBlockName. Then, each entity in the block table record whose name is sourceBlockName and which resides in the database pointed to by dataBase is copied into the new block table record.
The preserveSourceDatabase argument determines whether the source database dataBase is left intact. The default value of the argument is true. In that case, objects from the source database are copied to the destination database, and the source database is not changed. If the caller passes false for this argument, objects from the source database could be physically moved into the destination database. The latter runs faster, but it leaves the source database dependent on the destination database. The caller should make sure that the source database is deleted either immediately, or at least before the destination database is deleted.
Returns the object ID for the new block table record created by this function.
sourceBlockName:  Input name of the blockTableRecord
destinationBlockName:  Input name to be used by the new block table record created by this function
dataBase:  Input database from which to insert entities
preserveSourceDatabase:  Input bool to determine whether the source database is left intact

Autodesk.AutoCAD.DatabaseServices.Database.Insert(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Inserts the Model Space of the database pointed to by dataBase into the Model Space of the database invoking the insert() function. All objects being inserted have the xform matrix passed into their transformBy() function during the insertion process.
The preserveSourceDatabase argument determines whether the source database dataBase is left intact or not. The default value of the argument is true. In that case, objects from the source database are copied to the destination database and the source database is not changed. If the caller passes false for this argument, objects from the source database could be physically moved into the destination database. The latter runs faster, but it leaves the source database dependent on the destination database. The caller should make sure that the source database is deleted either immediately or at least before the destination database is deleted.
transform:  Input transformation matrix applied to all objects being inserted
dataBase:  Input database to insert from
preserveSourceDatabase:  Input to determine whether the source database pDb will be left intact

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Mimics the AutoCAD INSERT command. First a new block table record is created in the database executing this function. This new block table record is given the name pointed to by blockName. Then, all the Model Space entities in the database pointed to by dataBase are copied into the new block table record.
The preserveSourceDatabase argument determines whether the source database dataBase is left intact. The default value of the argument is true. In that case, objects from the source database are copied to the destination database, and the source database is not changed. If the caller passes false for this argument, objects from the source database could be physically moved into the destination database. The latter runs faster, but it leaves the source database dependent on the destination database. The caller should make sure that the source database is deleted either immediately, or at least before the destination database is deleted.
Returns the object ID for the new block table record created by this function.
blockName:  Input name to be used by the new block table record created by this function
dataBase:  Input database from which to insert entities
preserveSourceDatabase:  Input bool to determine whether the source database is left intact

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
Clones all objects in the objectId array and appends them to the container object specified by owner. mapping is filled with IdMapping objects that contain the objectId entities of the original and cloned object pairs. This array can be used for post-processing the objects involved in the deepClone operation.
When the new objects are assigned owners, layout objects trigger an assert that the owner is the destination database's layout dictionary and the layout is given a name in the dictionary that matches the name stored inside the layout. (The default behavior for dictionary-owned objects would be to give it an anonymous name like "*A1".).
identifiers:  Input collection of objects to be deep cloned
id:  Input Object ID of object to be the owner of the clones
mapping:  Returns collection of objects to be used for translating object ID relationships
deferTranslation:  Input Boolean indicating whether or not ID translation should be done

Autodesk.AutoCAD.DatabaseServices.Database.WblockCloneObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,Autodesk.AutoCAD.DatabaseServices.DuplicateRecordCloning,System.Boolean)
Clones all objects in the identifiers collection and appends them to the container object specified by owner. The objects can be from multiple source databases, and must match the type of owner supplied, but must be from a different database than the owner object. id can only be an BlockTableRecord, Dictionary, or SymbolTable object. In multiple calls, the owners must be from the same destination database. If the owner is a dictionary, newly cloned entries are set as anonymous. mapping is filled with IdPair objects that contain the objectId entities of the original and cloned object pairs. This array can be used for post-processing the objects involved in the deepClone operation.
The cloning value determines what happens if symbols or dictionary entries are cloned, and a duplicate is found to already exist in the destination database. cloning must keep the same setting in multiple calls, and can be only one of the following: Ignore -- If a duplicate is found, ignore the clone, and continue to use the existing record in the destination database. This is how the INSERT command and Database.insert() operate.Replace -- If a duplicate is found, replace it with the cloned record.MangleName -- Mangle all the incoming record names. The mangling will also ensure unique names. This is how the RefEdit command works.UnmangleName -- Primarily used by RefEdit when it checks the records back into the origin database. Any mangling done by kDrcMangleName is undone, and then it defaults to Ignore. In other words, if a duplicate is found after removing the mangling, AutoCAD continues to use the existing record, and ignores the cloned one.
identifiers:  Input collection of objects to be deep cloned
id:  Input object ID of object to be the owner of the clones
mapping:  Collection of IdPair objects to be used for translating object ID relationships
cloning:  Input action for duplicate records
deferTranslation:  Input Boolean indicating whether or not ID translation should be done

Autodesk.AutoCAD.DatabaseServices.Database.AbortDeepClone(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Triggers an Editor notification that the deepClone operation identified by idMap has been aborted.
idMap:  Input used in the deepClone operation being aborted

Autodesk.AutoCAD.DatabaseServices.Database.AuditXData(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
Currently not implemented.
info:  Not implemented

Autodesk.AutoCAD.DatabaseServices.Database.DisableUndoRecording(System.Boolean)
This function turns Undo recording on or off for operations performed on the database. If disable==true, then Undo recording is turned off.
This function does not erase any existing Undo information. It only turns the Undo recorder on and off for the database.
Note
Newly created Database objects have Undo turned off. A call to this function with an false argument is necessary to enable the Undo recording in Database.
disable:  Input Boolean indicating turn Undo on or off

Autodesk.AutoCAD.DatabaseServices.Database.RestoreOriginalXrefSymbols
This function must be used with RestoreForwardingXrefSymbols(), and should be wrapped around all code with plans to edit and/or save Xref databases.

Autodesk.AutoCAD.DatabaseServices.Database.RestoreForwardingXrefSymbols
This function must be used with RestoreOriginalXrefSymbols(), and should be wrapped around all code with plans to edit and/or save Xref databases.

Autodesk.AutoCAD.DatabaseServices.Database.IsValidLineWeight(System.Int32)
Returns true for lineweights that match one of the predefined lineweights, and false otherwise.
weight:  Input lineweight in hundredths of a millimeter

Autodesk.AutoCAD.DatabaseServices.Database.GetNearestLineWeight(System.Int32)
Returns the nearest LineWeight enum value based on the provided lineweight in millimeters.
weight:  Input lineweight in hundredths of a millimeter

Autodesk.AutoCAD.DatabaseServices.Database.ResetTimes
This function resets the Database TDCREATE, TDUPDATE, TDINDWG, and TDUSRTIMER to the settings for a new drawing (TDCREATE and TDUPDATE to the current date/time, and TDINDWG and TDUSRTIMER to 0).

Autodesk.AutoCAD.DatabaseServices.Database.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Copies the dimension variable information in style into the database on which this method is called, making those dimension variable values current for the database.
style:  Input pointer to DimStyleTableRecord from which to copy dimension variable information

Autodesk.AutoCAD.DatabaseServices.Database.GetDimstyleData
Copies the database dimension variable values into the DimStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleChildData(Autodesk.AutoCAD.Runtime.RXClass)
Returns the DimStyleTableRecord referenced by the dimension.
classDescriptor:  Input object to check.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleChildId(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given a parent dimension style ID and a dimension class descriptor, this function returns the child dimension style ID, if available, for the given dimension type.
classDescriptor:  Input dimension class descriptor
parentStyle:  Input parent dimension style ID

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleParentId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given a child dimension style ID, this function returns the parent dimension style ID.
childStyle:  Input child dimension style ID

Autodesk.AutoCAD.DatabaseServices.Database.WorldPaperspaceUcsBaseOrigin(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Returns the database's model space "default" UCS origin point (in WCS coordinates) for the view specified by orthoView.
orthoView:  Input desired view

Autodesk.AutoCAD.DatabaseServices.Database.SetWorldPaperspaceUcsBaseOrigin(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets origin to be the new paperspace "default" UCS origin point for the view specified by orthoView.
origin:  Input new origin point in WCS coordinates
orthoView:  Input view for which base point is desired

Autodesk.AutoCAD.DatabaseServices.Database.UpdateExt(System.Boolean)
Iterates through all the entities in the database's Model Space and updates the database's Model Space extents variables EXTMAX and EXTMIN to the values determined during the iteration.
Setting the argument doBestFit to TRUE means that while traversing the database, any BlockReference entities found should have their geomExtentsBestFit() method called instead of geomExtents(). This will be slower but will generate a tighter bounding box (extents). Using the default argument of FALSE will be faster but may not produce the tightest bounding box.
doBestFit:  Determines whether to generate the tightest bounding box

Autodesk.AutoCAD.DatabaseServices.Database.WorldUcsBaseOrigin(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Returns the database's model space "default" UCS origin point (in WCS coordinates) for the view specified by orthoView.
orthoView:  Input view for which base point is desired

Autodesk.AutoCAD.DatabaseServices.Database.SetWorldUcsBaseOrigin(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets origin to be the new model space "default" UCS origin point for the view specified by orthoView.
origin:  Input new origin point in WCS coordinates
orthoView:  Input view for which base point is desired

Autodesk.AutoCAD.DatabaseServices.Database.GetDimRecentStyleList
This function allows the application to get the object ID entities of the most recently used dimstyles (up to 6) for dimension context menu dimstyle MRU list support.

Autodesk.AutoCAD.DatabaseServices.Database.LoadLineTypeFile(System.String,System.String)
Loads the linetype specified by lineTypeName from the file specified by filename and stores it in the database on which this method is called.
lineTypeName:  Input linetype name string (wild cards may be used)
filename:  Input path/filename or URL of linetype file to load from (path is optional)

Autodesk.AutoCAD.DatabaseServices.Database.ApplyPartialOpenFilters(Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter,Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter)
This function can be called on a database to filter its model space entities to only bring part of the drawing into memory.
spatialFilter:  Specifies the model space volume to be used for spatial filtering
layerFilter:  Specifies the layers to be used for filtering

Autodesk.AutoCAD.DatabaseServices.Database.DisablePartialOpen
When called during partial open notification, this function vetoes the partial open operation and causes the entire drawing database to be loaded.

Autodesk.AutoCAD.DatabaseServices.Database.GetViewports(System.Boolean)
Enumerates the Viewports in a drawing.
bGetPaperspaceVports:  Input flag indicating whether to return paperspace viewports associated with layouts

Autodesk.AutoCAD.DatabaseServices.Database.FromAcadDatabase(System.Object)
Converts a COM object of the type AcadDatabase to a Database object.

Autodesk.AutoCAD.DatabaseServices.Database.GetVisualStyleList
Returns a list containing the localized names of the visual styles defined in the visual style dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.SetTimeZoneAsUtcOffset(System.Double)
This .NET function wraps the the AcDbDatabase::setTimeZoneAsUtcOffset() ObjectARX function.
offset:  Input the offset, in hours

Autodesk.AutoCAD.DatabaseServices.Database.GetAllDatabases
Returns an array of all currently active databases.

Autodesk.AutoCAD.DatabaseServices.Database.EvaluateFields(Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext,System.String)
Evaluates the fields defined in annotation objects.
context:  Input bitwise value that determines the contexts in which fields should be evaluated. Refer to the DatabaseServices.FieldEvaluationContext enum for available context values.
prop:  Input property name whose field is to be evaluated; if empty, all fields are evaluated

Autodesk.AutoCAD.DatabaseServices.Database.EvaluateFields(Autodesk.AutoCAD.DatabaseServices.FieldEvaluationContext)
Evaluates the fields defined in annotation objects.
context:  Input bitwise value that determines the contexts in which fields should be evaluated. Refer to the DatabaseServices.FieldEvaluationContext enum for available context values.

Autodesk.AutoCAD.DatabaseServices.Database.EvaluateFields
Evaluates the fields defined in annotation objects.

Autodesk.AutoCAD.DatabaseServices.Database.DwgFileOpened
Wraps AcRxEventReactor::dwgFileOpened.

Autodesk.AutoCAD.DatabaseServices.Database.InitialDwgFileOpenComplete
Wraps AcRxEventReactor::initialDwgFileOpenComplete.

Autodesk.AutoCAD.DatabaseServices.Database.DatabaseConstructed
Wraps AcRxEventReactor::databaseConstructed.

Autodesk.AutoCAD.DatabaseServices.Database.DatabaseToBeDestroyed
Wraps AcRxEventReactor::databaseToBeDestroyed.

Autodesk.AutoCAD.DatabaseServices.Database.BeginSave
Wraps AcRxEventReactor::beginSave.

Autodesk.AutoCAD.DatabaseServices.Database.SaveComplete
Wraps AcRxEventReactor::saveComplete.

Autodesk.AutoCAD.DatabaseServices.Database.AbortSave
Wraps AcRxEventReactor::abortSave.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDxfIn
Wraps AcRxEventReactor::beginDxfIn.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDxfIn
Wraps AcRxEventReactor::abortDxfIn.

Autodesk.AutoCAD.DatabaseServices.Database.DxfInComplete
Wraps AcRxEventReactor::dxfInComplete.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDxfOut
Wraps AcRxEventReactor::beginDxfOut.

Autodesk.AutoCAD.DatabaseServices.Database.AbortDxfOut
Wraps AcRxEventReactor::abortDxfOut.

Autodesk.AutoCAD.DatabaseServices.Database.DxfOutComplete
Wraps AcRxEventReactor::dxfOutComplete.

Autodesk.AutoCAD.DatabaseServices.Database.BeginInsert
Wraps AcRxEventReactor::beginInsert.

Autodesk.AutoCAD.DatabaseServices.Database.InsertMappingAvailable
Wraps AcRxEventReactor::otherInsert.

Autodesk.AutoCAD.DatabaseServices.Database.InsertAborted
Wraps AcRxEventReactor::abortInsert.

Autodesk.AutoCAD.DatabaseServices.Database.InsertEnded
Wraps AcRxEventReactor::endInsert.

Autodesk.AutoCAD.DatabaseServices.Database.WblockNotice
Wraps AcRxEventReactor::wblockNotice.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockSelectedObjects
Wraps AcRxEventReactor::beginWblock.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockBlock
Wraps AcRxEventReactor::beginWblock.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockEntireDatabase
Wraps AcRxEventReactor::beginWblock.

Autodesk.AutoCAD.DatabaseServices.Database.WblockMappingAvailable
Wraps AcRxEventReactor::otherWblock.

Autodesk.AutoCAD.DatabaseServices.Database.WblockAborted
Wraps AcRxEventReactor::abortWblock.

Autodesk.AutoCAD.DatabaseServices.Database.WblockEnded
Wraps AcRxEventReactor::endWblock.

Autodesk.AutoCAD.DatabaseServices.Database.BeginWblockObjects
Wraps AcRxEventReactor::beginWblockObjects.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepClone
Wraps AcRxEventReactor::beginDeepClone.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepCloning
This event indicates that a deep clone operation is starting from any drawing database.
Note
You should check the sender to find out which database is sending the event.

Autodesk.AutoCAD.DatabaseServices.Database.BeginDeepCloneTranslation
Wraps AcRxEventReactor::beginDeepCloneTranslation.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneAborted
Wraps AcRxEventReactor::abortDeepClone.

Autodesk.AutoCAD.DatabaseServices.Database.DeepCloneEnded
Wraps AcRxEventReactor::endDeepClone.

Autodesk.AutoCAD.DatabaseServices.Database.PartialOpenNotice
Wraps AcRxEventReactor::partialOpenNotice.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginAttached
Wraps AcEditorReactor::beginAttach.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginOtherAttached
Wraps AcEditorReactor::otherAttach.

Autodesk.AutoCAD.DatabaseServices.Database.XrefAttachAborted
Wraps AcEditorReactor::abortAttach.

Autodesk.AutoCAD.DatabaseServices.Database.XrefAttachEnded
Wraps AcEditorReactor::endAttach.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRedirected
Wraps AcEditorReactor::redirected.

Autodesk.AutoCAD.DatabaseServices.Database.XrefComandeered
Wraps AcEditorReactor::commandeered.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBeginRestore
Wraps AcEditorReactor::beginRestore.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRestoreAborted
Wraps AcEditorReactor::abortRestore.

Autodesk.AutoCAD.DatabaseServices.Database.XrefRestoreEnded
Wraps AcEditorReactor::endRestore.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectAppended
Wraps AcDbDatabaseReactor::objectAppended.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectUnappended
Wraps AcDbDatabaseReactor::objectUnAppended.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectReappended
Wraps AcDbDatabaseReactor::objectReAppended.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectOpenedForModify
Wraps AcDbDatabaseReactor::objectModified.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectModified
Wraps AcDbDatabaseReactor::objectModified.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectErased
Wraps AcDbDatabaseReactor::objectErased.

Autodesk.AutoCAD.DatabaseServices.Database.SystemVariableWillChange
Wraps AcDbDatabaseReactor::headerSysVarWillChange.

Autodesk.AutoCAD.DatabaseServices.Database.SystemVariableChanged
Wraps AcDbDatabaseReactor::headerSysVarChanged.

Autodesk.AutoCAD.DatabaseServices.Database.ProxyResurrectionCompleted
Wraps AcDbDatabaseReactor::proxyResurrectionCompleted.

Autodesk.AutoCAD.DatabaseServices.Database.Disposed
Wraps AcDbDatabaseReactor::goodbye.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandStart
Wraps AcRxEventReactor::xrefSubCommandStart.

Autodesk.AutoCAD.DatabaseServices.Database.XrefPreXrefLockFile
Wraps AcEditorReactor::preXrefLockFile.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandAborted
Wraps AcRxEventReactor::xrefSubCommandAborted.

Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandEnd
Wraps AcRxEventReactor::xrefSubCommandEnd.

Autodesk.AutoCAD.DatabaseServices.Database.EraseEmptyObjects(System.Int32)
Erases empty objects (zero length curves and/or empty TEXT/MTEXT) in the database.
flags:  The setting of the erase mode. It is stored as a bitcode using the combination of the following enum values:ZeroLengthCurve - Erase zero length curves (AcDbCurve derived objects such as LINE, POLYLINE, SPLINE, etc.)EmptyText - Erase empty TEXT/MTEXT objects (which contain only spaces, tabs, enters and/or new lines)AllEmptyObj - Erase all empty objects

Autodesk.AutoCAD.DatabaseServices.Database.CountEmptyObjects(System.Int32)
Counts empty objects (zero length curves and/or empty TEXT/MTEXT) in the database.
flags:  The setting of the count mode. It is stored as a bitcode using the combination of the following enum values:ZeroLengthCurve - Count zero length curves (AcDbCurve derived objects such as LINE, POLYLINE, SPLINE, etc.)EmptyText - Count empty TEXT/MTEXT objects (which contain only spaces, tabs, enters and/or new lines)AllEmptyObj - Count all empty objects

Autodesk.AutoCAD.DatabaseServices.Database.HomeView
Accesses the navigation home view associated with the database.

Autodesk.AutoCAD.DatabaseServices.Database.GeoDataObject
Accesses the Geo data object ID for this database.

Autodesk.AutoCAD.DatabaseServices.Database.UpdateThumbnail
Accesses the UPDATETHUMBNAIL header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.MsOleScale
Accesses the value of the LAYERNOTIFY header variable.

Autodesk.AutoCAD.DatabaseServices.Database.LayerNotify
Accesses the value of the LAYEREVAL header variable.

Autodesk.AutoCAD.DatabaseServices.Database.LayerEval
Accesses the LAYEREVAL header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.Indexctl
Accesses the INDEXCTL header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.PdfFrame
This .NET property wraps the ObjectARX functions AcDbDatabase::pdfframe and AcDbDatabase::setPdfframe.

Autodesk.AutoCAD.DatabaseServices.Database.DgnFrame
Reserved for future use.

Autodesk.AutoCAD.DatabaseServices.Database.DwfFrame
Accesses the current DWFFRAME value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.MsLtScale
Accesses the current MSLTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.AnnotativeDwg
Controls whether the drawing is treated as an annotative block when it is inserted into other drawings.

Autodesk.AutoCAD.DatabaseServices.Database.AnnoAllVisible
Accesses the current ANNOALLVISIBLE value for the database
See the System Variables section of the AutoCAD Command Reference for information on ANNOALLVISIBLE.

Autodesk.AutoCAD.DatabaseServices.Database.ShadowPlaneLocation
Accesses the current ground plane z position in world coordinates.

Autodesk.AutoCAD.DatabaseServices.Database.Cmaterial
Accesses the object ID of the layer material.

Autodesk.AutoCAD.DatabaseServices.Database.Cshadow
Accesses the value of the CSHADOW system variable.

Autodesk.AutoCAD.DatabaseServices.Database.TimeZone
Accesses the current time zone for the drawing, an enumerated value.

Autodesk.AutoCAD.DatabaseServices.Database.LoftMag2
Accesses the current LOFTMAG2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LoftMag1
Accesses the current LOFTMAG1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LoftAng2
Accesses the current LOFTANG2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LoftAng1
Accesses the current LOFTANG1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LoftNormals
Accesses the current LOFTNORMALS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LoftParam
Accesses the current LOFTPARAM value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PsolHeight
Accesses the current PSOLHEIGHT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PsolWidth
Accesses the current PSOLWIDTH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ShowHist
Accesses the current SHOWHIST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.SolidHist
Accesses the current SOLIDHIST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DxEval
Accesses the DX Eval value.

Autodesk.AutoCAD.DatabaseServices.Database.StepSize
Accesses the current STEPSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.StepsPerSec
Accesses the current STEPSPERSEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.CameraDisplay
Accesses the value of the CAMERADISPLAY sysvar to display or hide cameras.

Autodesk.AutoCAD.DatabaseServices.Database.LensLength
Accesses the value of LENSLENGTH system variable.

Autodesk.AutoCAD.DatabaseServices.Database.CameraHeight
Accesses the value of CAMERAHEIGHT system variable.This value is used as the default when creating new cameras.

Autodesk.AutoCAD.DatabaseServices.Database.LayerFilters
Accesses the layer filters.

Autodesk.AutoCAD.DatabaseServices.Database.DrawOrderCtl
Returns the value of the DRAWORDERCTL system variable, which enables users to revert to legacy draw order mode if required.

Autodesk.AutoCAD.DatabaseServices.Database.SummaryInfo
Accesses the database's summary info.

Autodesk.AutoCAD.DatabaseServices.Database.Dimzin
Accesses the current DIMZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimupt
Accesses the current DIMUPT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtzin
Accesses the current DIMTZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtxtdirection
Accesses the current DIMTXTDIRECTION value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtxt
Accesses the current DIMTXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtxsty
Accesses the object ID of the TextStyle specified by the current DIMTXSTY value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtvp
Accesses the current DIMTVP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtsz
Accesses the current DIMTSZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtp
Accesses the current DIMTP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtolj
Accesses the current DIMTOLJ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtol
Accesses the current DIMTOL value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtoh
Accesses the current DIMTOH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtofl
Accesses the current DIMTOFL value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtmove
Accesses the current DIMTMOVE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtm
Accesses the current DIMTM value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtix
Accesses the current DIMTIX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtih
Accesses the current DIMTIH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfillclr
Accesses the current dimension background color (if dimtfill is set to 1).

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfill
Accesses the dimension background color state, which can be one of the following values:
0 - Background color is disabled1 - Use background color from dimtfillclr2 - Use drawing's background color.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfac
Accesses the current DIMTFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtdec
Accesses the current DIMTDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimtad
Accesses the current DIMTAD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsoxd
Accesses the current DIMSOXD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimse2
Accesses the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimse1
Accesses the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsd2
Accesses the current DIMSD2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsd1
Accesses the current DIMSD1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimscale
Accesses the current DIMSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsah
Accesses current DIMSAH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimrnd
Accesses the current DIMRND value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlwe
Accesses the current DIMLWE value for the dimension.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlwd
Accesses the current DIMLWD value for the dimension.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlunit
Accesses the current DIMLUNIT value for the dimension.

Autodesk.AutoCAD.DatabaseServices.Database.Dimltype
Accesses the dimension linetype.

Autodesk.AutoCAD.DatabaseServices.Database.Dimltex2
Accesses the object ID of the linetype of extension line 2.

Autodesk.AutoCAD.DatabaseServices.Database.Dimltex1
Accesses the object ID of the linetype of extension line 1.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlim
Accesses the current DIMLIM value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimlfac
Accesses the current DIMLFAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimldrblk
Accesses the object ID of the block reference specified by the current DIMLDRBLK value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimjust
Accesses the current DIMJUST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimjogang
Accesses the current large radial angle.

Autodesk.AutoCAD.DatabaseServices.Database.Dimgap
Accesses the current DIMGAP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimfxlen
Accesses the fixed extension lines value.

Autodesk.AutoCAD.DatabaseServices.Database.DimfxlenOn
Accesses a value that indicates whether the fixed extension lines are on.

Autodesk.AutoCAD.DatabaseServices.Database.Dimfrac
Accesses the current DIMFRAC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimexo
Accesses the current DIMEXO value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimexe
Accesses the current DIMEXE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdsep
Accesses the current DIMDSEP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdli
Accesses the current DIMDLI value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdle
Accesses the current DIMDLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimdec
Accesses the current DIMDEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimclrt
Accesses the current DIMCLRT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimclre
Accesses the current DIMCLRE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimclrd
Accesses the current DIMCLRD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimcen
Accesses the current DIMCEN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimazin
Accesses the current DIMAZIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaunit
Accesses the current DIMAUNIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimatfit
Accesses the current DIMATFIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimasz
Accesses the current DIMASZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimarcsym
Accesses the arc length placement value.

Autodesk.AutoCAD.DatabaseServices.Database.Dimapost
Accesses the current DIMAPOST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltz
Accesses the current DIMALTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltu
Accesses the current DIMALTU value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalttz
Accesses the current DIMALTTZ value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalttd
Accesses the current DIMALTTD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltrnd
Accesses the current DIMALTRND value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltf
Accesses the current DIMALTF value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaltd
Accesses the current DIMALTD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimalt
Accesses the current DIMALT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimadec
Accesses the current DIMADEC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.AcadDatabase
Returns the current database.

Autodesk.AutoCAD.DatabaseServices.Database.Cannoscale
Accesses a AnnotationScale object which will be the CANNOSCALE value for the database when model space is current.

Autodesk.AutoCAD.DatabaseServices.Database.dragvs
Accesses the visual style set in the DRAGVS system variable.

Autodesk.AutoCAD.DatabaseServices.Database.LightsInBlocks
Accesses if blocks are ignored and do not contribute lighting to the scene.

Autodesk.AutoCAD.DatabaseServices.Database.LightingUnits
Accesses the lighting units for the drawing, where 0 = Generic, 1 = International, and 2 = American.

Autodesk.AutoCAD.DatabaseServices.Database.TileModeLightSynch
For internal use only.

Autodesk.AutoCAD.DatabaseServices.Database.LightGlyphDisplay
Accesses whether light objects are displayed in the viewport.

Autodesk.AutoCAD.DatabaseServices.Database.NorthDirection
Accesses an angle representing a direction towards North, based on the orientation of the drawing model in the WCS.

Autodesk.AutoCAD.DatabaseServices.Database.Longitude
Accesses the longitude for the location of the model, in decimal degrees.

Autodesk.AutoCAD.DatabaseServices.Database.Latitude
Accesses the latitude for the location of the model, in decimal degrees.

Autodesk.AutoCAD.DatabaseServices.Database.AllowExtendedNames
Set to true if extended names are permitted.

Autodesk.AutoCAD.DatabaseServices.Database.IntersectColor
Accesses the INTERSECTIONCOLOR header variable value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.IntersectDisplay
Accesses the INTERSECTIONDISPLAY header variable value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ObscuredLineType
Accesses the current OBSCUREDLINETYPE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ObscuredColor
Accesses the current OBSCUREDCOLOR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HaloGap
Accesses the current HALOGAP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HideText
Accesses the current HIDETEXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DimAssoc
Accesses the current DIMASSOC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.SortEnts
Accesses the current SORTENTS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DwgFileWasSavedByAutodeskSoftware
Returns true if it determines that the database was last saved by Autodesk software (such as AutoCAD or AutoCAD LT).

Autodesk.AutoCAD.DatabaseServices.Database.ViewportScaleDefault
Accesses the database's default value for viewport scale.

Autodesk.AutoCAD.DatabaseServices.Database.CurrentViewportTableRecordId
This .NET property wraps the acdbGetCurVportTableRecordId() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleMode
Returns true when this database is using color-dependent plot styles, and false for named plot styles.

Autodesk.AutoCAD.DatabaseServices.Database.Insunits
Accesses the current INSUNITS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.TstackSize
Accesses the current TSTACKSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.TStackAlign
Accesses the current TSTACKALIGN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.VersionGuid
Accesses the database's Version GUID string.

Autodesk.AutoCAD.DatabaseServices.Database.FingerprintGuid
Accesses the database's fingerprintguid header variable.

Autodesk.AutoCAD.DatabaseServices.Database.IsPartiallyOpened
Returns true if the database is in a partially opened state; false otherwise.

Autodesk.AutoCAD.DatabaseServices.Database.IsBeingDestroyed
This is IsBeingDestroyed, a member of class Database.

Autodesk.AutoCAD.DatabaseServices.Database.Filename
Accesses the filename associated with the database.

Autodesk.AutoCAD.DatabaseServices.Database.StyleSheet
Accesses the database's current plot style sheet.

Autodesk.AutoCAD.DatabaseServices.Database.HyperlinkBase
Accesses the database to use a copy of path as the new value for the HYPERLINKBASE header variable.

Autodesk.AutoCAD.DatabaseServices.Database.ProjectName
Accesses the database's PROJECTNAME header variable string.

Autodesk.AutoCAD.DatabaseServices.Database.Dimblk2
Accesses the current DIMBLK2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimblk1
Accesses the current DIMBLK1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimblk
Accesses the current DIMBLK value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimpost
Accesses the character string that is the current DIMPOST value for the datatbase.

Autodesk.AutoCAD.DatabaseServices.Database.UcsOrthographic
Accesses the current orthographic view.

Autodesk.AutoCAD.DatabaseServices.Database.UcsBase
Accesses the object ID of the UcsTableRecord that defines the origin and orientation of orthographic UCS settings for the database's model space.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsname
Accesses the object ID of the UCS table entry that is currently in use in the Model Space of the database; that is, the Model Space value of UCSNAME.

Autodesk.AutoCAD.DatabaseServices.Database.Ucs
Sets the Model Space UCS.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsydir
Accesses the current Model Space UCSYDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsxdir
Accesses the current Model Space UCSXDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Ucsorg
Accesses the current Model Space UCSORG value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Elevation
Accesses the Model Space ELEVATION value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Limmax
Accesses the current Model Space LIMMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Limmin
Accesses the current Model Space LIMMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Extmax
Accesses the current Model Space EXTMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Extmin
Accesses the current Model Space EXTMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Insbase
Accesses the current Model Space INSBASE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PucsOrthographic
Returns false if the database's paper space UCS does not have an orthographic view whose reference UCS matches the database's PUCSBASE system variable.

Autodesk.AutoCAD.DatabaseServices.Database.PucsBase
Accesses the object ID of the UcsTableRecord that defines the origin and orientation of orthographic UCS settings for the database's current paper space.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsname
Accesses the object ID of the UCS table entry that is currently in use in the Paper Space of the database (Paper Space value of UCSNAME).

Autodesk.AutoCAD.DatabaseServices.Database.Pucs
Sets the Paper Space UCS.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsydir
Accesses the current Paper Space UCSYDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsxdir
Accesses the current Paper Space UCSXDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pucsorg
Accesses the current Paper Space UCSORG value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pelevation
Accesses the current ELEVATION value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plimmax
Accesses the current LIMMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plimmin
Accesses the current LIMMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pextmax
Accesses the current EXTMAX value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pextmin
Accesses the current EXTMIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pinsbase
Accesses the current INSBASE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Celtscale
Accesses the current CELTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Cmlscale
Accesses the current CMLSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Cmljust
Accesses the current CMLJUST value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.CmlstyleID
Accesses the object ID of the MlineStyle specified by the current CMLSTYLEID value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Interferecolor
Accesses the color for interference objects as defined by the INTERFERECOLOR system variable.

Autodesk.AutoCAD.DatabaseServices.Database.Interferevpvs
Accesses the visual style for interference objects as defined by the INTERFEREVPVS system variable.

Autodesk.AutoCAD.DatabaseServices.Database.Interfereobjvs
Accesses the visual style for interference objects as defined by the INTERFEREOBJVS system variable.

Autodesk.AutoCAD.DatabaseServices.Database.DetailViewStyle
The Object ID of the current detail view style.

Autodesk.AutoCAD.DatabaseServices.Database.SectionViewStyle
The Object ID of the current section view style.

Autodesk.AutoCAD.DatabaseServices.Database.MLeaderscale
Accesses the current value of the MLEADERSCALE system variable for the database.

Autodesk.AutoCAD.DatabaseServices.Database.MLeaderstyle
Accesses the object ID of the MLeader style specified by the current CMLEADERSTYLE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tablestyle
Accesses object ID of the table style specified by the current CTABLESTYLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimstyle
Accesses the object ID of the dimstyle specified by the current DIMSTYLE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Celtype
Accesses the object ID of the linetype specified by the current CELTYPE value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.Textstyle
Accesses the current TEXTSTYLE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleNameId
Accesses the objectId of the entry in the PlotStyleName dictionary for the plotStyleName of the layer table record.

Autodesk.AutoCAD.DatabaseServices.Database.Handseed
Accesses the current HANDSEED value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Cetransparency
Gets and sets the current CETRANSPARENCY value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Cecolor
Accesses the current CECOLOR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdusrtimer
Accesses the current TDUSRTIMER value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdindwg
Accesses the current TDINDWG value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tduupdate
Accesses the current TDUUPDATE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tducreate
Accesses the current TDUCREATE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdupdate
Accesses the current TDUPDATE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tdcreate
Accesses the current TDCREATE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HpOrigin
Accesses a 2D point that is the current HPORIGIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.HpInherit
Accesses a bool indicating the current HPINHERIT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Menu
Accesses the menu display text.

Autodesk.AutoCAD.DatabaseServices.Database.Facetres
Accesses the current Model Space FACETRES value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamferd
Accesses the current CHAMFERD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamferc
Accesses the current CHAMFERC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamferb
Accesses the current CHAMFERB value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Chamfera
Accesses the current CHAMFERA value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr5
Returns the current USERR5 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr4
Returns the current USERR4 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr3
Returns the current USERR3 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr2
Returns the current USERR2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Userr1
Returns the current USERR1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plinewid
Accesses the current PLINEWID value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pdsize
Accesses the current PDSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Angbase
Accesses the current ANGBASE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.OleStartUp
Accesses the database's OLESTARTUP header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.XrefEditEnabled
Accesses the database's XEDIT value.

Autodesk.AutoCAD.DatabaseServices.Database.LineWeightDisplay
Accesses the line weight display status.

Autodesk.AutoCAD.DatabaseServices.Database.JoinStyle
Accesses the database's joinstyle header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.EndCaps
Accesses the database's endCaps header variable value.

Autodesk.AutoCAD.DatabaseServices.Database.Celweight
Accesses the LineWeight value indicating what the current line weight is for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Thickness
Accesses the current THICKNESS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Filletrad
Accesses the current FILLETRAD value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Sketchinc
Accesses the current SKETCHINC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Tracewid
Accesses the current TRACEWID value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Textsize
Accesses the current TEXTSIZE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Ltscale
Accesses the current LTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Isolines
Accesses the current ISOLINES value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Maxactvp
Accesses the current MAXACTVP value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Unitmode
Returns the current UNITMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Measurement
Accesses the current MEASUREMENT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Shadedif
Accesses the current SHADEDIF value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Shadedge
Accesses the current SHADEDGE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Splinetype
Accesses the current SPLINETYPE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surftab2
Accesses the current SURFTAB2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surftab1
Accesses the current SURFTAB1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surftype
Accesses the current SURFTYPE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surfv
Accesses the current SURFV value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Surfu
Accesses the current SURFU value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Splinesegs
Accesses the current SPLINESEGS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri5
Returns the current USERI5 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri4
Returns the current USERI4 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri3
Returns the current USERI3 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri2
Returns the current USERI2 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Useri1
Returns the current USERI1 value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Pdmode
Accesses the current PDMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Attmode
Accesses the current ATTMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Auprec
Accesses the current AUPREC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Aunits
Accesses the current AUNITS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Luprec
Accesses the current LUPREC value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Lunits
Accesses the current LUNITS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Treedepth
Accesses the current TREEDEPTH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Visretain
Accesses the current VISRETAIN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plimcheck
Accesses the current Paper Space LIMCHECK value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Worldview
Accesses the current WORLDVIEW value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Mirrtext
Accesses the current MIRRTEXT value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.XclipFrame
Accesses the value of the XCLIPFRAME header variable.

Autodesk.AutoCAD.DatabaseServices.Database.Splframe
Accesses the current SPLFRAME value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Angdir
Accesses the current ANGDIR value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Skpoly
Accesses the current SKPOLY value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Usrtimer
Returns the current USRTIMER value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PlineEllipse
Accesses the current PELLIPSE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.DispSilh
Accesses the current DISPSILH value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Saveproxygraphics
Accesses the current PROXYGRAPHICS value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Limcheck
Accesses the current Model Space LIMCHECK value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Psltscale
Accesses the current PSLTSCALE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Qtextmode
Accesses the current QTEXTMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Fillmode
Accesses the current FILLMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Regenmode
Accesses the current REGENMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Orthomode
Accesses the current ORTHOMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Plinegen
Accesses the current PLINEGEN value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimsho
Accesses the current DIMSHO value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.Dimaso
Accesses the current DIMASO value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.SecurityParameters
Accesses the security parameters associated with this database.

Autodesk.AutoCAD.DatabaseServices.Database.IsEmr
Returns the EMR flag for the database.

Autodesk.AutoCAD.DatabaseServices.Database.RetainOriginalThumbnailBitmap
Accesses the status of the thumbnail bitmap toggle flag.

Autodesk.AutoCAD.DatabaseServices.Database.ThumbnailBitmap
Accesses the thumbnail bitmap image.

Autodesk.AutoCAD.DatabaseServices.Database.XrefBlockId
Accesses the object ID of the BlockTableRecord which refers to this database as an xref.

Autodesk.AutoCAD.DatabaseServices.Database.MaintenanceReleaseVersion
Determines which point release of AutoCAD created this database.

Autodesk.AutoCAD.DatabaseServices.Database.UndoRecording
Returns true if undo recording is enabled for the database.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileSavedByMaintenanceVersion
Accesses the maintenance version value of the last AutoCAD product which saved the drawing file, not counting the current session.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileMaintenanceVersion
Accesses the maintenance version value that the database file had when it was first opened.

Autodesk.AutoCAD.DatabaseServices.Database.LastSavedAsMaintenanceVersion
Accesses the maintenance version that the current drawing was last saved as in the current session.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileSavedByVersion
Accesses the version value of the last AutoCAD product which saved the drawing file, not counting the current session.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileVersion
Accesses the version value that the database file had when it was first opened.

Autodesk.AutoCAD.DatabaseServices.Database.LastSavedAsVersion
Accesses the version that the current drawing was last saved as in the current session.

Autodesk.AutoCAD.DatabaseServices.Database.OriginalFileName
Accesses the file name that the database was originally opened under.

Autodesk.AutoCAD.DatabaseServices.Database.NumberOfSaves
Accesses the number of times the database has been saved in the current session, or zero if it has not been saved in the current session.

Autodesk.AutoCAD.DatabaseServices.Database.ApproxNumObjects
Returns a value that is at least as large as the number of objects in the database.

Autodesk.AutoCAD.DatabaseServices.Database.NeedsRecovery
Returns true if the database was read from a drawing file and there were read errors, but the errors were not significant enough to cause the ReadDwgFile() method to throw an error exception.

Autodesk.AutoCAD.DatabaseServices.Database.DataLinkManager
Returns the ID of the data link manager.

Autodesk.AutoCAD.DatabaseServices.Database.DataLinkDictionaryId
Accesses the data link's dictionary ID.

Autodesk.AutoCAD.DatabaseServices.Database.SectionManagerId
Accesses the section manager associated with this database.

Autodesk.AutoCAD.DatabaseServices.Database.DetailViewStyleDictionaryId
The Object ID of the detail view style dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.SectionViewStyleDictionaryId
The Object ID of the section view style dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.MLeaderStyleDictionaryId
For the ACAD_MLEADERSTYLE dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.TableStyleDictionaryId
Accesses the object ID of the table style dictionary in named object dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.CurrentSpaceId
Accesses the object ID of the BlockTableRecord of the current space (e.g., model space or paper space.).

Autodesk.AutoCAD.DatabaseServices.Database.PaperSpaceVportId
Accesses the object ID of the paperspace Viewport for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ByBlockLinetype
Returns the object ID of the BYBLOCK LinetypeTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ByLayerLinetype
Returns the object ID of the BYLAYER LinetypeTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ContinuousLinetype
Accesses the object ID of the continuous linetype LinetypeTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LayerZero
Accesses the object ID of the layer 0 LayerTableRecord for the database.

Autodesk.AutoCAD.DatabaseServices.Database.PlotSettingsDictionaryId
Accesses the object ID of the ACAD_PLOTSETTINGS dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.NamedObjectsDictionaryId
Accesses the object ID of the database's NamedObjects dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.ColorDictionaryId
Accesses the object ID of the database's color dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.VisualStyleDictionaryId
Accesses the object ID of the ACAD_VISUALSTYLE dictionary, which contains objects of type VisualStyle.

Autodesk.AutoCAD.DatabaseServices.Database.MaterialDictionaryId
Accesses the object ID of the ACAD_MATERIAL dictionary, which contains objects of type Material.

Autodesk.AutoCAD.DatabaseServices.Database.PlotStyleNameDictionaryId
Accesses the object ID of the database's plot style name dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.LayoutDictionaryId
Accesses the object ID of the ACAD_LAYOUT dictionary, which contains objects of type Layout.

Autodesk.AutoCAD.DatabaseServices.Database.GroupDictionaryId
Accesses the object ID of the database's Group dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.MLStyleDictionaryId
Accesses the object ID of the database's MLStyle dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.DimStyleTableId
Accesses the object ID of the database's DimStyleTable.

Autodesk.AutoCAD.DatabaseServices.Database.RegAppTableId
Accesses the object ID of the database's RegAppTable.

Autodesk.AutoCAD.DatabaseServices.Database.ViewportTableId
Accesses the object ID of the database's ViewportTable.

Autodesk.AutoCAD.DatabaseServices.Database.UcsTableId
Accesses the object ID of the database's UCSTable.

Autodesk.AutoCAD.DatabaseServices.Database.ViewTableId
Accesses the object ID of the database's ViewTable.

Autodesk.AutoCAD.DatabaseServices.Database.TextStyleTableId
Accesses the object ID of the database's TextStyleTable.

Autodesk.AutoCAD.DatabaseServices.Database.BlockTableId
Returns the object ID of the database's BlockTable.

Autodesk.AutoCAD.DatabaseServices.Database.Clayer
Accesses the object ID of the LAYER specified by the current CLAYER value of the database.

Autodesk.AutoCAD.DatabaseServices.Database.TileMode
Accesses the current TILEMODE value for the database.

Autodesk.AutoCAD.DatabaseServices.Database.ObjectContextManager
Accesses the object context manager.

Autodesk.AutoCAD.DatabaseServices.Database.LayerStateManager
Accesses Class the layer state manager.

Autodesk.AutoCAD.DatabaseServices.Database.TransactionManager
Accesses the TransactionManager for the database.

Autodesk.AutoCAD.DatabaseServices.Database.LinetypeTableId
Accesses the object ID of the database's LinetypeTable.

Autodesk.AutoCAD.DatabaseServices.Database.LayerTableId
Accesses the object ID of the database's LayerTable.