Autodesk.AutoCAD.DatabaseServices.AssocVertexActionParam
This wraps the ObjectARX AcDbAssocVertexActionParam class.

Autodesk.AutoCAD.DatabaseServices.AssocVertexActionParam.#ctor
This wraps the ObjectARX AssocVertexActionParam::AcDbAssocVertexActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocVertexActionParam.SetVertexRef(Autodesk.AutoCAD.DatabaseServices.VertexRef,System.Boolean,System.Boolean)
This wraps the ObjectARX AssocVertexActionParam::setVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocVertexActionParam.GetVertexRef
This wraps the ObjectARX AssocVertexActionParam::getVertexRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocVertexActionParam.DependentOnCompoundObject
This wraps the ObjectARX AcDbAssocVertexActionParam::getDependentOnCompoundObject() method.