Autodesk.AutoCAD.DatabaseServices.PointCoincidenceConstraint
This class represents a PointCoincidence (coincident) constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.PointCoincidenceConstraint.#ctor
Default constructor.