Autodesk.AutoCAD.Runtime.ExtensionLoader
Class used to load an extension, the caller can supply an alternative ExtensionApplicationHolder.

Autodesk.AutoCAD.Runtime.ExtensionLoader.Load(System.String)
Loads the specified assembly.
fileName:  Input filename to load

Autodesk.AutoCAD.Runtime.ExtensionLoader.IsLoaded(System.String)
Indicates whether the specified assembly is loaded.
fileName:  Input filename to check to see if it is loaded

Autodesk.AutoCAD.Runtime.ExtensionLoader.DeferredAssemblyLoad
Listens to the background thread for assemblies to be loaded, and then when it is safe, the assemblies are loaded.