Autodesk.AutoCAD.DatabaseServices.UnderlayLayerCollection
This class provides a collection for UnderlayLayer objects.

Autodesk.AutoCAD.DatabaseServices.UnderlayLayerCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.UnderlayLayer[],System.Int32)
Copies the underlay layers to the collection from the specified index.

Autodesk.AutoCAD.DatabaseServices.UnderlayLayerCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.UnderlayLayerCollection.Count
Returns the number of layers in the collection.