Autodesk.AutoCAD.DatabaseServices.Font
This structure represent the font information needed in the text editor.

Autodesk.AutoCAD.DatabaseServices.Font.#ctor(System.String,System.Boolean)
Constructor.

Autodesk.AutoCAD.DatabaseServices.Font.IsTrueType
Indicates whether the font is true type.

Autodesk.AutoCAD.DatabaseServices.Font.Name
Gets the name of the font.