Autodesk.AutoCAD.Geometry.Plane
This .NET class wraps the AcGePlane ObjectARX class.

Autodesk.AutoCAD.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructor.
a:  Input coordinate a
b:  Input coordinate b
c:  Input coordinate c
d:  Input coordinate d

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs the plane with origin=or, uAxis=v1, and vAxis=v2.
origin:  Input origin
u:  Input point U on U axis
v:  Input point V on V axis

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs the plane with origin=or, uAxis=v1, and vAxis=v2.
u:  Input point U on U axis
origin:  Input origin
v:  Input point V on V axis

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs the plane with origin=pnt, uAxis= normal.perpVector(), and vAxis=normal.crossProduct(uAxis).
origin:  Input origin of plane
normal:  Input normal vector

Autodesk.AutoCAD.Geometry.Plane.#ctor(Autodesk.AutoCAD.Geometry.Plane)
Copy constructor.
source:  Another plane

Autodesk.AutoCAD.Geometry.Plane.#ctor
Constructor.

Autodesk.AutoCAD.Geometry.Plane.GetSignedDistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Returns the signed distance from the point pointValue to this plane.
pointValue:  Input point

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane)
This method calls Plane.IntersectWith(BoundedPlane boundPlane, Tolerance tolerance) with tolerance set to Global.
boundPlane:  Input bounded plane

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this plane and the bounded plane boundPlane are non-parallel.
boundPlane:  Input bounded plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane)
This method calls Plane.IntersectWith(Plane otherPlane, Tolerance tolerance) with tolerance set to Global.
otherPlane:  Input other plane

Autodesk.AutoCAD.Geometry.Plane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this plane and the plane otherPlane are non-parallel.
otherPlane:  Input other plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Plane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets this plane to the plane with origin, U axis u, and V axis v.
origin:  Input origin
u:  Input point u
v:  Input point v

Autodesk.AutoCAD.Geometry.Plane.Set(System.Double,System.Double,System.Double,System.Double)
Sets this plane to the plane satisfying the equation
a*x + b*y + c*z + d = 0
The parameterization of this plane is set in the following way: origin is the closest point on the plane to the point (0,0,0), uAxis= norm.perpVector() and vAxis=norm.crossProduct(uAxis), where the vector normal is vec.normal().
a:  Input coordinate a
b:  Input coordinate b
c:  Input coordinate c
d:  Input coordinate d

Autodesk.AutoCAD.Geometry.Plane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Sets this plane to the plane with origin, uAxis=v1, and vAxis=v2.
u:  Input point U
origin:  Input origin
v:  Input point V

Autodesk.AutoCAD.Geometry.Plane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets this plane to the plane with origin=pointValue, u= normal.perpVector() and v=normal.crossProduct(u).
pointValue:  Input origin point
normal:  Input vector normal