Autodesk.AutoCAD.DatabaseServices.CellRange
This class represents ranges of table cells.

Autodesk.AutoCAD.DatabaseServices.CellRange.op_Equality(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange)
Returns true if the values within the two cells (each row and column) is equal.
t1:  Input Autodesk.AutoCAD.DatabaseServices.CellRange object for left operator.
t2:  Input Autodesk.AutoCAD.DatabaseServices.CellRange object for right operator.

Autodesk.AutoCAD.DatabaseServices.CellRange.op_Inequality(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange)
Returns true if the two cells do not match.
t1:  Input Autodesk.AutoCAD.DatabaseServices.CellRange object for left operator.
t2:  Input Autodesk.AutoCAD.DatabaseServices.CellRange object for right operator.

Autodesk.AutoCAD.DatabaseServices.CellRange.Equals(System.Object)
Returns true if the two CellRange objects match.
pRange:  Input range to check against.

Autodesk.AutoCAD.DatabaseServices.CellRange.GetHashCode
Returns a hash code for the specific cell.

Autodesk.AutoCAD.DatabaseServices.CellRange.BottomRight
Returns the Cell from the bottom row.

Autodesk.AutoCAD.DatabaseServices.CellRange.TopLeft
Returns the Cell in the top left.

Autodesk.AutoCAD.DatabaseServices.CellRange.RightColumn
Returns the index of the right column.

Autodesk.AutoCAD.DatabaseServices.CellRange.BottomRow
Returns the index of the bottom row.

Autodesk.AutoCAD.DatabaseServices.CellRange.LeftColumn
Returns the index of the left column.

Autodesk.AutoCAD.DatabaseServices.CellRange.TopRow
Returns the index of the top row.