Autodesk.AutoCAD.DatabaseServices.Extents3d
This .NET class wraps the AcDbExtents ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Extents3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor creates a new 3D Extents using Point 3D values.
min:  Input minimum extent
max:  Input maximum extent

Autodesk.AutoCAD.DatabaseServices.Extents3d.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Extents3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Set MinPoint to min and MaxPoint to max if each of the X, Y, and Z values of min are less than or equal to the corresponding values of max.
min:  Input minimum extent
max:  Input maximum extent

Autodesk.AutoCAD.DatabaseServices.Extents3d.AddPoint(Autodesk.AutoCAD.Geometry.Point3d)
Expand this box to also enclose the point pt.
pt:  Input 3D point

Autodesk.AutoCAD.DatabaseServices.Extents3d.AddExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Expand the box defined by this object to also enclose the box defined by source.
source:  Input another Extents3d object

Autodesk.AutoCAD.DatabaseServices.Extents3d.AddBlockExtents(Autodesk.AutoCAD.DatabaseServices.BlockTableRecord)
Compute the minimum box that encloses all of the entities in the block pointed to by pointerToBlockTableRecord and the box already defined by this object.
pointerToBlockTableRecord:  Pointer to a block table record

Autodesk.AutoCAD.DatabaseServices.Extents3d.ExpandBy(Autodesk.AutoCAD.Geometry.Vector3d)
Expand this box by the amount in the vector.
vector:  Input 3D vector

Autodesk.AutoCAD.DatabaseServices.Extents3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transform the eight corners of the current box by this matrix and compute the box that encloses the current box and those points.
mat:  Input 3D transformation matrix

Autodesk.AutoCAD.DatabaseServices.Extents3d.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to compare

Autodesk.AutoCAD.DatabaseServices.Extents3d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents3d)
This method returns a value indicating whether the minimum and maximum points of a are equivalent to those of this object.
a:  Input object to compare

Autodesk.AutoCAD.DatabaseServices.Extents3d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents3d,Autodesk.AutoCAD.Geometry.Tolerance)
This method returns a value indicating whether the minimum and maximum points of a are equivalent, within the tolerance range specified by tolerance, to those of this object.
a:  Input object to compare
tolerance:  Input tolerance to check against

Autodesk.AutoCAD.DatabaseServices.Extents3d.op_Inequality(Autodesk.AutoCAD.DatabaseServices.Extents3d,Autodesk.AutoCAD.DatabaseServices.Extents3d)
Returns true if a is not equivalent to b.
a:  Left-hand operand
b:  Right-hand operand

Autodesk.AutoCAD.DatabaseServices.Extents3d.op_Equality(Autodesk.AutoCAD.DatabaseServices.Extents3d,Autodesk.AutoCAD.DatabaseServices.Extents3d)
Returns true if a is equivalent to b.
a:  Left-hand operand
b:  Right-hand operand

Autodesk.AutoCAD.DatabaseServices.Extents3d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format.
format:  Input format to display
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents3d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.Extents3d.MaxPoint
Accesses the maximum point.

Autodesk.AutoCAD.DatabaseServices.Extents3d.MinPoint
Accesses the miniimum point.