Autodesk.AutoCAD.Geometry.Matrix2dInfo
This value type encapsulates the data returned by the Matrix2d.IsConformal() ObjectARX function.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Matrix2dInfo.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Matrix2dInfo.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2dInfo)
Compares this object to other object and returns true if they are equal.
a:  Input object to check against

Autodesk.AutoCAD.Geometry.Matrix2dInfo.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix2dInfo,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a against this object for equivalency within the tolerance range specified by tolerance.
a:  Input object to check against
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Matrix2dInfo.op_Inequality(Autodesk.AutoCAD.Geometry.Matrix2dInfo,Autodesk.AutoCAD.Geometry.Matrix2dInfo)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix2dInfo.op_Equality(Autodesk.AutoCAD.Geometry.Matrix2dInfo,Autodesk.AutoCAD.Geometry.Matrix2dInfo)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix2dInfo.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Reflex
Returns the Reflex property value.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.IsMirror
Returns the IsMirror property value.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Angle
Returns the Angle property value.

Autodesk.AutoCAD.Geometry.Matrix2dInfo.Scale
Returns scale factor of matrix.