Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits
This .NET class wraps the AcGiVisualStyleTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.VisualStyleTraits.AcGiVisualStyle
Returns VisualStyle const reference to the visual style that is currently captured in this traits object.