Autodesk.AutoCAD.Geometry.Cone
This .NET class wraps the AcGeCone ObjectARX class.

Autodesk.AutoCAD.Geometry.Cone.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Constructs a conic segment defined by the input data.
cosineAngle:  Input cosine of the angle formed by cone generator and its axis
sineAngle:  Input sine of the angle formed by cone generator and its axis
baseOrigin:  Input center of the circular base
baseRadius:  Input radius of the circular base
axisOfSymmetry:  Input cone's axis of rotation
height:  Input height of the cone
startAngle:  Input start parameter on the base circle
endAngle:  Input end parameter on the base circle
refAxis:  Input reference vector on base

Autodesk.AutoCAD.Geometry.Cone.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a full circular cone defined by the input data.
cosineAngle:  Input cosine of the angle formed by cone generator and its axis
sineAngle:  Input sine of the angle formed by cone generator and its axis
baseOrigin:  Input center of the circular base
baseRadius:  Input radius of the circular base
axisOfSymmetry:  Input cone's axis of rotation

Autodesk.AutoCAD.Geometry.Cone.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Cone.GetAngles
Returns as parameters the start and end angles on the cone's base.

Autodesk.AutoCAD.Geometry.Cone.GetHalfAngles
Computes cosine and sine of the angle between the axis and a generator.

Autodesk.AutoCAD.Geometry.Cone.GetHeightAt(System.Double)
Computes a range of parameters on the axis corresponding to the points belonging to the cone.
parameter:  Input output interval on the axis

Autodesk.AutoCAD.Geometry.Cone.IsClosed
This method calls Cone.IsClosed(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Cone.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if conic segment is a full circular cone with respect to the tolerance.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Cone.SetAngles(System.Double,System.Double)
Resets cone's definition parameters to the ones specified by input data.
startAngle:  Input start parameter on base circle
endAngle:  Input end parameter on base circle

Autodesk.AutoCAD.Geometry.Cone.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Interval,System.Double,System.Double)
Resets cone's definition parameters to the ones specified by input data.
cosineAngle:  Input cosine of the angle between axis and a generator
sineAngle:  Input sine of the angle between axis and a generator
baseCenter:  Input center of the base
baseRadius:  Input radius of the base
axisOfSymmetry:  Input axis of rotation
refAxis:  Input reference vector on the base circle
height:  Input interval on cone's axis
startAngle:  Input start parameter on base circle
endAngle:  Input end parameter on base circle

Autodesk.AutoCAD.Geometry.Cone.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Resets cone's definition parameters to the ones specified by input data.
cosineAngle:  Input cosine of the angle between axis and a generator
sineAngle:  Input sine of the angle between axis and a generator
baseCenter:  Input center of the base
baseRadius:  Input radius of the base
axisOfSymmetry:  Input axis of rotation

Autodesk.AutoCAD.Geometry.Cone.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls Cone.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.Cone.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersections between the cone and a linear entity.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Cone.Apex
Returns cone's vertex.

Autodesk.AutoCAD.Geometry.Cone.ReferenceAxis
Returns reference vector on the base circle.

Autodesk.AutoCAD.Geometry.Cone.AxisOfSymmetry
Returns the axis of the cone.

Autodesk.AutoCAD.Geometry.Cone.IsOuterNormal
Returns a flag indicating if the cone's normal is pointing out towards the closed cone.

Autodesk.AutoCAD.Geometry.Cone.Height
Computes a range of parameters on the axis corresponding to the points belonging to the cone.

Autodesk.AutoCAD.Geometry.Cone.HalfAngle
Returns angle between the axis and a generator.

Autodesk.AutoCAD.Geometry.Cone.BaseCenter
Returns the center of the base.

Autodesk.AutoCAD.Geometry.Cone.BaseRadius
Accesses the radius of the base for the cone.