Autodesk.AutoCAD.GraphicsInterface.LightAttenuation
This .NET class wraps the AcGiLightAttenuation ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.SetLimits(System.Double,System.Double)
Sets the distance (a range) from the light source where emitted light affects the model.
startLimit:  Input distance from the light source where light begins to affect to model; objects closer than this are not affected by the light
endLimit:  Input distance from the light source beyond which the light has no effect

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.GetHashCode
Overloads for the LightAttenuation.GetHashCode method.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.EndLimit
Returns the distance from the light source beyond which the light has no effect.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.StartLimit
Returns the distance from the light source where light begins to affect the model; objects closer than this are not affected by the light.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.UseLimits
Returns true if start and end limit are being used.

Autodesk.AutoCAD.GraphicsInterface.LightAttenuation.AttenuationType
Returns the attenuation type for the light.