Autodesk.AutoCAD.DatabaseServices.ConstrainedCurve
This class represents a constrained curve node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedCurve.ConstrainedImplicitPoints
Gets the array of references to ConstrainedImplicitPoint objects which belong to this constrained curve.

Autodesk.AutoCAD.DatabaseServices.ConstrainedCurve.IsBounded
Indicates whether this constrained curve is bounded.