Autodesk.AutoCAD.Geometry.Position2d
This .NET class wraps the AcGePosition2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Position2d.#ctor(System.Double,System.Double)
Constructs a 2D position object that has the specified coordinates.

Autodesk.AutoCAD.Geometry.Position2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d)
Constructs a 2D position object with the same coordinates as the input point.
point:  Input any 2D point object

Autodesk.AutoCAD.Geometry.Position2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Position2d.Set(System.Double,System.Double)
Changes the coordinates of the 2D position object to the input coordinates.
y:  _nt_

Autodesk.AutoCAD.Geometry.Position2d.Set(Autodesk.AutoCAD.Geometry.Point2d)
Changes the coordinates of the 2D position object to have the same coordinates as the input point.
point:  Input any 2D point