Autodesk.AutoCAD.DatabaseServices.ViewTableRecord
This .NET class wraps the AcDbViewTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.DisassociateUcsFromView
Disassociates the ucs from this view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.Thumbnail
Returns the packed BITMAPINFO structure of the thumbnail with the thumbnail data following it immediately in memory.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.AnnotationScale
This function returns a pointer to the AnnotationScale object associated with the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.LiveSection
Returns a live section to be associated with a view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.ViewAssociatedToViewport
Returns a flag to indicate whether or not the view is associated with a paperspace viewport.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.Layout
Returns the layout of the view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.LayerState
Returns the name of the layer state.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.CategoryName
Returns the name of the category of the view.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.IsUcsAssociatedToView
Returns true if this view table record has an associated ucs.

Autodesk.AutoCAD.DatabaseServices.ViewTableRecord.IsPaperspaceView
Returns true if this ViewTableRecord is a Paper Space view.