Autodesk.AutoCAD.GraphicsSystem.Device
This .NET class wraps the AcGsDevice ObjectARX class.

Autodesk.AutoCAD.GraphicsSystem.Device.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsSystem.Device.Invalidate
Flags the entire device area as invalid.

Autodesk.AutoCAD.GraphicsSystem.Device.Update
This message is propagated to all owned Views, and it forces the correct picture to be displayed by the GS.

Autodesk.AutoCAD.GraphicsSystem.Device.OnSize(System.Drawing.Size)
This function should be called whenever the size of the device changes.
size:  Input width and height of device in pixels.

Autodesk.AutoCAD.GraphicsSystem.Device.OnRealizeForegroundPalette
Tells the device to realize its palette in the foreground and is typically called by the client when the GUI window receives focus.

Autodesk.AutoCAD.GraphicsSystem.Device.OnRealizeBackgroundPalette
Tells the device to realize its palette in the background and is typically called by the client when the GUI window loses focus.

Autodesk.AutoCAD.GraphicsSystem.Device.OnDisplayChange(System.Int32,System.Int32,System.Int32)
Tells the device that the Operating System Color Depth and/or Screen Resolution has changed, with the arguments being the new number of bits per pixel and the X and Y resolution, respectively.
bitsPerPixel:  Input new number of bits per pixel.
xRes:  Input X resolution.
yRes:  Input Y resolution.

Autodesk.AutoCAD.GraphicsSystem.Device.Add(Autodesk.AutoCAD.GraphicsSystem.View)
Adds a view to be displayed on the device.
view:  Input view to be displayed on the device.

Autodesk.AutoCAD.GraphicsSystem.Device.Erase(Autodesk.AutoCAD.GraphicsSystem.View)
Removes the view pointed to by view from the device.
view:  Input view to be removed from the device.

Autodesk.AutoCAD.GraphicsSystem.Device.EraseAll
Removes all views from the device.

Autodesk.AutoCAD.GraphicsSystem.Device.GetSnapshot(System.Drawing.Rectangle)
Gets a snapshot of the current graphics state of the device.
rectangle:  Input region of snapshot.

Autodesk.AutoCAD.GraphicsSystem.Device.DeviceRenderType
Controls renderer type set by Device.

Autodesk.AutoCAD.GraphicsSystem.Device.BackgroundColor
Returns the current background color of the device.

Autodesk.AutoCAD.GraphicsSystem.Device.IsValid
Returns true when the device has the correct picture (no invalid flags or regions, no rasterization left to perform, and the rendering pipeline has been fully flushed of any queued drawing commands).