Autodesk.AutoCAD.DatabaseServices.ImageBackground
This .NET class wraps the AcDbImageBackground ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.Scale
Accesses the scale values.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.Offset
Accesses the image offset.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.UseTiling
Accesses the image tiling property.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.MaintainAspectRatio
Accesses the value indicating the use of aspect ratio of the image file.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.FitToScreen
Accesses the value indicating if image background needs to be fit to the screen or not.

Autodesk.AutoCAD.DatabaseServices.ImageBackground.ImageFileName
Accesses the image file name associated with this background.