Autodesk.AutoCAD.DatabaseServices.IdPair
This .NET class wraps the AcDbIdPair ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.IdPair.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean,System.Boolean)
This constructor allows the creation of an IdPair object with all internal data specified in the arguments passed in.
key:  Input objectId to use as the key
value:  Input objectId to use as the value
isCloned:  Input Boolean indicating if it has been cloned already
isPrimary:  Input Boolean indicating if it is a primary object
isOwnerTranslated:  Input Boolean indicating if its owner has already been translated

Autodesk.AutoCAD.DatabaseServices.IdPair.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Culture-specific format

Autodesk.AutoCAD.DatabaseServices.IdPair.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.IdPair.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to compare against

Autodesk.AutoCAD.DatabaseServices.IdPair.op_Inequality(Autodesk.AutoCAD.DatabaseServices.IdPair,Autodesk.AutoCAD.DatabaseServices.IdPair)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.IdPair.op_Equality(Autodesk.AutoCAD.DatabaseServices.IdPair,Autodesk.AutoCAD.DatabaseServices.IdPair)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.IdPair.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.IdPair.IsOwnerTranslated
Assesses if the owner has been translated.

Autodesk.AutoCAD.DatabaseServices.IdPair.IsPrimary
Assesses if the key object is part of the primary set of objects being cloned, or if it was "deep cloned" because it was owned by a cloned primary object.

Autodesk.AutoCAD.DatabaseServices.IdPair.IsCloned
Assesses if the key object has been cloned.

Autodesk.AutoCAD.DatabaseServices.IdPair.Value
Accesses the value (which is the objectId of the cloned object).

Autodesk.AutoCAD.DatabaseServices.IdPair.Key
Accesses the key (which is the objectId of the original object).