Autodesk.AutoCAD.DatabaseServices.Helix
This .NET class wraps the AcDbHelix ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Helix.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Helix.CreateHelix
Creates the helix geometry based on the values set in prior function calls.

Autodesk.AutoCAD.DatabaseServices.Helix.GetAxisPoint
Returns the start point of the axis for the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.SetAxisPoint(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
Sets the start point of the axis for the helix.
axisPoint:  Input the 3D point where the axis starts
moveStartPoint:  Input Boolean indicating whether to relocate the start point by the same offset that the axis point moved

Autodesk.AutoCAD.DatabaseServices.Helix.TotalLength
Accesses the total length of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.TurnSlope
Accesses the turn slope angle of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.Constrain
Accesses the constrain property of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.Twist
Accesses the twist of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.TurnHeight
Accesses the turn height (distance between turns).

Autodesk.AutoCAD.DatabaseServices.Helix.Turns
Accesses the number of turns (revolutions).

Autodesk.AutoCAD.DatabaseServices.Helix.TopRadius
Accesses the top radius of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.BaseRadius
Accesses the base radius of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.Height
Accesses the height of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.AxisVector
Accesses the vector for the axis of the helix.

Autodesk.AutoCAD.DatabaseServices.Helix.StartPoint
Accesses the start point of the helix.