Autodesk.AutoCAD.GraphicsInterface.MaterialTraits
This .NET class wraps the AcGiMaterialTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.FinalGather
Returns the final gathering mode.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.GlobalIllumination
Returns the global illumination mode.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.NormalMap
Stores to a pointer the material map for the normal map channel of the material, the method used to compute the normal map, and the channel strength.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Luminance
Obtains the luminance value.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.LuminanceMode
Obtains the Luminance Mode.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.TwoSided
Obtains whether the material traits represent a two sided material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.TransmittanceScale
Obtains the Advanced Material parameter Transmittance Scale.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.ReflectanceScale
Obtains the Advanced Material parameter Reflectance Scale.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.IndirectBumpScale
Obtains the Advanced Material parameter Indirect Bump Scale.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.ColorBleedScale
Obtains the Advanced Material parameter Color Bleed Scale.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Opacity
Returns the opacity component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Refraction
Returns the refraction component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Specular
Returns the specular component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Diffuse
Returns the diffuse component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Mode
Returns the mode of this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.ChannelFlags
Returns the material channels in use by this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.IlluminationModel
Returns the illumination model set on this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Reflectivity
Returns the reflectivity of this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.SelfIllumination
Returns the self-illumination value of this material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Translucence
Returns the translucence value of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Bump
Returns the bump component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Reflection
Returns the reflection component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialTraits.Ambient
Returns the ambient component of the material.