Autodesk.AutoCAD.DatabaseServices.BeginWblockBlockEventArgs
This class provides data for the BeginWblockBlock event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockBlockEventArgs.BlockId
Gets the object ID of the block being wblock'ed.

Autodesk.AutoCAD.DatabaseServices.BeginWblockBlockEventArgs.From
Gets the database being wblock'ed.