Autodesk.AutoCAD.DatabaseServices.BlendOptions
The wraps the ObjectARX AcDbBlendOptions class.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.#ctor
This wraps the ObjectARX AcDbBlendOptions::AcDbBlendOptions() method.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.DriveMode
This wraps the ObjectARX AcDbBlendOptions::driveMode () method.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.CoplanarDirection
This wraps the ObjectARX AcDbBlendOptions::coplanarDirection () method.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.CoplanarPoint
This wraps the ObjectARX AcDbBlendOptions::coplanarPoint() method.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.Quality
This wraps the ObjectARX AcDbBlendOptions::quality() method.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.Solid
This wraps the ObjectARX AcDbBlendOptions::solid() method.

Autodesk.AutoCAD.DatabaseServices.BlendOptions.Simplify
This wraps the ObjectARX AcDbBlendOptions::simplify() method.