Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut
This class is a container for the Boolean values output by the LoftOptions.checkLoftCurves() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.AllPlanar
Indicates whether all of the cross-section curves are planar.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.AllClosed
Indicates whether all of the cross-section curves are closed.

Autodesk.AutoCAD.DatabaseServices.LoftOptionsCheckCurvesOut.AllOpen
Indicates whether all of the cross-section curves are open.