Autodesk.AutoCAD.DatabaseServices.Surface
This .Net class wraps the ObjectARX class AcDbSurface.

Autodesk.AutoCAD.DatabaseServices.Surface.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateFrom(Autodesk.AutoCAD.DatabaseServices.Entity)
This is CreateFrom, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.ConvertToRegion
This is ConvertToRegion, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.Thicken(System.Double,System.Boolean)
This is Thicken, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.GetArea
This is GetArea, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateInterferenceObjects(Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
This .NET method wraps the ObjectARX method AcDbSurface::createInterferenceObjects().

Autodesk.AutoCAD.DatabaseServices.Surface.BooleanUnion(Autodesk.AutoCAD.DatabaseServices.Surface)
This is BooleanUnion, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.BooleanSubtract(Autodesk.AutoCAD.DatabaseServices.Solid3d)
This is BooleanSubtract, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.BooleanSubtract(Autodesk.AutoCAD.DatabaseServices.Surface)
This is BooleanSubtract, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.BooleanIntersect(Autodesk.AutoCAD.DatabaseServices.Solid3d)
This is BooleanIntersect, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.BooleanIntersect(Autodesk.AutoCAD.DatabaseServices.Surface)
This is BooleanIntersect, a member of class Surface.

Autodesk.AutoCAD.DatabaseServices.Surface.ImprintEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
Overloads for the Surface.ImprintEntity method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateSectionObjects(Autodesk.AutoCAD.Geometry.Plane)
This .NET method wraps the ObjectARX method AcDbSurface::createSectionObjects Method.

Autodesk.AutoCAD.DatabaseServices.Surface.SliceByPlane(Autodesk.AutoCAD.Geometry.Plane)
This .NET method wraps the ObjectARX method AcDbSurface::sliceByPlane Method.

Autodesk.AutoCAD.DatabaseServices.Surface.SliceBySurface(Autodesk.AutoCAD.DatabaseServices.Surface)
This .NET method wraps the ObjectARX method AcDbSurface::sliceBySurface Method.

Autodesk.AutoCAD.DatabaseServices.Surface.ChamferEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.SubentityId,System.Double,System.Double,System.Boolean)
This wraps AcDbSurface::chamferEdges() method.

Autodesk.AutoCAD.DatabaseServices.Surface.ChamferEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.SubentityId,System.Double,System.Double)
This .NET method wraps the ObjectARX method AcDbSurface::chamferEdges Method.

Autodesk.AutoCAD.DatabaseServices.Surface.FilletEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double,System.Boolean)
This wraps the ObjectARX AcDbSurface::filletEdges() method.

Autodesk.AutoCAD.DatabaseServices.Surface.FilletEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
This .NET method wraps the ObjectARX method AcDbSurface::filletEdges.

Autodesk.AutoCAD.DatabaseServices.Surface.SetSubentityColor(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Colors.Color)
This .NET method wraps the ObjectARX method AcDbSurface::setSubentColor Method.

Autodesk.AutoCAD.DatabaseServices.Surface.GetSubentityColor(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSurface::getSubentColor Method.

Autodesk.AutoCAD.DatabaseServices.Surface.SetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This .NET method wraps the ObjectARX method AcDbSurface::setSubentMaterial Method.

Autodesk.AutoCAD.DatabaseServices.Surface.GetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSurface::getSubentMaterial Method.

Autodesk.AutoCAD.DatabaseServices.Surface.SetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.GraphicsInterface.Mapper)
This .NET method wraps the ObjectARX method AcDbSurface::setSubentMaterialMapper Method.

Autodesk.AutoCAD.DatabaseServices.Surface.GetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSurface::getSubentMaterialMapper.

Autodesk.AutoCAD.DatabaseServices.Surface.ProjectOnToSurface(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Vector3d)
This wraps the ObjectARX AcDbSurface::projectOnToSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.RayTest(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&,Autodesk.AutoCAD.Geometry.DoubleCollection&)
This wraps the ObjectARX AcDbSurface::rayTest() method.

Autodesk.AutoCAD.DatabaseServices.Surface.ConvertToNurbSurface
This wraps the ObjectARX AcDbSurface::convertToNurbSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateExtrudedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
This wraps the ObjectARX AcDbSurface::createExtrudedSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateExtrudedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions,System.Boolean)
This wraps the ObjectARX AcDbSurface::createExtrudedSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateRevolvedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.DatabaseServices.Profile3d,System.Boolean,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
This wraps the ObjectARX AcDbSurface::createRevolvedSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateRevolvedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.DatabaseServices.Profile3d,System.Boolean,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions,System.Boolean)
This wraps the ObjectARX AcDbSurface::createRevolvedSurface( ) method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateRevolvedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
This wraps the ObjectARX AcDbSurface::createRevolvedSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateRevolvedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions,System.Boolean)
This wraps the ObjectARX AcDbSurface::createRevolvedSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateSweptSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
This wraps the ObjectARX AcDbSurface:: createSweptSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateSweptSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions,System.Boolean)
This wraps the ObjectARX AcDbSurface::createSweptSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateLoftedSurface(Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftOptions)
This wraps the ObjectARX AcDbLoftedSurface::createLoftedSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateLoftedSurface(Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftOptions,System.Boolean)
This wraps the ObjectARX AcDbLoftedSurface::createLoftedSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateNetworkSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d[],Autodesk.AutoCAD.DatabaseServices.Profile3d[])
This wraps the ObjectARX AcDbSurface:: createNetworkSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateNetworkSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d[],Autodesk.AutoCAD.DatabaseServices.Profile3d[],System.Boolean)
This wraps the ObjectARX AcDbSurface::createNetworkSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreatePatchSurface(Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32,System.Double)
This wrap ObjectARX AcDbSurface::createPatchSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreatePatchSurface(Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32,System.Double,System.Boolean)
This wraps the ObjectARX AcDbSurface::createPatchSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateBlendSurface(Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.BlendOptions)
This wraps the ObjectARX AcDbSurface::createBlendSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateBlendSurface(Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.BlendOptions,System.Boolean)
This wraps the ObjectARX AcDbSurface::createBlendSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateFilletSurface(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.DatabaseServices.FilletTrimMode,Autodesk.AutoCAD.Geometry.Vector3d)
This wraps the ObjectARX AcDbSurface::createFilletSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateFilletSurface(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d,System.Double,Autodesk.AutoCAD.DatabaseServices.FilletTrimMode,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)
This wraps the ObjectARX AcDbSurface::createFilletSurface() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateOffsetSurface(Autodesk.AutoCAD.DatabaseServices.Entity,System.Double)
This wraps the ObjectARX AcDbSurface::createOffsetSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateOffsetSurface(Autodesk.AutoCAD.DatabaseServices.Entity,System.Double,System.Boolean)
This wraps the ObjectARX AcDbSurface::createOffsetSurface () method.

Autodesk.AutoCAD.DatabaseServices.Surface.GeometricExtents
Accesses the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the entity, and return those points as an instance of class Extents in the "extents" parameter.

Autodesk.AutoCAD.DatabaseServices.Surface.UsesGraphicsCache
This property is a wrapper for the AcDbSurface::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the surface.

Autodesk.AutoCAD.DatabaseServices.Surface.Perimeter
This wraps the ObjectARX AcDbSurface::getPerimeter() method.

Autodesk.AutoCAD.DatabaseServices.Surface.WireframeType
This wraps the ObjectARX AcDbSurface::getWireframeType() and AcDbSurface::setWireframeType() methods.

Autodesk.AutoCAD.DatabaseServices.Surface.VIsoLineDensity
This wraps the ObjectARX AcDbSurface::setVIsolineDensity() and AcDbSurface::vIsolineDensity() methods.

Autodesk.AutoCAD.DatabaseServices.Surface.UIsoLineDensity
This wraps the ObjectARXAcDbSurface::setUIsolineDensity() and AcDbSurface::uIsolineDensity() methods.

Autodesk.AutoCAD.DatabaseServices.Surface.ModificationActionBodyIds
This wraps the ObjectARX AcDbSurface::modificationActionBodyIds() method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreationActionBodyId
This wraps the ObjectARX AcDbSurface::creationActionBodyId() method.