Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection
This .NET class wraps the AcDbHyperlinkCollection ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Index of object to remove.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.HyperLink[],System.Int32)
Copies the entire collection to another zero-based array.
array:  Target array.
index:  The zero-based index in array at which copying begins.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Add(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Add an item to the collection.
value:  Item to add.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Returns the 0-based index of the collection item that matches value.
value:  Item to look for.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.HyperLink)
Inserts value at position index in the collection.
index:  Location to insert at
value:  Item to insert.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Remove(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Removes the object represented by value from this collection.
value:  Object to remove.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Contains(Autodesk.AutoCAD.DatabaseServices.HyperLink)
Returns a value indicating whether the collection contains an object that matches value.
value:  Item to check for.

Autodesk.AutoCAD.DatabaseServices.HyperLinkCollection.Count
Accesses the number of objects in the array.