Autodesk.AutoCAD.GraphicsInterface.ContextualColors
This .NET class wraps the AcGiContextualColors ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.LightDistanceColor
Accesses the color of light distance in the current display context.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.LightShapeColor
Accesses the color of light shapes in the current display context.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.WebMeshMissingColor
Accesses the color of the missing web meshes in the current display context.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.WebMeshColor
Accesses the color of the web mesh in the current display context.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.GridAxisLineTintXYZ
Accesses the tint color for grid axis lines in the current display context.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.GridMinorLineTintXYZ
Accesses the tint color for minor grid lines in the current display context.

Autodesk.AutoCAD.GraphicsInterface.ContextualColors.GridMajorLineTintXYZ
Accesses the tint color for major grid lines in the current display context.