Autodesk.AutoCAD.DatabaseServices.BulgeVertex
This class contains a bulge value and the 2D coordinates of the associated vertex.

Autodesk.AutoCAD.DatabaseServices.BulgeVertex.#ctor(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Default constructor.
point:  Input the 2D coordinates of the new vertex.
bulge:  Input the new bulge value.

Autodesk.AutoCAD.DatabaseServices.BulgeVertex.Bulge
Accesses the bulge property value.

Autodesk.AutoCAD.DatabaseServices.BulgeVertex.Vertex
Accesses the vertex property value.