Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::AcDbAssocExtrudedSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.GetTaperAngle(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::taperAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.SetTaperAngle(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::setTaperAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.GetHeight(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::height() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.SetHeight(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::setHeight() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions,System.Boolean)
This wraps the ObjectARXAcDbAssocExtrudedSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.Height
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::height() and AcDbAssocExtrudedSurfaceActionBody::setHeight() methods.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.TaperAngle
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::taperAngle() and AcDbAssocExtrudedSurfaceActionBody::setTaperAngle() methods.