Autodesk.AutoCAD.DatabaseServices.RasterVariables
This .NET class wraps the AcDbRasterVariables ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.#ctor
Constructs an RasterVariables object and initializes itself to default values.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.UserScale
Accesses the real-world unit representing one AutoCAD drawing unit.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.ImageQuality
Accesses the current image display quality setting.

Autodesk.AutoCAD.DatabaseServices.RasterVariables.ImageFrame
Accesses the current image frame visibility setting.