Autodesk.AutoCAD.Runtime.IExtensionApplication
This is class Autodesk.AutoCAD.Runtime.IExtensionApplication.

Autodesk.AutoCAD.Runtime.IExtensionApplication.Initialize
This is Initialize, a member of class IExtensionApplication.

Autodesk.AutoCAD.Runtime.IExtensionApplication.Terminate
This is Terminate, a member of class IExtensionApplication.