Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam
This is class Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.#ctor
This wraps the ObjectARX AssocCompoundActionParam::AcDbAssocCompoundActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.RemoveAllParams(System.Boolean)
This wraps the ObjectARX AssocCompoundActionParam::removeAllParams() method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.AddParam(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the ObjectARX AssocCompoundActionParam::addParam () method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.RemoveParam(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This wraps the ObjectARX AssocCompoundActionParam::removeParam () method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.ParamsAtName(System.String)
This wraps the ObjectARX AssocCompoundActionParam::paramsAtName () method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.ParamAtName(System.String,System.Int32)
This wraps the ObjectARX AssocCompoundActionParam::paramAtName() method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.ParamAtName(System.String)
This wraps the ObjectARX AssocCompoundActionParam::paramAtName() method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.ParamAtIndex(System.Int32)
This wraps the ObjectARX AssocCompoundActionParam::paramAtIndex() method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.OwnedParams
This wraps the ObjectARX AssocCompoundActionParam::ownedParams () method.

Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.ParamCount
This wraps the ObjectARX AssocCompoundActionParam::paramCount() method.