Autodesk.AutoCAD.GraphicsInterface.MaterialMap
This .NET class wraps the AcGiMaterialMap ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialMap,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)
Returns true if lhs equals rhs.
lhs:  Left operand
rhs:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialMap,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)
Returns true if lhs does not equal rhs.
lhs:  Left operand
rhs:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.SourceFileName
This property has been marked with the System.Obsolete attribute, which should alert developers with a warning at compile-time.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Mapper
Gets the mapper (mapping function) associated with this map.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Filter
Accesses the map filter value.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.BlendFactor
Gets the blend factor for the image map, a value between 0.0 and 1.0.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Texture
Returns the address of the MaterialTexture object contained in this map.

Autodesk.AutoCAD.GraphicsInterface.MaterialMap.Source
Gets the data source of the material map; one of the MaterialMap.Source> enumerators.