Autodesk.AutoCAD.Geometry.PointOnCurve2d
This .NET class wraps the AcGePointOnCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Constructs a point on the input curve at the specified parameter value.
curve:  Input any 2D curve
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d)
Constructs a point on the input curve at the parameter value 0.0.
src:  Input any 2D curve

Autodesk.AutoCAD.Geometry.PointOnCurve2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetPointAtParameter(System.Double)
Returns the coordinates of the point on curve at the specified parameter value.
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetPointOnCurve(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Returns the curve on which the point lies.
curve:  Input any 2D curve
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Returns the derivative of the specified order on the input curve at the specified parameter value.
order:  Input order of derivative
curve:  Input any 2D curve
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetDerivative(System.Int32,System.Double)
Returns the derivative of the specified order at the specified parameter value.
order:  Input order of derivative
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve2d.GetDerivative(System.Int32)
Returns the derivative of the specified order.
order:  Input order of derivative

Autodesk.AutoCAD.Geometry.PointOnCurve2d.Point
Returns the coordinates of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.Parameter
Returns the parameter value of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve2d.Curve
Returns the curve on which the point lies.