Autodesk.AutoCAD.DatabaseServices.FullDwgVersion
This class encapsulates major and minor DWG versions.

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.#ctor(Autodesk.AutoCAD.DatabaseServices.DwgVersion,Autodesk.AutoCAD.DatabaseServices.MaintenanceReleaseVersion)
Constructs an object with the given version settings.
majorVersion:  Input major version
minorVersion:  Input minor version

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Object to compare

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.op_Equality(Autodesk.AutoCAD.DatabaseServices.FullDwgVersion,Autodesk.AutoCAD.DatabaseServices.FullDwgVersion)
Returns true if ver1 is equal to ver2.
ver1:  Left operand
ver2:  Right operand

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.op_Inequality(Autodesk.AutoCAD.DatabaseServices.FullDwgVersion,Autodesk.AutoCAD.DatabaseServices.FullDwgVersion)
Returns true if ver1 is not equal to ver2.
ver1:  Left operand
ver2:  Right operand

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.MinorVersion
Accesses the minor version number.

Autodesk.AutoCAD.DatabaseServices.FullDwgVersion.MajorVersion
Accesses the major version number.