Autodesk.AutoCAD.DatabaseServices.PdfReference
This .NET class wraps the ObjectARX class AcDbPdfReference.

Autodesk.AutoCAD.DatabaseServices.PdfReference.#ctor
This is PdfReference, a member of class PdfReference.