Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent
This class stores to a pointer the material map for the normal map channel of the material, the method used to compute the normal map, and the channel strength.

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.#ctor(Autodesk.AutoCAD.GraphicsInterface.MaterialMap,Autodesk.AutoCAD.GraphicsInterface.NormalMapMethod,System.Double)
This constructor initializes the material normal map component.
map:  Input material map
method:  Input normal map method
strength:  Input strength

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Input object to compare against

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.Strength
Returns the strength of the normal map channel.

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.Method
Stores to a pointer the material map for the normal map channel of the material, the method used to compute the normal map, and the channel strength.

Autodesk.AutoCAD.GraphicsInterface.MaterialNormalMapComponent.Map
Returns the normal component map.