Autodesk.AutoCAD.DatabaseServices.DiametricDimension
This .NET class wraps the AcDbDiametricDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.FarChordPoint
Accesses the far chord point (in WCS coordinates) of the curve being dimensioned.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.ChordPoint
Accesses the point (in WCS coordinates) where the dimension line intersects the curve being dimensioned and extends outside the curve, if the text is outside the curve.

Autodesk.AutoCAD.DatabaseServices.DiametricDimension.LeaderLength
Accesses the leader length.