Autodesk.AutoCAD.DatabaseServices.EqualLengthConstraint
This class represents a EqualLength constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.EqualLengthConstraint.#ctor
Default constructor.