Autodesk.AutoCAD.DatabaseServices.EdgeRef
This wraps the ObjectARX AcDbEdgeRef class.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.Geometry.Curve3d)
This wraps the ObjectARXAcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.DatabaseServices.Entity)
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Curve3d)
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.#ctor
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.Curve
This wraps the ObjectARX AcDbEdgeRef::curve() method.

Autodesk.AutoCAD.DatabaseServices.EdgeRef.FaceSubentity
This wraps the ObjectARX AcDbEdgeRef::faceSubentId() and AcDbEdgeRef::setFaceSubentity() methods.