Autodesk.AutoCAD.DatabaseServices.Notifier
This is class Autodesk.AutoCAD.DatabaseServices.Notifier.

Autodesk.AutoCAD.DatabaseServices.Notifier.OnPropertyChanged(System.String)
This is OnPropertyChanged, a member of class Notifier.