Autodesk.AutoCAD.DatabaseServices.TableTemplate
This .NET class wraps the AcDbTableTemplate ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.TableTemplate.#ctor(Autodesk.AutoCAD.DatabaseServices.Table,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions)
Copy constructor.
table:  Input table from which to capture the template.
copyOption:  Input copy option specifying what to capture while capturing the template.

Autodesk.AutoCAD.DatabaseServices.TableTemplate.Capture(Autodesk.AutoCAD.DatabaseServices.Table,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions)
Captures table template.
table:  Input table from which to capture the template.
copyOption:  Input what to capture while capturing the template.

Autodesk.AutoCAD.DatabaseServices.TableTemplate.CreateTable(Autodesk.AutoCAD.DatabaseServices.TableCopyOptions)
Creates a table template.
copyOption:  Input Autodesk.AutoCAD.DatabaseServices.TableCopyOptions object specifying what to capture while capturing the template.