Autodesk.AutoCAD.DatabaseServices.UnitTypeAttribute
This is class Autodesk.AutoCAD.DatabaseServices.UnitTypeAttribute.

Autodesk.AutoCAD.DatabaseServices.UnitTypeAttribute.#ctor(Autodesk.AutoCAD.DatabaseServices.UnitType)
This is UnitTypeAttribute, a member of class UnitTypeAttribute.

Autodesk.AutoCAD.DatabaseServices.UnitTypeAttribute.UnitType
This is UnitType, a member of class UnitTypeAttribute.