Autodesk.AutoCAD.DatabaseServices.ObjectContextCollectionEnumerator
This .NET class wraps the AcDbObjectContextCollectionIterator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollectionEnumerator.MoveNext
Positions the iterator to the next context in the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollectionEnumerator.Reset
Positions the iterator to the beginning of the collection.

Autodesk.AutoCAD.DatabaseServices.ObjectContextCollectionEnumerator.Current
Accesses the current object the iterator is pointing to.