Autodesk.AutoCAD.DatabaseServices.GradientColor
This class is a container for the gradient colors used by the Hatch object.

Autodesk.AutoCAD.DatabaseServices.GradientColor.#ctor(Autodesk.AutoCAD.Colors.Color,System.Single)
Constructor.
color:  Input color making up the parameters
value:  Input float representing the interpolation values defining the gradient