Autodesk.AutoCAD.LayerManager.AndExpression
This .NET class wraps the AcLyAndExpr ObjectARX class.

Autodesk.AutoCAD.LayerManager.AndExpression.GetRelationalExpressions
Returns relational expressions that are joined by AND.