Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground
This .NET class wraps the AcDbGroundPlaneBackground ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneFar
Accesses the far ground plane color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneNear
Accesses the near ground plane color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorUndergroundAzimuth
Accesses the underground azimuth color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorUndergroundHorizon
Accesses the underground horizon color.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorSkyHorizon
Returns the color of the sky at the horizon.

Autodesk.AutoCAD.DatabaseServices.GroundPlaneBackground.ColorSkyZenith
Accesses the color at the sky zenith.