Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition
This .NET class wraps the AcDbUnderlayDefinition ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Load(System.String)
Attempts to load the file returned by the UnderlayDefinition.ActiveFileName property.
password:  Input optional password

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Unload
Unloads the underlay file.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.GetDictionaryKey(System.Type)
Returns the name of the dictionary that holds the UnderlayDefinition objects in the named objects dictionary.
underlayDefinitionType:  Input the class descriptor of the underlay type for which to retrieve the dictionary name

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Loaded
Returns a Boolean value indicating whether the underlay is currently loaded.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.UnderlayItem
Returns a pointer to the internal data member that holds the underlay item that this underlay currently references.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.ItemName
Returns a pointer to the internal data member that holds the name of the underlay item that this underlay currently references.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.ActiveFileName
Returns the name of the file that this underlay references.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.SourceFileName
Returns a pointer to the internal data member that holds the name of the file that this underlay references.