Autodesk.AutoCAD.DatabaseServices.DBObjectCollection
An interface to a collection of DBObjects.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.RemoveAt(System.Int32)
Removes the object at index from this collection.
index:  Index of item to remove

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Add(Autodesk.AutoCAD.DatabaseServices.DBObject)
Adds the object represented by value to this collection.
value:  Input object to add

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.DBObject)
Returns the zero-based index of the collection item that matches value.
value:  Item to retrieve the index of

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.DBObject)
Inserts value at position index in the collection.
index:  Index to insert at
value:  Item to insert

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Remove(Autodesk.AutoCAD.DatabaseServices.DBObject)
Removes the object represented by value from this collection.
value:  Item to remove

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Contains(Autodesk.AutoCAD.DatabaseServices.DBObject)
Returns a Boolean indicating whether the collection contains an object that matches value.
value:  Object to look for

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DBObject[],System.Int32)
Copies objects in array to this collection.
array:  Array to copy from
index:  Zero-based index to start copying at

Autodesk.AutoCAD.DatabaseServices.DBObjectCollection.Count
Returns the number of objects in this collection.