Autodesk.AutoCAD.Runtime.DynamicLinker
This .NET class wraps the AcRxDynamicLinker ObjectARX class.

Autodesk.AutoCAD.Runtime.DynamicLinker.LoadModule(System.String,System.Boolean,System.Boolean)
Loads the fileName ObjectARX program. fileName is the application name as set in the operating system registry. If the ObjectARX application does not have an entry in the registry, or if the registry entry has the AcadApp.LoadDisabled load reason set, or if any of the the LoadReasons in reasons do not match the LoadReasons in the application's registry entry, then this function will be unable to load the application.
If printIt is true, then a message is sent to the AutoCAD text screen indicating the success or failure of the load operation.
When asCmd is True, loading can happen only once. A second attempt to load will return False. The reference count for the application is not increased in this case. When asCmd is False, it's possible to call this method more than once and still get a successful return value. When the .arx you want to load is already loaded, this method will simply increment the reference count for the application.
fileName:  Input name of the file to load.
printIt:  Input indicating whether or not to print load status message.
asCmd:  Input indicating whether to load the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.UnloadModule(System.String,System.Boolean)
Unloads the fileName ObjectARX program. fileName is the application name as set in the operating system registry. If the ObjectARX application was not loaded via the DynamicLinker.loadApp() method or through the demand loading mechanism (all of which use the system registry entry for the application), then this function will be unable to unload the application.
When asCmd is False, it's possible to call this method more than once and still get a successful return value. This method will simply decrement the reference count for the application.
fileName:  Input null-terminated string which is the file name of the program to unload.
asCmd:  Input indicating whether to unload the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsModuleLoaded(System.String)
Returns true if the module is successfully found and loaded; otherwise, returns false.
fileName:  Input name of the file to load.

Autodesk.AutoCAD.Runtime.DynamicLinker.GetLoadedModules
Retrieves the loaded modules.

Autodesk.AutoCAD.Runtime.DynamicLinker.LoadApp(System.String,System.Boolean,System.Boolean)
Loads the appName ObjectARX program. appName is the application name as set in the operating system registry. If the ObjectARX application does not have an entry in the registry, or if the registry entry has the AcadApp.LoadDisabled load reason set, or if any of the the LoadReasons in reasons do not match the LoadReasons in the application's registry entry, then this function will be unable to load the application.
If printIt is true, then a message is sent to the AutoCAD text screen indicating the success or failure of the load operation.
When asCmd is True, loading can happen only once. A second attempt to load will return kFalse. The reference count for the application is not increased in this case. When asCmd is False, it's possible to call this method more than once and still get a successful return value. When the .arx you want to load is already loaded, this method will simply increment the reference count for the application.
appName:  Input null-terminated string which is the application name (as set in the system registry) of the ObjectARX module to load
printIt:  Input indicating whether or not to print load status message.
asCmd:  Input indicating whether to load the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.UnloadApp(System.String,System.Boolean)
Unloads the appName ObjectARX program. appName is the application name as set in the operating system registry. If the ObjectARX application was not loaded via the DynamicLinker.LoadApp() method or through the demand loading mechanism (all of which use the system registry entry for the application), then this function will be unable to unload the application.
When asCmd is False, it's possible to call this method more than once and still get a successful return value. This method will simply decrement the reference count for the application.
appName:  Input null-terminated string which is the application name (as set in the system registry) of the ObjectARX module to unload.
asCmd:  Input indicating whether to unload the application as if by user command.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsApplicationLocked(System.String)
Indicates whether the moduleName application is locked and cannot be unloaded, or is unlocked and can be successfully unloaded.
moduleName:  Input name of loaded ObjectARX program.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsAppMdiAware(System.String)
Determines if an application already loaded is MDI aware.
moduleName:  Input name of the module to check.

Autodesk.AutoCAD.Runtime.DynamicLinker.IsAppBusy(System.String)
For internal use.
moduleName:  Input.

Autodesk.AutoCAD.Runtime.DynamicLinker.SetAppBusy(System.String,System.Boolean)
For internal use.
moduleName:  Input.
busyFlag:  Input.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleLoading
Occurs when the dynamic linker is loading an application module.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleLoaded
Occurs when the dynamic linker has successfully finished loading an application module.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleLoadAborted
Occurs when the dynamic linker aborts an unsuccessful attempt to load an application module.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleUnloading
Occurs when the dynamic linker is unloading an application module.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleUnloaded
Occurs when the dynamic linker has successfully finished unloading an application module.

Autodesk.AutoCAD.Runtime.DynamicLinker.ModuleUnloadAborted
Occurs when the dynamic linker aborts an unsuccessful attempt to unload an application module.

Autodesk.AutoCAD.Runtime.DynamicLinker.ProductLcid
Returns the ProductLcid property value.