Autodesk.AutoCAD.DatabaseServices.DgnUnderlayItem
This .NET class wraps the AcDbDgnUnderlayItem ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DgnUnderlayItem.SetShowRasterRef
Sets a boolean indicating whether raster images should be displayed in referenced DGN files.

Autodesk.AutoCAD.DatabaseServices.DgnUnderlayItem.ShowRasterRef
Gets a boolean indicating whether raster images should be displayed in referenced (xref) DGN files.

Autodesk.AutoCAD.DatabaseServices.DgnUnderlayItem.UseMasterUnits
Assesses whether the underlay uses master units in the DGN file when the DGN file is being translated to DWG for the underlay to use.