Autodesk.AutoCAD.Runtime.FileOperations
This .NET class wraps the AcDbFileOperationReactor ObjectARX class which is used to get all DWG/DXF file open and close operations.

Autodesk.AutoCAD.Runtime.FileOperations.FileWillOpen
Occurs when the drawing is about to be opened.

Autodesk.AutoCAD.Runtime.FileOperations.FileOpenAborted
Occurs when the opening of the drawing has been aborted.

Autodesk.AutoCAD.Runtime.FileOperations.FileHasClosed
Occurs when the drawing has been closed.