Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex
This .NET class wraps the AcDbLayerIndex ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.Compute(Autodesk.AutoCAD.DatabaseServices.LayerTable,Autodesk.AutoCAD.DatabaseServices.BlockTableRecord)
Uses the layer table pointed to by pLT and the block table record pointed to by pBTR to compute the appropriate filter information.
pLT:  Input layer table of the Database
record:  Input block table record for which the filter should be generated