Autodesk.AutoCAD.DatabaseServices.Arc
This .NET class wraps the AcDbArc ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor creates an arc using the values passed in.
center:  Input the center point of the arc.
normal:  Input the normal vector of the plane containing the arc.
radius:  Input the radius of the arc.
startAngle:  Input the starting angle of the arc.
endAngle:  Input the ending angle of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double)
This constructor creates an arc using the values passed in.
center:  Input the center point of the arc.
radius:  Input the radius of the arc.
startAngle:  Input the starting angle of the arc.
endAngle:  Input the ending angle of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Arc.TotalAngle
Accesses the angle sweep of the arc segment.

Autodesk.AutoCAD.DatabaseServices.Arc.Length
Accesses the length of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.Normal
Accesses the normal vector of the plane containing the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.Thickness
Accesses the arc’s thickness.

Autodesk.AutoCAD.DatabaseServices.Arc.EndAngle
Accesses the end angle of the arc, which must be in radians.

Autodesk.AutoCAD.DatabaseServices.Arc.StartAngle
Accesses the the start angle of the arc, which must be in radians.

Autodesk.AutoCAD.DatabaseServices.Arc.Radius
Accesses the radius of the arc.

Autodesk.AutoCAD.DatabaseServices.Arc.Center
Accesses the center to be the center point for the arc; it must be in WCS coordinates.