Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex
This .NET class wraps the AcDbPolyFaceMeshVertex ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs an PolyFaceMeshVertex that uses position as the position point.
position:  Input WCS position point for the vertex

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex.Position
Accesses the WCS point value of this vertex.