Autodesk.AutoCAD.LayerManager.RelationalExpression
This .NET class wraps the AcLyRelExpr ObjectARX class.

Autodesk.AutoCAD.LayerManager.RelationalExpression.Constant
Returns a constant.

Autodesk.AutoCAD.LayerManager.RelationalExpression.Variable
Returns the name of the variable.