Autodesk.AutoCAD.DatabaseServices.HorizontalConstraint
This class represents a Horizontal constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.HorizontalConstraint.#ctor
Default constructor.