Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE
This wraps the ObjectARX AcDbAssocPersSubentIdPE class.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.#ctor
Default Constructor.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.CreateNewPersSubent(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Mapping: SubentityId --> AssocPersSubentityId
Creates a new AssocPersSubentityId object from a given SubentityId.
entity:  The entity must be open for write, but usually no changes to the entity will be made.
compId:  Contains full context path to entity. Can be empty for simple reference.
subentId:  Transient SubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetTransientSubentityIds(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Mapping: AssocPersSubentityId --> SubentityId(s)
Obtains all SubentityIds of the provided Entity that correspond to the provided AssocPersSubentityId.
entity:  The entity needs to be open for read.
perSubentId:  The persistent subentity id on the entity.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetAllSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityType)
Gets all subentities of the given type.
entity:  The entity must be open for read.
subentType:  The required type of the subentities.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&,Autodesk.AutoCAD.DatabaseServices.SubentityId&,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&)
Gets the vertex SubentityIds corresponding to the given edge SubentityId.
entity:  The entity must be open for read.
edgeSubentId:  Edge SubentityId whose vertex SubentityIds are to be obtained.
startVertexSubentId:  Returned SubentityId of the start vertex of the edge (or NullSubentityId if there is not any).
endVertexSubentId:  Returned SubentityId of the end vertex of the edge (or NullSubentityId if there is not any).
otherVertexSubentIds:  Returned other SubentityIds associated with the edge, such as the circle or arc center, spline control and fit points, etc.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetSplineEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&,Autodesk.AutoCAD.DatabaseServices.SubentityId&,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&)
Gets the vertex SubentityIds corresponding to the given edge SubentityId whose geometry is defined by a spline.
entity:  The entity must be open for read.
edgeSubentId:  Edge SubentId whose vertex SubentityIds are to be obtained.
startVertexSubentId:  Returned SubentityId of the start vertex of the edge (or NullSubentityId if there is not any).
endVertexSubentId:  Returned SubentityId of the end vertex of the edge (or NullSubentityId if there is not any).
controlPointSubentIds:  Returned SubentityIds identifying the spline control points. The order is the same as the order of the spline control points.
fitPointSubentIds:  Returned SubentityIds identifying the spline fit points (if any). The order is the same as the order of the spline fit points.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetVertexSubentityGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets the coordinates of a vertex subentity.
entity:  The entity must be open for read.
vertexSubentId:  Vertex SubentityId whose position is to be obtained.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetEdgeSubentityGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets the curve of an edge subentity.
entity:  The entity must be open for read.
edgeSubentId:  Edge SubentityId whose curve is to be obtained.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetFaceSubentityGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets the surface of a face subentity.
entity:  The entity must be open for read.
faceSubentId:  Face SubentityId whose surface is to be changed.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.SetVertexSubentityGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d)
Change the geometry of a vertex subentity.
entity:  The entity must be open for write.
vertexSubentId:  Vertex SubentityId whose position is to be changed.
newVertexPosition:  New coordinates of the vertex subentity.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.SetEdgeSubentityGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Curve3d)
Change the curve of an edge subentity.
entity:  The entity must be open for write.
edgeSubentId:  Edge SubentityId whose curve is to be changed.
newEdgeCurve:  New curve of the edge subentity (copied, not reused).

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.SetFaceSubentityGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Surface)
Change the surface of a face subentity.
entity:  The entity must be open for write.
faceSubentId:  Face SubentityId whose surface is to be changed.
newFaceSurface:  New surface of the face subentity (copied, not reused).

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetSubentGeometryXform(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Call this method to obtain block transformation matrix for a given sub-entity within the block reference.
entity:  The entity must be open for read.
fullSubentPath:  Full path of the sub-entity whose collective transformation matrix is to be determined.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.MirrorPersSubent(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Mirrors the given AssocPersSubentityId, i.e., it changes it so that it identifies the same subentity in the mirrored entity as it identified before the entity is mirrored.
mirroredEntity:  The entity that has been mirrored. It needs to be open for read.
persSubentIdToMirror:  The AssocPersSubentityId to be changed to reflect the fact that the entity has been mirrored.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetRigidSetState(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns ScalableRigidSet or NonScalableRigidSet if the entity is a rigid set, i.e.
entity:  The entity must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetRigidSetTransform(Autodesk.AutoCAD.DatabaseServices.Entity)
Get the transformation of the rigid set entity.
entity:  The entity must be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.SetRigidSetTransform(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Matrix3d)
Set the transformation of the rigid set entity.
entity:  The entity must be open for write.
trans:  New transformation matrix of the rigid set entity.