Autodesk.AutoCAD.DatabaseServices.Ole2Frame
This .NET class wraps the AcDbOle2Frame ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.OleObject
Accesses the MFC object currently used by the Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LockAspect
Accesses the lock aspect ratio property, which affects the behavior of the OLE object when its size is changed.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ScaleHeight
Accesses the scale height, which represents the current object scale relative to the original scale from the default text size to the AutoCAD units scale.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.ScaleWidth
Accesses the scale width, which represents the current object scale relative to the original scale from the default text size to the AutoCAD units scale.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.WcsHeight
Accesses the actual height of the OLE object expressed in AutoCAD world coordinates.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.WcsWidth
Accesses the actual width of the OLE object expressed in AutoCAD world coordinates.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Rotation
Accesses the rotation value, which users may change to any angle using the Properties window or the ROTATE command.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.AutoOutputQuality
Accesses the whether the plot quality setting is Automatically Select in the Properties palette.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.OutputQuality
Accesses the current output quality assigned to this Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LinkPath
Accesses the path and file name to which the object is linked.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.LinkName
Accesses the name to which the object is linked.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.IsLinked
Assesses if the frame is linked.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Type
Accesses the OLE object's type.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.UserType
Accesses the user type string (for example "Paintbrush Bitmap") of the MFC object used by this Ole2Frame object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Position2d
Accesses the coordinates of the four corners of OLE object in the GDI coordinates of the current viewport.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Position3d
Accesses the world coordinate system coordinates of the four corners of OLE object.

Autodesk.AutoCAD.DatabaseServices.Ole2Frame.Location
Accesses the WCS point that corresponds to the lower-left corner of the OLE display rectangle of the Ole2Frame object.