Autodesk.AutoCAD.Geometry.Line2d
This .NET class wraps the AcGeLine2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Line2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an unbounded line that passes through point1 and point2.
point1:  Input any 2D point
point2:  Input any 2D point different from point1

Autodesk.AutoCAD.Geometry.Line2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs an unbounded line that passes through point and has a direction of vector.
point:  Input any 2D point
vector:  Input any 2D vector

Autodesk.AutoCAD.Geometry.Line2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Line2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the line to pass through point1 and point2.
point1:  Input any 2D point
point2:  Input any 2D point different from point1

Autodesk.AutoCAD.Geometry.Line2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the line to pass through point in the direction of vector.
point:  Input any 2D point
vector:  Input any 2D vector