Autodesk.AutoCAD.Geometry.Curve2d
This .NET class wraps the AcGeCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Curve2d.GetInterval
Returns the parametric range of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.SetInterval(Autodesk.AutoCAD.Geometry.Interval)
Sets to domain of the curve as per value.
value:  Input interval

Autodesk.AutoCAD.Geometry.Curve2d.GetReverseParameterCurve
Reverses the parametric direction of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve2d)
This method calls Curve2d.GetDistanceTo(Curve2d curve, Tolerance tolerance) with tolerance set to Global.
curve:  Input any 2D curve

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the closest points between this curve and the input curve.
curve:  Input any 2D curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Curve2d.GetDistanceTo(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.Curve2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the input point and the closest point on this curve.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve2d)
This method calls Curve2d.GetClosestPointTo(Curve2d curve, Tolerance tolerance) with tolerance set to Global.
curve:  Input any 2D curve

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the two closest points between this curve and the input curve.
curve:  Input any 2D curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Curve2d.GetClosestPointTo(Point2d curve, Tolerance tolerance) with tolerance set to Global.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.Curve2d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the closest point on this curve to the input point.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Curve2d.GetNormalPoint(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.Curve2d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the point on the input curve whose normal passes through the input point.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(System.Double)
This method calls Curve2d.IsOn(Double parameter, Tolerance tolerance) with tolerance set to Global.
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if input parameter value is within valid parametric range of curve.
parameter:  Input parameter value
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,System.Double&)
Determines if input point lies on curve.
point:  Input any 2D point
value:  Output parameter value of point if point lies on curve

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,System.Double&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point:  Input any 2D point
value:  Output parameter value of point if point lies on curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Curve2d.IsOn(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if input point lies on curve.
point:  Input any 2D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Curve2d.GetParameterOf(Point2d point, Tolerance tolerance) with tolerance set to Global.
point:  Input point on the curve

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of point.
point:  Input point on the curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType)
This method calls Curve2d.GetTrimmedOffset(Double distance, OffsetCurveExtensionType extensionType, Tolerance tolerance) with tolerance set to Global.
distance:  Input offset distance
extensionType:  Input determines how offset curve will be extended at points of C1 discontinuity

Autodesk.AutoCAD.Geometry.Curve2d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType,Autodesk.AutoCAD.Geometry.Tolerance)
Returns one or more offset curves that represent the trimmed offset of the curve.
distance:  Input offset distance
extensionType:  Input determines how offset curve will be extended at points of C1 discontinuity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsClosed
This method calls Curve2d.IsClosed(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Curve2d.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if start point and endpoint of curve are the same.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsPeriodic(System.Double&)
Determines if the curve is periodic.
period:  Input period of curve parameter

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d&)
Determines if curve is linear.
line:  Output line on which this curve lies if it is linear

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear.
line:  Output line on which this curve lies if it is linear
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetLength(System.Double,System.Double)
This method calls Curve2d.GetLength(Double fromParameter, Double toParameter, Tolerance tolerance) with tolerance set to Global.
fromParameter:  Input first parameter value
toParameter:  Input second parameter value

Autodesk.AutoCAD.Geometry.Curve2d.GetLength(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the arc length of the curve between the two parameter values.
fromParameter:  Input first parameter value
toParameter:  Input second parameter value
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean)
This method calls Curve2d.GetParameterAtLength(Double datumParameter, Double length, Boolean parameterDirection, Tolerance tolerance) with tolerance set to Global.
datumParameter:  Input parameter value
length:  Input arc length
parameterDirection:  Input parameter direction

Autodesk.AutoCAD.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length. In other words, if t = GetParameterAtLength (datumParameter, length, parameterDirection, tolerance);
then length (t, datumParameter, tolerance) is (approximately) equal to length.
datumParameter:  Input parameter value
length:  Input arc length
parameterDirection:  Input parameter direction
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetArea(System.Double,System.Double)
This method calls Curve2d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) with tolerance set to Global.
startParameter:  Input parameter value of interval start
endParameter:  Input parameter value of interval end (must be larger than startParameter)

Autodesk.AutoCAD.Geometry.Curve2d.GetArea(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the area of the interval of the curve defined by startParameter and endParameter.
startParameter:  Input parameter value of interval start
endParameter:  Input parameter value of interval end (must be larger than startParameter)
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity2d&)
Determines if the curve is degenerate.
result:  Output type of degenerate entity

Autodesk.AutoCAD.Geometry.Curve2d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity2d&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the curve is degenerate with a tolerance.
result:  Output type of degenerate entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.GetSplitCurves(System.Double)
Returns two segments that are obtained by splitting the curve at the input parameter value.
value:  Input parameter value at which curve is to be split

Autodesk.AutoCAD.Geometry.Curve2d.Explode(Autodesk.AutoCAD.Geometry.Interval)
Explodes the curve into its individual components.
interval:  Input interval of curve that is to be exploded

Autodesk.AutoCAD.Geometry.Curve2d.GetBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve2d.GetOrthoBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve2d.EvaluatePoint(System.Double)
Returns the point on the curve that corresponds to the input parameter value.
parameter:  Input parameter value at which curve is to be evaluated

Autodesk.AutoCAD.Geometry.Curve2d.GetSamplePoints(System.Int32)
Returns the specified number of points on the curve.
numSample:  Input number of points that are to be returned

Autodesk.AutoCAD.Geometry.Curve2d.GetSamplePoints(System.Double,System.Double,System.Double)
Returns a list of points on the curve between fromParameter and toParameter.
fromParameter:  Input starting parameter
toParameter:  Input ending parameter
approxEps:  Input chord-height tolerance

Autodesk.AutoCAD.Geometry.Curve2d.EndPoint
Returns the end point of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.StartPoint
Returns the start point of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.HasEndPoint
Returns true if the curve has an end point.A false means that the parametric interval of the curve does not have an upper bound.

Autodesk.AutoCAD.Geometry.Curve2d.HasStartPoint
Returns true if curve has a start point.

Autodesk.AutoCAD.Geometry.Curve2d.OrthoBoundBlock
Returns the bounding box of the curve.

Autodesk.AutoCAD.Geometry.Curve2d.BoundBlock
Returns the bounding box of the curve.