Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint
This class represents a constrained implicit point node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint.#ctor(System.UInt32,Autodesk.AutoCAD.DatabaseServices.ImplicitPointType,System.Int32)
Constructor.
constrCurvId:  Input ConstraintGroupNodeId indicating the constrained curve to which this implicit point belongs.
ptype:  Input ImplicitPointType indicating the type of this implicit point.
index:  Input int indicating the define point index of this implicit point. It is only valid when the point type is kDefineImplicit. Default value is -1 (invalid index).

Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint.Point
Gets the point position, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint.ConstrainedCurveId
Gets the ConstraintGroupNodeId of the constrained curve to which this implicit point belongs.

Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint.PointIndex
Gets the defined point index of this implicit point
If the point type is not DefineImplicit, it is -1.

Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint.PointType
Gets the type of this implicit point.