Autodesk.AutoCAD.GraphicsInterface.WorldDraw
This .NET class wraps the AcGiWorldDraw ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.WorldDraw.Geometry
Returns a reference to the WorldGeometry object.