Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator
This is class Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.RemoveCurrent
Allows callers to delete an item from the AcDbXrecord without having to get/set the whole chain.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.InsertAtCurrent(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Allows callers to insert one or more resbufs into the AcDbXrecord without having to get/set the whole chain.
data:  Input first result buffer (not its address) in a linked list of result buffer that contain the data for the xrecord.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.MoveNext
This is MoveNext, a member of class XrecordEnumerator.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.Reset
This is Reset, a member of class XrecordEnumerator.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.Current
Allows callers to modify the resbuf chain inside the AcDbXrecord without having to get/set the whole chain.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.IEnumeratorCurrent
This is IEnumeratorCurrent, a member of class XrecordEnumerator.

Autodesk.AutoCAD.DatabaseServices.XrecordEnumerator.CurrentTypeCode
This is CurrentTypeCode, a member of class XrecordEnumerator.