Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits
Abstract interface class that controls all the rendering settings.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.FilterHeight
Gets the current filter height.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.FilterWidth
Gets the current filter width.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.FilterType
Gets the current filter type.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.LightingMode
Gets the lighting mode being set.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.RenderLevel
Gets the desired render level.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.RenderTime
Gets the desired render time.

Autodesk.AutoCAD.GraphicsInterface.RapidRTRenderSettingsTraits.QuitCondition
Gets the quit condition.