Autodesk.AutoCAD.GraphicsInterface.HatchPattern
This is class Autodesk.AutoCAD.GraphicsInterface.HatchPattern.

Autodesk.AutoCAD.GraphicsInterface.HatchPattern.#ctor(Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition[])
This is HatchPattern, a member of class HatchPattern.

Autodesk.AutoCAD.GraphicsInterface.HatchPattern.PatternLines
This is PatternLines, a member of class HatchPattern.