Autodesk.AutoCAD.DatabaseServices.GripMode
The type that contains all information to present a single mode.

Autodesk.AutoCAD.DatabaseServices.GripMode.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GripMode.CommandString
Gets and sets the command used for this mode if the action type is kCommand.

Autodesk.AutoCAD.DatabaseServices.GripMode.Action
Gets and sets the action type of this mode uses.

Autodesk.AutoCAD.DatabaseServices.GripMode.Cursor
Gets and sets the type of cursor this mode uses.

Autodesk.AutoCAD.DatabaseServices.GripMode.CLIKeywordList
Gets and sets the command line keyword list associated to CLIPromptString.

Autodesk.AutoCAD.DatabaseServices.GripMode.CLIPromptString
Gets and sets the command line prompt string when this mode is switched as current.

Autodesk.AutoCAD.DatabaseServices.GripMode.CLIDisplayString
Gets and sets the display string of this mode in various UI elements (including the hover menu and object context menu).

Autodesk.AutoCAD.DatabaseServices.GripMode.ToolTip
Gets and sets the string tool tip of this mode.

Autodesk.AutoCAD.DatabaseServices.GripMode.DisplayString
Gets and sets the command line version of the display string for this mode.

Autodesk.AutoCAD.DatabaseServices.GripMode.ModeId
Gets and sets the unique identifier among the collection of modes this PE implements.