Autodesk.AutoCAD.DatabaseServices.Ellipse
This .NET class wraps the AcDbEllipse ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
Constructor used to create an Ellipse using the values passed in.
center:  Input center of the ellipse
unitNormal:  Input vector specifying normal, which determines the plane of the ellipse
majorAxis:  Input vector which represents 1/2 the major axis of the ellipse
radiusRatio:  Input ratio of the major radius to the minor radius
startAngle:  Input start angle of the ellipse in radians
endAngle:  Input end angle of the ellipse in radians

Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetParameterAtAngle(System.Double)
Returns the first period parameter value at angle (in radians).
angle:  Input angle (in radians) at which the parameter is desired

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetAngleAtParameter(System.Double)
Returns the first period equivalent of the angle at the value location on the ellipse.
value:  Input parameter to evaluate

Autodesk.AutoCAD.DatabaseServices.Ellipse.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This function sets the properties of the ellipse to the values specified in the arguments.
center:  Input center point (in WCS coordinates) for the ellipse
unitNormal:  Input normal vector (in WCS coordinates) which defines the plane in which the ellipse lies
majorAxis:  Input major axis (in WCS coordinates) for the ellipse
radiusRatio:  Input desired ratio of the major radius to the minor radius
startAngle:  Input start angle (in radians) for the ellipse
endAngle:  Input end angle (in radians) for the ellipse

Autodesk.AutoCAD.DatabaseServices.Ellipse.MinorRadius
Returns the minor radius of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MajorRadius
Returns the major radius of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.IsNull
Assesses if this Ellipse has no gelib object within itself.

Autodesk.AutoCAD.DatabaseServices.Ellipse.EndParam
Accesses the end parameter of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.StartParam
Accesses the new start parameter.

Autodesk.AutoCAD.DatabaseServices.Ellipse.EndAngle
Accesses the end angle of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.StartAngle
Accesses the first period equivalent of the start angle (in radians) of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.RadiusRatio
Accesses the ratio of the major to minor radius for the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MinorAxis
Accesses the major radius of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.MajorAxis
Accesses the major axis of the ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.Normal
Accesses the vector normal to this ellipse.

Autodesk.AutoCAD.DatabaseServices.Ellipse.Center
Accesses the center point of the ellipse.