Autodesk.AutoCAD.DatabaseServices.MInsertBlock
This .NET class wraps the AcDbMInsertBlock ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.RowSpacing
Accesses the spacing between the rows of the BlockTableRecord image that will be displayed by the MInsert object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.ColumnSpacing
Accesses the spacing between the columns of the BlockTableRecord image that will be displayed by the MInsert object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.Rows
Accesses the number of rows of the BlockTableRecord image that will be displayed by the MInsertBlock object.

Autodesk.AutoCAD.DatabaseServices.MInsertBlock.Columns
Accesses the number of columns of the BlockTableRecord image that will be displayed by the MInsertBlock object.