Autodesk.AutoCAD.DatabaseServices.PointCloudItem
Class point cloud item, which presents different type of point cloud elements, for example project, scan, region, etc.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Clone
Clone a Point Cloud Item.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.CompareTo(Autodesk.AutoCAD.DatabaseServices.PointCloudItem)
Compare two current Point Cloud item to another and check whether they are the same.
other:  The second point cloud item for comparison.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.ToCmdString
Serialize the point cloud item to a string.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.CreatePointCloudDataItemCollection(System.IntPtr)
Build a point cloud item list from an array of AcPointCloudItem.
unmanagedObjPtr:  The pointer of array of AcPointCloudItem

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.CategoryId
Gets or sets the type of the item.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Visibility
Gets or sets the visibility of item.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Guid
Gets or sets the GUID of item.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.ProjectName
Gets or sets the name of project to which the current item belongs.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.Name
Gets or sets the name of item.

Autodesk.AutoCAD.DatabaseServices.PointCloudItem.ItemId
Gets or sets id of item.