Autodesk.AutoCAD.LayerManager.LayerGroup
This .NET class wraps the AcLyLayerGroup ObjectARX class.

Autodesk.AutoCAD.LayerManager.LayerGroup.#ctor
Default constructor.

Autodesk.AutoCAD.LayerManager.LayerGroup.LayerIds
.