Autodesk.AutoCAD.GraphicsInterface.Context
This .NET class wraps the AcGiContext ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.Context.DisableFastMoveDrag
For plane transformations it is possible for a graphics system to maintain a cache of the graphics primitives and apply a transformation to those primitives, instead of requerying the object.

Autodesk.AutoCAD.GraphicsInterface.Context.SupportsCurveTrait
Returns true if the current implementation of the Graphics Interface supports Curve Trait.

Autodesk.AutoCAD.GraphicsInterface.Context.SupportsTrueTypeText
Returns true if the current implementation of supports True type font elaboration.

Autodesk.AutoCAD.GraphicsInterface.Context.ByBlockPlotStyleNameId
Returns the plotstyle that will be used if byblock is specified.

Autodesk.AutoCAD.GraphicsInterface.Context.ByBlockLineWeight
Returns the lineweight that will be used if byblock lineweight is specified.

Autodesk.AutoCAD.GraphicsInterface.Context.EffectiveColor
Returns the color that would be used to draw a primitive at this point, any bylayer and byblock resolution has been done.

Autodesk.AutoCAD.GraphicsInterface.Context.IsNesting
Returns true if the system is regenerating a nested object.

Autodesk.AutoCAD.GraphicsInterface.Context.IsBoundaryClipping
Returns true if boundary clipping is currently active.

Autodesk.AutoCAD.GraphicsInterface.Context.Database
Every regeneration relates to a specific database, and if your object needs to query the database for any purpose, this is the database you should use.

Autodesk.AutoCAD.GraphicsInterface.Context.IsPlotGeneration
Returns true if the regen is for hard copy output; otherwise, returns false.