Autodesk.AutoCAD.DatabaseServices.Body
This .NET class wraps the AcDbBody ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Body.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Body.AcisOut(System.String,Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This method writes out all the entities in to the fileName file.
fileName:  Input the file name to write data to.
entitiesOutToFile:  Input a collection containing all the Entity objects that are to be written out to the file

Autodesk.AutoCAD.DatabaseServices.Body.AcisIn(System.String)
This method reads in all the ACIS entities from the fileName ASCII ACIS SAT file.
fileName:  Input the file name of ASCII ACIS SAT file to be read in.

Autodesk.AutoCAD.DatabaseServices.Body.NumChanges
Returns the number of changes that have occurred to this Body since it was first created.

Autodesk.AutoCAD.DatabaseServices.Body.UsesGraphicsCache
This property is a wrapper for the AcDbBody::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the region.

Autodesk.AutoCAD.DatabaseServices.Body.IsNull
Returns true if this Body has no ShapeManager object within it.