Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension
This .NET class wraps the AcDbInterferencePE ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.InterferenceProtocolExtension.CreateInterferenceObjects(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
The implementer is expected to create new Entity instance(s), based on interference between the two provided entities, and append the new entities to the returned array.
ent1:  Input entity 1
ent2:  Input entity 2
flags:  Input interference flags