Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32
This .NET class wraps the AcGiImageBGRA32 ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32.#ctor(System.UInt32,System.UInt32,System.IntPtr)
Constructor which sets all the necessary values.
width:  Input the image's width
height:  Input the image's height
imageData:  Input the image's buffer data

Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32.Image
Accesses the image's buffer data.

Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32.Height
Accesses the image's height.

Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32.Width
Accesses the image's width.