Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback
This wraps the ObjectARX AcDbAssocEvaluationCallback class.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.EvaluationMode
The action needs to call this method at the beginning of the Evaluate() code to obtain the mode in which it should evaluate itself.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluation(Autodesk.AutoCAD.DatabaseServices.AssocAction)
The action informs that it is starting its evaluation.
action:  The action that is being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.EndActionEvaluation(Autodesk.AutoCAD.DatabaseServices.AssocAction)
The action informs that it has finished its evaluation.
action:  The action that is being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.SetActionEvaluationErrorStatus(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.Runtime.ErrorStatus,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.DBObject,System.IntPtr)
The action informs that an error happened during its evaluation.
action:  The action that is being evaluated.
errorStatus:  Action evaluation error status.
objectId:  The failed object id (such as of an AssocDependency).
errorInfo:  Additional info about the error.
object:  The failed object pointer (such as of an AssocDependency).

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.SetActionEvaluationErrorStatus(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.Runtime.ErrorStatus)
The action informs that an error happened during its evaluation.
action:  The action that is being evaluated.
errorStatus:  Action evaluation error status.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluationUsingObject(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean,System.Boolean,Autodesk.AutoCAD.DatabaseServices.DBObject)
The action informs that it is going to use or modify an DBObject. The action issues this callback just before it opens the object for read or write.
The custom evaluation callback code may pass back a pointer to a substitute DBObject. If it happens, the action should use or modify this substitute object instead of the original object. The substitute object is expected to already be correctly open for read or write (if it is a database-resident object), the action does not need to open or close it. Also, the substitute object may possibly be a non-database-resident object and the action should be ok with it.
This allows the custom evaluation callback code to redirect the action evaluation to use or modify other objects than the action depends on. A common example is dragging, when the action may be redirected to use and modify temporary non-database resident clones of the original objects. The custom evaluation callback code creates non-database resident clones of any relevant Enities when notified by the action that the action is going to modify them, and the action then modifies these temporary clones. The modified clones are then drawn and discarded, the original objects remain untouched.
objectId:  The DBObject that is going to be used or modified by the action.
objectIsGoingToBeUsed:  The object contents is going to be used.
objectIsGoingToBeModified:  The object contents is going to be modified.
substituteObject:  An DBObject optionally provided by the custom evaluation callback code. The custom evaluation callback code should not assign NULL to this output argument if it does not want to provide a substitute object. It should only assign a non-NULL pointer if it intends to provide a substitute object.
action:  The action that is being evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.EndActionEvaluationUsingObject(Autodesk.AutoCAD.DatabaseServices.AssocAction,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.DBObject)
The action informs that it is done with using or modifying a DBObject.
action:  The action that is being evaluated.
objectId:  The same DBObjectId that has been previously passed to the matching BeginActionEvaluationUsingObject() callback.
object:  The object that has been used or modified by the action. It may be NULL if the original object couldn't be opened or if the substitute object was not of the expected type.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.DraggingState
The action may inquire of the client code whether the evaluation is happening from inside of the dragging loop and at which stage the dragging is.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.CancelActionEvaluation
The custom evaluation callback code can request that the action evaluation should be cancelled by implementing this callback predicate.

Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback.GetTransformationType
Allows the custom evaluation callback code to pass information about what type of transformation (which AutoCAD command) has been performed with the entities prior to action evaluation.