Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap
This is class Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.GetColorMapId(Autodesk.AutoCAD.DatabaseServices.Database)
This is GetColorMapId, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.PointCloudColorSchemeChanged
This is PointCloudColorSchemeChanged, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ColorScheme(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp&)
This is ColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.HasColorScheme(System.String)
This is HasColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.SetColorScheme(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp)
This is SetColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.DeleteColorScheme(System.String)
This is DeleteColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ClassificationScheme(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp&)
This is ClassificationScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.HasClassificationScheme(System.String)
This is HasClassificationScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.SetClassificationScheme(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp)
This is SetClassificationScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.DeleteClassificationScheme(System.String)
This is DeleteClassificationScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ColorSchemeInUse
This is ColorSchemeInUse, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ClassificationColorSchemeInUse
This is ClassificationColorSchemeInUse, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ClassificationSchemeGUIDs
This is ClassificationSchemeGUIDs, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ColorSchemeGUIDs
This is ColorSchemeGUIDs, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.DefaultClassificationColorScheme
This is DefaultClassificationColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.DefaultElevationColorScheme
This is DefaultElevationColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.DefaultIntensityColorScheme
This is DefaultIntensityColorScheme, a member of class PointCloudColorMap.