Autodesk.AutoCAD.GraphicsInterface.MaterialColor
This .NET class wraps the AcGiMaterialColor ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Color
Returns the current color value.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Factor
Returns the current scale factor.

Autodesk.AutoCAD.GraphicsInterface.MaterialColor.Method
Returns the current color method Inherit or Override.