Autodesk.AutoCAD.DatabaseServices.RasterImage
This .NET class wraps the AcDbRasterImage ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RasterImage.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RasterImage.AssociateRasterDef(Autodesk.AutoCAD.DatabaseServices.RasterImageDef)
Associates the raster image def with this object.
definition:  Input raster image def

Autodesk.AutoCAD.DatabaseServices.RasterImage.EnableReactors(System.Boolean)
Assesses if reactors ought to be enabled or not.
enable:  Input boolean switch

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageSize(System.Boolean)
Gets the raw image size in pixels. (The image size is also available directly from the RasterImageDef object.)
Under certain rare conditions the cached value will temporarily be different from the value kept in the RasterImageDef object (for example, immediately after the image size has been changed by a raster edit operation but before the RasterImage entity cache is updated).
If bGetCachedValue is false (default), the image size request is forwarded to the associated RasterImageDef object. If that object can't be opened, then a locally cached value is used. If bGetCachedValue is true, the function is forced to return the cached value.
getCachedValue:  Input Boolean indicating whether the cached should be used

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundaryToWholeImage
Sets the clip boundary to coincide with the image borders.

Autodesk.AutoCAD.DatabaseServices.RasterImage.SetClipBoundary(Autodesk.AutoCAD.Geometry.Vector2d)
Specifies a polygonal clip boundary.
size:  Input vector of boundary

Autodesk.AutoCAD.DatabaseServices.RasterImage.GetClipBoundary
Returns a collection of clip boundary vertices in image pixel coordinates.

Autodesk.AutoCAD.DatabaseServices.RasterImage.GetVertices
Returns the image frame vertices to it.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Width
Accesses the width of the raster image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageTransparency
Assesses if the image is transparent or not.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ShowImage
Accesses the show parameter of the display options.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Rotation
Accesses the rotation in radians.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Position
Accesses the insertion point.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Path
Accesses the filename of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Name
Accesses the name of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageWidth
Accesses the image's width.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageHeight
Accesses the image's height.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Height
Accesses the height of the raster image in drawing units.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Fade
Accesses the current fade value of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Contrast
Accesses the current contrast value of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Brightness
Accesses the current brightness value of the image.

Autodesk.AutoCAD.DatabaseServices.RasterImage.DisplayOptions
Accesses the image display options.

Autodesk.AutoCAD.DatabaseServices.RasterImage.PixelToModelTransform
Accesses an affine transformation from image source pixels to model coordinates.

Autodesk.AutoCAD.DatabaseServices.RasterImage.IsClipped
Assesses if the image is clipped.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ClipBoundaryType
Accesses the current clip boundary type.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Scale
Accesses the effective XY scale factor for this image entity, expressed as image size in user units (as inserted and scaled into model space) divided by the original image size (derived from the image resolution specified in the image file.) Example  If the image started as an 8.5"x11" sheet of paper, but is inserted in the AutoCAD drawing so that it measures 85"x110", then the scale factor is 10.

Autodesk.AutoCAD.DatabaseServices.RasterImage.Orientation
Accesses the position and orientation of an image entity.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ReactorId
Accesses the objectId of an image entity's reactor.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageDefId
Accesses the objectId of an image entity's image definition object.