Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::AcDbAssocTrimSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody.SetTrimInfo(Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo[],System.Boolean)
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::setTrimInfo() method.

Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody.MakeTrimPermanent
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::makeTrimPermanent() method.

Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody.Untrim
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::untrim() method.

Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo[],System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody.TrimmedArea
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::getTrimmedArea() method.