Autodesk.AutoCAD.Geometry.OffsetCurve2d
This .NET class wraps the AcGeOffsetCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Constructs an offset curve that is an exact offset of the specified base curve.
baseCurve:  Input base curve
offsetDistance:  Input offset distance

Autodesk.AutoCAD.Geometry.OffsetCurve2d.Transformation
Returns transformation matrix that was applied to this curve by calling transformBy().

Autodesk.AutoCAD.Geometry.OffsetCurve2d.ParameterDirection
Returns 1 if this curve has the same parameter direction as the base curve, 0 if this curve has an opposite parameter direction as the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.OffsetDistance
Returns the signed distance that this curve is offset from the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve2d.Curve
Returns the base curve of which this curve is an offset.