Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty
This .NET class wraps the AcDbDynBlockReferenceProperty ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.GetAllowedValues
Returns the allowed values for the property.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.Value
Accesses the current value of the property on the block.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.UnitsType
Accesses the format type of the property.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.Description
Accesses the property description.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.VisibleInCurrentVisibilityState
Indicates whether the property is visible in the current visibility state.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.Show
Accesses.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.ReadOnly
Assesses whether the property is read only.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.PropertyTypeCode
Accesses the property type.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.PropertyName
Accesses the name of the property.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty.BlockId
Accesses the ObjectId of the dynamic block reference containing the property represented by the DynamicBlockReferenceProperty.