Autodesk.AutoCAD.Runtime.Registry
This is class Autodesk.AutoCAD.Runtime.Registry.

Autodesk.AutoCAD.Runtime.Registry.CurrentConfig
This is CurrentConfig, a member of class Registry.

Autodesk.AutoCAD.Runtime.Registry.ClassesRoot
This is ClassesRoot, a member of class Registry.

Autodesk.AutoCAD.Runtime.Registry.CurrentUser
This is CurrentUser, a member of class Registry.

Autodesk.AutoCAD.Runtime.Registry.LocalMachine
This is LocalMachine, a member of class Registry.