Autodesk.AutoCAD.DatabaseServices.IdMappingEventArgs
This class provides data for the various events of the database.

Autodesk.AutoCAD.DatabaseServices.IdMappingEventArgs.IdMapping
Accesses the IdMapping that is associated with this event.