Autodesk.AutoCAD.DatabaseServices.RenderSettings
This .NET class wraps the AcDbRenderSettings ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.IsPredefined
Specifies if the settings are predefined or not.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.PreviewImageFileName
Accesses the full path and file name of the preview image.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.ShadowsEnabled
Assesses whether shadows are rendered or not.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.BackFacesEnabled
Assesses whether back-facing faces are rendered.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.TextureSampling
Assesses whether sampling (filtering) of image textures is on or off.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.MaterialsEnabled
Assesses whether materials are used per-object.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.DiagnosticBackgroundEnabled
Assesses whether the diagnostic (checker) background is used for rendering.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.DisplayIndex
Accesses the display index of this render setting.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.Description
Accesses the description of the render settings.

Autodesk.AutoCAD.DatabaseServices.RenderSettings.Name
Accesses the user-defined name of the render settings.