Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback
Client code can register callbacks derived from Assoc2dConstraintCallback that are then called when some events happen with Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback.CanBeRelaxed(Autodesk.AutoCAD.DatabaseServices.ExplicitConstraint)
Allows client code to veto erasing a dimension constraint when a dimension constraint is not satisfied and is being erased during a relax evaluation of a 2D constraint group.
constraint:  The dimension constraint that is to be erased.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback.ConstraintDeactivated(Autodesk.AutoCAD.DatabaseServices.ExplicitConstraint,System.Boolean)
This function will be called when a constraint is deactivated or reactivated. This notification takes place when ExplicitConstraint.deactivate() or ExplicitConstraint.reactivate() is invoked.
constraint:  The constraint that is to be activated or deactivated.
deactivated:  Whether to deactivate or reactivate the constraint