Autodesk.AutoCAD.Runtime.DisposableWrapper
This class implements the IDisposable interface and is the common base class for all ObjectARX managed wrapper classes.

Autodesk.AutoCAD.Runtime.DisposableWrapper.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Runtime.DisposableWrapper.op_Inequality(Autodesk.AutoCAD.Runtime.DisposableWrapper,Autodesk.AutoCAD.Runtime.DisposableWrapper)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Runtime.DisposableWrapper.op_Equality(Autodesk.AutoCAD.Runtime.DisposableWrapper,Autodesk.AutoCAD.Runtime.DisposableWrapper)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Runtime.DisposableWrapper.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Runtime.DisposableWrapper.AutoDelete
Returns the AutoDelete property value.

Autodesk.AutoCAD.Runtime.DisposableWrapper.IsDisposed
Returns the IsDisposed property value.

Autodesk.AutoCAD.Runtime.DisposableWrapper.UnmanagedObject
Returns the UnmanagedObject property value.