Autodesk.AutoCAD.DatabaseServices.TextEditorParagraphTab
This wraps the ObjectARX AcDbTextEditorParagraphTab class.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraphTab.DecimalChar
Gets and sets the paragraph tab decimal char.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraphTab.Offset
Gets and sets the paragraph tab off set value.

Autodesk.AutoCAD.DatabaseServices.TextEditorParagraphTab.Type
Gets and sets the tab type.