Autodesk.AutoCAD.GraphicsInterface.TextStyle
This .NET class wraps the AcGiTextStyle ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ExtentsBox(System.String,System.Boolean,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
This function provides the means to find out the extents of the text string value1 when using the TextStyle.
If raw is true, then any AutoCAD escape sequences in the string (such as %%U, %%D, %%P, and %%nnn) are left as is and not interpreted.
value1:  Input text string for which the extents are to be determined
includeSpaces:  Input indicating if leading and trailing spaces are to be included
raw:  Input indicating if the AutoCAD escape sequences are to be interpreted
context:  Input if NULL, the AutoCAD default regen pipeline is used to calculate extents

Autodesk.AutoCAD.GraphicsInterface.TextStyle.SetTrackKerning(System.Double)
For internal use.
trackPercent:  Input. For internal use.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FromTextStyleTableRecord(System.String)
Copies the style properties from the TextStyleTableRecord whose name is AcDbStyleName.
e:  The name of the TextStyleTableRecord to copy from

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FromTextStyleTableRecord(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Copies the style properties from the TextStyleTableRecord whose ObjectId is AcDbStyleId.
e:  The ObjectId of the TextStyleTableRecord to copy from

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ToTextStyleTableRecord(System.String)
Copies the style properties to the TextStyleTableRecord whose name is AcDbStyleName.
e:  The name of the TextStyleTableRecord to copy to

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ToTextStyleTableRecord(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Copies the style properties to the TextStyleTableRecord whose ObjectId is AcDbStyleId.
e:  The ObjectId of the TextStyleTableRecord to copy to

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ToTextStyleTableRecord
Copies the style properties to a TextStyleTableRecord whose name is same as this TextStyle's name.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.PreLoaded
For internal use.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Font
Returns the font definition from the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.StyleName
Returns a pointer to the styleName of the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.BigFontFileName
Returns the big font file name in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.FileName
Returns the font file name in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Strikethrough
This wraps the AcGiTextStyle::setStrikethrough() and AcGiTextStyle::strikethrough().

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Overlined
Returns true if the TextStyle object is set to display text with a line over it (that is, similar to underlining, but over the text instead of under it).

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Underlined
Returns true if the TextStyle object is set to display underlined text.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Vertical
Returns True if the TextStyle object is set to display text vertically rather than horizontally.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.UpsideDown
Returns True if the TextStyle object is set to display text upside down.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.Backward
Returns Boolean indicating if text should be displayed backwards.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.TrackingPercent
Returns the tracking percent in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.ObliquingAngle
Returns the text obliquing angle (in radians) currently in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.XScale
Returns the X scale factor currently in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.TextSize
Returns the text height currently in use by the TextStyle object.

Autodesk.AutoCAD.GraphicsInterface.TextStyle.LoadStyleRec
This function loads a font (not a style) and is run after TextStyle.FileName or TextStyle.BigFontFileName has set the font file name.