Autodesk.AutoCAD.GraphicsInterface.SkyBackgroundTraits
This .NET class wraps the AcGiSkyBackgroundTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.SkyBackgroundTraits.SkyParameters
Accesses the sky parameters for this background.