Autodesk.AutoCAD.DatabaseServices.EqualHelpParameterConstraint
This class represents a EqualHelpParameter constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.EqualHelpParameterConstraint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.EqualHelpParameterConstraint.GetEqualHelpParameters(Autodesk.AutoCAD.DatabaseServices.HelpParameter&,Autodesk.AutoCAD.DatabaseServices.HelpParameter&)
Returns pointers to the two HelpParameter objects which this constraint is connected to.
pHelpParameter1:  The returned pointer to the first AcHelpParameter object.
pHelpParameter2:  The returned pointer to the second AcHelpParameter object.