Autodesk.AutoCAD.Geometry.Matrix3dBuilder
This class is required to build instances of Autodesk.AutoCAD.Geometry.Matrix3d , which is an immutable value type.

Autodesk.AutoCAD.Geometry.Matrix3dBuilder.#ctor(Autodesk.AutoCAD.Geometry.Matrix3d)
Constructs a new builder based on an existing matrix.
value:  Input matrix

Autodesk.AutoCAD.Geometry.Matrix3dBuilder.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Matrix3dBuilder.ToMatrix3d
Returns the Matrix3d object built using this object.