Autodesk.AutoCAD.Runtime.RXObject
This .NET class wraps the AcRxObject ObjectARX class.

Autodesk.AutoCAD.Runtime.RXObject.GetClass(System.Type)
Looks up and returns the RXClass object that corresponds to type.
type:  Input type to get

Autodesk.AutoCAD.Runtime.RXObject.X(Autodesk.AutoCAD.Runtime.RXClass)
Searches for a protocol extension object associated with this class.
protocolClass:  Input protocol class

Autodesk.AutoCAD.Runtime.RXObject.QueryX(Autodesk.AutoCAD.Runtime.RXClass)
Searches for a protocol extension object associated with this object.
protocolClass:  Input protocol to query with

Autodesk.AutoCAD.Runtime.RXObject.GetRXClass
Returns the RXClass.

Autodesk.AutoCAD.Runtime.RXObject.CompareTo(System.Object)
Allow classes to provide a means to compare class objects.
obj:  Input object to compare with.

Autodesk.AutoCAD.Runtime.RXObject.Clone
Creates a clone of the object and returns a pointer to the clone.

Autodesk.AutoCAD.Runtime.RXObject.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies the contents of other into the messaged object, whenever feasible.
source:  Input object to copy from.