Autodesk.AutoCAD.DatabaseServices.RadiusDiameterConstraint
This class represents a radius or diameter constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.RadiusDiameterConstraint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RadiusDiameterConstraint.ConstrType
Gets the constraint type of this constraint.