Autodesk.AutoCAD.DatabaseServices.DataColumn
This .NET class wraps the AcDbDataColumn ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor(Autodesk.AutoCAD.DatabaseServices.CellType,System.String)
Constructor.
type:  Input Autodesk.AutoCAD.DatabaseServices.CellType enum to define the column type
columnName:  Input string for the column name

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor(Autodesk.AutoCAD.DatabaseServices.DataColumn)
Sets the column to a standard format.
column:  Set the column to a specific type

Autodesk.AutoCAD.DatabaseServices.DataColumn.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DataColumn.Assign(Autodesk.AutoCAD.DatabaseServices.DataColumn)
Assigns a new column to this object.
col:  New column to add

Autodesk.AutoCAD.DatabaseServices.DataColumn.GetCellAt(System.Int32)
This function retrieves the cell at the position in this column specified by index.
index:  Index of cell to retrieve

Autodesk.AutoCAD.DatabaseServices.DataColumn.SetCellAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
This function sets the cell at the specified index.
index:  Index of the cell to be updated
cell:  Cell to set

Autodesk.AutoCAD.DatabaseServices.DataColumn.AppendCell(Autodesk.AutoCAD.DatabaseServices.DataCell)
This function appends the specified cell to the end of the column.
cell:  New cell to add

Autodesk.AutoCAD.DatabaseServices.DataColumn.InsertCellAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
This function inserts the cell into the column at the specified index.
index:  Position at which to insert the cell
cell:  Cell to insert

Autodesk.AutoCAD.DatabaseServices.DataColumn.RemoveCellAt(System.Int32)
This function removes the cell at the specified index.
index:  Index of cell to remove from the column

Autodesk.AutoCAD.DatabaseServices.DataColumn.GetIndexAtCell(Autodesk.AutoCAD.DatabaseServices.DataCell)
This function searches the column for the first cell with a value that matches cell.
cell:  Input cell to be matched

Autodesk.AutoCAD.DatabaseServices.DataColumn.NumCells
Accesses the number of cells.

Autodesk.AutoCAD.DatabaseServices.DataColumn.ColumnName
Accesses the name of the column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.ColumnType
Accesses the type of the column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.GrowLength
Accesses the grow length of the column.

Autodesk.AutoCAD.DatabaseServices.DataColumn.PhysicalLength
Accesses the physical length of the column.