Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup
The Assoc2dConstraintGroup class represents a set of geometric constraint relations between subentities of geometric entities.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.#ctor(Autodesk.AutoCAD.Geometry.Plane)
Default constructor.
plane:  Input Plane of the newly created constraint group object. Default value is Plane::kXYPlane.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.TransformActionBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the work plane of the constraint group by the rigid motion component of the transformation matrix.
transform:  The given transformation matrix.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.SolutionStatus(System.Boolean)
Gets the solution evaluation status of this constraint group. Normally this method should only be called after an evaluation.
alsoCheckForConstraints:  Input boolean indicating if need to check constraints. Default value is true.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GeometryStatus(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry)
Gets the evaluation status of the passed in constrained geometry.
consGeom:  Input reference to ConstrainedGeometry indicating the constrained geometry object to be checked.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.ConstraintStatus(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint)
Gets the evaluation status of the passed in constraint.
constraint:  Input reference to GeometricalConstraint indicating the constraint object to be checked.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Creates and adds a new ConstrainedGeometry object into this constraint group.
subentPath:  Input FullSubentPath of the constrained entity, down to the subentity level. Only SubentityType.Edge and SubentityType.Vertex are valid subent types. The vertex subent must NOT be edge vertex.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.DeleteConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Deletes an existing ConstrainedGeometry object which is internally held.
geomDependencyId:  Input ObjectId of the AssocGeomDependency object.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency,Autodesk.AutoCAD.DatabaseServices.ImplicitPointType,System.Int32,System.Boolean)
Gets the reference to the corresponding internally held ConstrainedGeometry. The reference returned might be temporary and the caller should not cache it for future use; instead the caller may cache the node id of ConstrainedGeometry.
geomDependency:  Input reference to AssocGeomDependency of the constrained entity. The AssocGeomDependency object maybe transient, in other words, not added into the database yet.
ptType:  Input reference to ConstrainedImplicitPoint::ImplicitPointType indicating the implicit point type of a constrained curve. Only present when caller want to retrieve the ConstrainedImplicitPoint of a ConstrainedCurve. Default value is NULL.
defPtIndex:  Input integer index of define points of a parametric curve. Currently only control points of a spline are supported. It is only valid when the implicit point type is kDefineImplicit. Default value is -1(invalid index value).
createArcLineMid:  Input Boolean indicating if create implicit midpoint of arc or line segment if it is not there. Default value is false.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency)
Gets the reference to the corresponding internally held ConstrainedGeometry.
geomDependency:  Input reference to AssocGeomDependency of the constrained entity. The AssocGeomDependency object maybe transient, in other words, not added into the database yet.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
Gets the reference to the corresponding internally held ConstrainedGeometry. The reference returned might be temporary and the caller should not cache it for future use; instead the caller may cache the node id of ConstrainedGeometry.
createArcLineMid:  Input Boolean indicating if create implicit midpoint of arc or line segment if it is not there. Default value is false.
fullSubentPath:  Input FullSubentPath of the constrained entity, down to the subentity level. Only vertex or edge subentity type can be passed in.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddGeometricalConstraint(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.ConstraintType,Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[])
Creates and adds a geometrical constraint into this constraint group.
type:  Input GeometricalConstraint::GeometricalConstraintType indicating the type of constraint to be created.
consGeoms:  Input array of the ConstrainedGeometry.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddGeometricalConstraint(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.ConstraintType,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Creates and adds a geometrical constraint into this constraint group.
type:  Input GeometricalConstraint::GeometricalConstraintType indicating the type of constraint to be created.
paths:  Input array of the FullSubentPath which can be mapped to ConstrainedGeometry.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddAngularConstraint(Autodesk.AutoCAD.DatabaseServices.ConstrainedLine,Autodesk.AutoCAD.DatabaseServices.ConstrainedLine,Autodesk.AutoCAD.DatabaseServices.AngularConstraint.AngularSectorType,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates and adds an angle constraint into this constraint group.
consLine1:  Input reference to ConstrainedLine object
consLine2:  Input reference to ConstrainedLine object
sectorType:  Input AngularConstraint.SectorType indicating the angle sector to measure.
valueDependencyId:  Input object id of the value dependency object.
dimDependencyId:  Input object id of the dimension dependency object.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.Add3PointAngularConstraint(Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint,Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint,Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint,Autodesk.AutoCAD.DatabaseServices.AngularConstraint.AngularSectorType,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates and adds a 3point angle constraint into this constraint group.
consPoint1:  Input reference of the first (angle) point which must be a kind of ConstraintPoint
consPoint2:  Input reference of the second point which must be a kind of ConstraintPoint
consPoint3:  Input reference of the third point which must be a kind of ConstraintPoint
sectorType:  Input AngularConstraint::SectorType indicating the angle sector to measure.
valueDependencyId:  Input object id of the value dependency object.
dimDependencyId:  Input object id of the dimension dependency object.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddRadiusDiameterConstraint(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry,Autodesk.AutoCAD.DatabaseServices.RadiusDiameterConstraint.RadDiaConstrType,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates and adds a radius or diameter constraint into this constraint group.
consGeom:  Input reference to ConstrainedGeometry object which must be a kind of ConstrainedCircle or ConstrainedEllipse.
type:  Input RadiusDiameterConstraint::RadiusDiameterConstrType indicating the type of constraint to be created.
valueDependencyId:  Input object id of the value dependency object.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.DeleteConstraint(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint)
Deletes an existing GeometricalConstraint object which is internally held.
geomConst:  Input GeometricalConstraint indicating the constraint to be deleted.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AutoConstrain(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.Geometry.Tolerance,Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback)
Defines constraints that can be added to an under-constrained model.
paths:  List of subentites which are to be constrained automatically.
tol:  Tol to define distance tolerance as well as angle tolerance. Tolerance.EqualPoint() defines distance tolerance and Tolerance.EqualVector() defines angle tolerance. Angle tolerance is in radians of angle.
callback:  Reference to autoconstraint evaluation callback. This callback will implement constraint priority and priority override.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetAllConnectedGeomDependencies(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets all AssocGeomDependency objects which are connected by constraints.
srcGeomDependencyIds:  Input ObjectIdArray indicating the source AssocGeomDependency objects.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetGroupNode(System.UInt32)
Gets a reference to the ConstraintGroupNode object.
nodeId:  Input ConstraintGroupNodeId indicating the node id.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.RegenDimensionSystem
Regenerates the internal dimension system.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GeometryMirrored(Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency)
Called by the client code to inform the constraint group that the dependent entity for geomDependency has been mirrored.
geomDependency:  Reference to AssocGeomDependency for which implicit point needs to be updated for mirror action.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.AddGlobalCallback(Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback)
See the explanation of Assoc2dConstraintCallback.
callback:  The callback to be registered.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.RemoveGlobalCallback(Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintCallback)
See the explanation for Assoc2dConstraintCallback.
callback:  The callback to be unregistered.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GlobalCallback
Returns a callback that is the collection of all callbacks registered by the client code.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.Constraints
Gets all GeometricalConstraint objects in this constraint group, including topological and dimensional constraints.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.ConstrainedGeometries
Gets all ConstrainedGeometry objects in this constraint group, including ConstraintImplicitPoint objects which are associated with corresponding ConstrainedCurve objects.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.GetDOF
Gets the remaining DOF (Degree of Freedom) of this constraint group.

Autodesk.AutoCAD.DatabaseServices.Assoc2dConstraintGroup.WorkPlane
This is WorkPlane, a member of class Assoc2dConstraintGroup.