Autodesk.AutoCAD.DatabaseServices.HostApplicationServices
This .NET class wraps the AcDbHostApplicationServices ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FindFile(System.String,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.FindFileHint)
This method is called by the database code when it is trying to locate a file.
fileName:  Given name of the file to find.
database:  This will give you the path to the DWG file associated with the database, which may also be searched for the requested file. If this file search is not related to a database, database will be NULL.
hint:  Caller may pass you a hint, that you may choose to use to narrow your search.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.LoadApplication(System.String,Autodesk.AutoCAD.DatabaseServices.ApplicationLoadReasons,System.Boolean,System.Boolean)
The default implementation of this method simply calls DynamicLinker.LoadApp(). The arguments are equivalent and are passed unchanged.
This API is provided so that RealDWG developers can override LoadApp() for their host application services implementation, and do anything special needed by their application.
appName:  Input null-terminated string which is the application name (as set in the system registry) of the ObjectARX module to load
why:  Input LoadReasons values to use during this load
printIt:  Input Boolean indicating whether or not to print load status message
asCmd:  Input Boolean indicating whether to load the application as if by user command

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.IsUrl(System.String)
Determines whether the string filePath refers to a valid URL; returns true if it is and false otherwise.
filePath:  Input string to be evaluated

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetUrl(System.String)
Inverse of the isURL method.
localFile:  Input local file

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetRemoteFile(System.Uri,System.Boolean)
Returns the resource (file) identified by the URL url. The Boolean argument ignoreCache determines whether the file should be downloaded even if it has already been transferred earlier in the session.
This method, if you implement it, should allow the user transparent access to files on remote servers on the Internet.
url:  Input URL
ignoreCache:  Input Boolean indicating whether to download the file even if it has be cached earlier in the session

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.PutRemoteFile(System.Uri,System.String)
Uploads a local resource (file) identified by the pathname localFile to the remote location specified by the URL url.
url:  Input URL to which to upload file
localFile:  Input local file to upload

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetPassword(System.String,Autodesk.AutoCAD.DatabaseServices.PasswordOptions)
This function is called internally by host applications such as AutoCAD and other ObjectARX applications (via the ReadDwgFile() function) to display a password-request dialog box.
dwgName:  Name of the drawing file that is requiring a password
options:  Boolean indicating whether dwgName refers to an xref'd drawing

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetEnvironmentVariable(System.String)
This is GetEnvironmentVariable, a member of class HostApplicationServices.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.UserBreak
The UserBreak() method is called by the database code to see if the user has entered a CTRL+C break.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FatalError(System.String)
The database calls FatalError() when it encounters a fatal error.
message:  The error message.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.NotifyCorruptDrawingFoundOnOpen(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Runtime.ErrorStatus)
This method is called when an attempt is made to read in a corrupt drawing.
id:  The ID of the corrupt DB object that cannot be read.
es:  The return code of the attempt to read in the corrupt DB object.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.ColorBookLocation
This is ColorBookLocation, a member of class HostApplicationServices.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.ModelerFlavor
Accesses the level of geometric modeler support available from the RealDWG host application.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.FontMapFileName
Accesses the name of the fontmap file.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.AlternateFontName
Accesses the name of the 'alternate' font, that is, the default font to use in the event that any font cannot be found.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.AllUsersRootFolder
Returns the full path to the AutoCAD all users folder where the files shared by all users were installed.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.LocalRootFolder
Accesses the local directory.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.RoamableRootFolder
Accesses the local roamable files directory.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.WorkingDatabase
Accesses the primary database open in whichever document (window) has focus.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.releaseMarketVersion
This value is primarily used in User Interface.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.UserRegistryProductRootKey
Use this function to obtain registry root for storing/retrieving product specific user data.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.MachineRegistryProductRootKey
Use this function to obtain registry root for storing/retrieving product specific data.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.CompanyName
Accesses the "About" information for the company.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.Product
Accesses the "About" information for the product.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.Program
Accesses the "About" information for the program.

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.Current
Accesses the current HostApplicationServices object being used.