Autodesk.AutoCAD.DatabaseServices.DataLink
This .NET class wraps the AcDbDataLink ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataLink.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DataLink.GetTargets
Returns the IDs of the entities which use this data link.

Autodesk.AutoCAD.DatabaseServices.DataLink.GetSourceFiles(Autodesk.AutoCAD.DatabaseServices.DataLinkGetSourceContext)
Returns the external source files on which the data link is dependent.
nContext:  Context in which this method is called

Autodesk.AutoCAD.DatabaseServices.DataLink.RepathSourceFiles(System.String,Autodesk.AutoCAD.DatabaseServices.PathOption)
Repaths the path references to the external source files.
sBasePath:  The base path
nOption:  The path option

Autodesk.AutoCAD.DatabaseServices.DataLink.IsValid
Accesses if the data link is valid and can be used to update data.

Autodesk.AutoCAD.DatabaseServices.DataLink.UpdateOption
Accesses the update option.

Autodesk.AutoCAD.DatabaseServices.DataLink.DataLinkOption
Accesses the data link option.

Autodesk.AutoCAD.DatabaseServices.DataLink.ToolTip
Accesses the data link tool tip string.

Autodesk.AutoCAD.DatabaseServices.DataLink.Description
Accesses the data link description.

Autodesk.AutoCAD.DatabaseServices.DataLink.Name
Accesses the name of the data link.

Autodesk.AutoCAD.DatabaseServices.DataLink.ConnectionString
Accesses the connection string which describes the data source.

Autodesk.AutoCAD.DatabaseServices.DataLink.DataAdapterId
Accesses the data adapter ID.