Autodesk.AutoCAD.GraphicsInterface.ViewportTraits
This .NET class wraps the AcGiViewportTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.ToneOperatorParameters
Provides access to tone operator parameters for this viepwort.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.RenderSettings
Returns the object ID of the RenderSettings object applied to this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.RenderEnvironment
Returns the object ID of the RenderEnvironment object associated with this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Contrast
Returns the current contrast value for the viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Brightness
Returns the current brightness value for the viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.AmbientLightColor
Returns the ambient light color used by this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.DefaultLightingType
Returns the type of default lighting used by this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.DefaultLightingOn
Returns the state of default lighting for this viewport.

Autodesk.AutoCAD.GraphicsInterface.ViewportTraits.Background
Returns the object ID of the Background object.