Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator
This .NET class wraps the AcDbFilteredBlockIterator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Start
Initiates iteration.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Seek(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The Seek() method is only provided to implement legacy behavior.
id:  ObjectId to seek to

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Accepts(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the id is accepted (that is, if it can be output).
id:  Object ID that is being composed, typically output of a previous iterator's Accepts() method or Id property

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.AddToBuffer(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method adds the Id to an internal buffer maintained by an index iterator.
id:  Object ID that is being composed, typically output of a previous iterator's Accepts() method or Id property

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.BuffersForComposition
During use by CompositeFilteredBlockIterator, the way multiple index/filter pairs are handled is through allocating corresponding FilteredBlockIterator objects, and prioritizing their use through the EstimatedHitFraction property.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.EstimatedHitFraction
Used to prioritize the order in which FilteredBlockIterator objects will be used during a block traversal.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Id
Accesses the ObjectId at the current iterator position.

Autodesk.AutoCAD.DatabaseServices.Filters.FilteredBlockIterator.Next
Accesses the cursor and returns the next ObjectId.