Autodesk.AutoCAD.DatabaseServices.Material
This .NET class wraps the AcDbMaterial ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Material.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Material.FinalGather
Accesses the final gathering mode.

Autodesk.AutoCAD.DatabaseServices.Material.GlobalIllumination
Accesses the illumination mode.

Autodesk.AutoCAD.DatabaseServices.Material.Anonymous
Accesses an indication that the material is "anonymous" in that it is intended for programmatic usage via API only, and should not be exposed through any user interface.

Autodesk.AutoCAD.DatabaseServices.Material.NormalMap
Accesses the material map for the normal map channel of the material, the method used to compute the normal map, and the channel strength.

Autodesk.AutoCAD.DatabaseServices.Material.Luminance
Accesses the luminance value of the material.

Autodesk.AutoCAD.DatabaseServices.Material.LuminanceMode
Accesses the luminance mode of the material.

Autodesk.AutoCAD.DatabaseServices.Material.TwoSided
Assesses if the material is two-sided.

Autodesk.AutoCAD.DatabaseServices.Material.TransmittanceScale
Accesses the transmittance scale.

Autodesk.AutoCAD.DatabaseServices.Material.ReflectanceScale
Accesses the reflectance scale value for the material.

Autodesk.AutoCAD.DatabaseServices.Material.IndirectBumpScale
Accesses the indirect bump scale value for the material.

Autodesk.AutoCAD.DatabaseServices.Material.ColorBleedScale
Accesses the color bleed scale value for the material.

Autodesk.AutoCAD.DatabaseServices.Material.Mode
Accesses the mode of this material.

Autodesk.AutoCAD.DatabaseServices.Material.ChannelFlags
Accesses the channel flags for this material.

Autodesk.AutoCAD.DatabaseServices.Material.IlluminationModel
Accesses the illumination model set on this material.

Autodesk.AutoCAD.DatabaseServices.Material.Reflectivity
Accesses the reflectivity of the material.

Autodesk.AutoCAD.DatabaseServices.Material.SelfIllumination
Accesses the self-illumination property of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Translucence
Accesses the translucence value of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Refraction
Accesses the refraction component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Bump
Accesses the bump component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Opacity
Accesses the opacity component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Reflection
Accesses the reflection component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Specular
Accesses the specular component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Diffuse
Accesses the diffuse component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Ambient
Accesses the ambient component of the material.

Autodesk.AutoCAD.DatabaseServices.Material.Description
Accesses the material description string.

Autodesk.AutoCAD.DatabaseServices.Material.Name
Accesses the material name string.