Autodesk.AutoCAD.Geometry.PlanarEntity
This .NET class wraps the AcGePlanarEnt ObjectARX class.

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls PlanarEntity.IsPerpendicularTo(PlanarEntity linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true, if the plane of this planar entity and linear entity linearEntity are perpendicular within the tolerance tolerance.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls PlanarEntity.IsPerpendicularTo(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.PlanarEntity.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true, if the plane of this planar entity and the plane of the planar entity linearEntity are perpendicular within the tolerance tolerance.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls PlanarEntity.IsParallelTo(PlanarEntity otherPlanarEntity, Tolerance tolerance) with tolerance set to Global.
otherPlanarEntity:  Input other planar entity

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are parallel within the tolerance tolerance.
otherPlanarEntity:  Input other planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls PlanarEntity.IsParallelTo(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.PlanarEntity.IsParallelTo(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Overloads for the PlanarEntity.IsParallelTo method.
linearEntity:  Input linear entity
tolerance:  Input tolerance valueDetermines if line is parallel to input plane.

Autodesk.AutoCAD.Geometry.PlanarEntity.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls PlanarEntity.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.PlanarEntity.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this planar entity intersects the linear entity linearEntity.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToLinearEntity(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any LinearEntity3d object

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToLinearEntity(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Evaluates the pair of closest points between this planar entity and the linear entity line.
line:  Input any LinearEntity3d object
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity otherPlane, Tolerance tolerance) with tolerance set to Global.
otherPlane:  Input any PlanarEntity object

Autodesk.AutoCAD.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Evaluates the pair of closest points between this planar entity and the planar entity otherPlane.
otherPlane:  Input any PlanarEntity object
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.IsCoplanarTo(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls PlanarEntity.IsCoplanarTo(PlanarEntity otherPlaneEntity, Tolerance tolerance) with tolerance set to Global.
otherPlanarEntity:  Input other planar entity

Autodesk.AutoCAD.Geometry.PlanarEntity.IsCoplanarTo(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the plane of this planar entity and the plane of the planar entity otherPlanarEntity are equal within the tolerance tolerance.
otherPlanarEntity:  Input other planar entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.PlanarEntity.GetCoordinateSystem
Evaluates the canonical coordinate system of this planar entity and returns it in the output coordinate system arguments.

Autodesk.AutoCAD.Geometry.PlanarEntity.Coefficients
Evaluates the coefficients of the equation of the plane containing this planar entity, namely a*x + b*y + c*z + d, where a, b, c, and d are coefficients of the normal to this surface.

Autodesk.AutoCAD.Geometry.PlanarEntity.Normal
Returns the unit normal to the plane of this planar entity.

Autodesk.AutoCAD.Geometry.PlanarEntity.PointOnPlane
Returns originOfPlanarEntity.