Autodesk.AutoCAD.ComponentModel.PropertyProviderAttribute
This attribute can be applied to a class and is used to associate IPropertyProvider objects with the target class.

Autodesk.AutoCAD.ComponentModel.PropertyProviderAttribute.#ctor(System.Type)
A constructor which creates a PropertyProviderAttribute of type type.
type:  Input type of attribute

Autodesk.AutoCAD.ComponentModel.PropertyProviderAttribute.PropertyProviderType
Accesses the type of the PropertProviderAttribute.