Autodesk.AutoCAD.DatabaseServices.TextEditor
This wraps the ObjectARX AcDbTextEditor class.

Autodesk.AutoCAD.DatabaseServices.TextEditor.CreateTextEditor(Autodesk.AutoCAD.DatabaseServices.MText)
This wraps the ObjectARX AcDbTextEditor::createDbTextEditor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.ClearSelection
This wraps the ObjectARX AcDbTextEditor::clearSelection() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.MakeSelection(Autodesk.AutoCAD.DatabaseServices.TextEditorLocation,Autodesk.AutoCAD.DatabaseServices.TextEditorLocation)
This wraps the ObjectARX AcDbTextEditor::makeSelection() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.SelectAll
This wraps the ObjectARX AcDbTextEditor::selectAll() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Redraw
This wraps the ObjectARX AcDbTextEditor::redraw() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.GetFont(System.Int32)
This wraps the ObjectARX AcDbTextEditor::getFontName() and AcDbTextEditor::isTrueTypeFont() methods.

Autodesk.AutoCAD.DatabaseServices.TextEditor.EndOfText
This wraps the ObjectARX AcDbTextEditor::endOfText() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.StartOfText
This wraps the ObjectARX AcDbTextEditor::startOfText() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.DefaultStackAlignment
Gets and sets the default stack alignment for selection object.

Autodesk.AutoCAD.DatabaseServices.TextEditor.DefaultStackScale
Gets and sets the default stack scale factor for selection object.

Autodesk.AutoCAD.DatabaseServices.TextEditor.StackCount
This wraps the ObjectARX AcDbTextEditor::stackCount() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.VerticalTTF
This wraps the ObjectARX AcDbTextEditor::isVerticalTTF() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.VerticalSHX
This wraps the ObjectARX AcDbTextEditor::isVerticalSHX() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.FontCount
This wraps the ObjectARX AcDbTextEditor::getFontCount() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.TabOnlyDelimiter
This wraps the ObjectARX AcDbTextEditor::tabOnlyDelimiter() and AcDbTextEditor::setTabOnlyDelimiter() methods.

Autodesk.AutoCAD.DatabaseServices.TextEditor.AutoListEnabled
This wraps the ObjectARX AcDbTextEditor::autolistEnabled() and AcDbTextEditor::setAutolistEnabled() methods.

Autodesk.AutoCAD.DatabaseServices.TextEditor.NumberingEnabled
Gets and sets the flag to enable all the paragraphs numbering.

Autodesk.AutoCAD.DatabaseServices.TextEditor.AutoCAPS
Gets and sets the auto CAPS flag.

Autodesk.AutoCAD.DatabaseServices.TextEditor.ActualHeight
This wraps the ObjectARX AcDbTextEditor::actualHeight() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.ActualWidth
This wraps the ObjectARX AcDbTextEditor::actualWidth() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.TextHeight
Gets and sets the text height for the editor.

Autodesk.AutoCAD.DatabaseServices.TextEditor.DefinedHeight
Gets and sets the defined height for the editor.

Autodesk.AutoCAD.DatabaseServices.TextEditor.DefinedWidth
Gets and sets the defined width for the editor.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Attachment
Gets and sets the attachment point for the editor.

Autodesk.AutoCAD.DatabaseServices.TextEditor.StyleCount
This wraps the ObjectARX AcDbTextEditor::getStyleCount() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.IsAnnotativeStyle
Indicates whether the current text editor style is annotative.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Style
Gets and sets the current text editor text style object Id.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Paragraphs
Gets the TextEditorParagraph array of TextEditor.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Wipeout
This wraps the ObjectARX AcDbTextEditor::wipeout() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Cursor
This wraps the ObjectARX AcDbTextEditor::cursor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Selection
This wraps the ObjectARX AcDbTextEditor::selection() method.

Autodesk.AutoCAD.DatabaseServices.TextEditor.Columns
This wraps the ObjectARX AcDbTextEditor::columns() method.