Autodesk.AutoCAD.DatabaseServices.TransformOverrule
This .NET class wraps the ObjectARX class AcDbTransformOverrule.

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.TransformBy(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Matrix3d)
This .NET method wraps the ObjectARX method AcDbTransformOverrule::transformBy().

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.GetTransformedCopy(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Matrix3d)
This .NET method wraps the ObjectARX method AcDbTransformOverrule::getTransformedCopy().

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.Explode(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This .NET method wraps the ObjectARX method AcDbTransformOverrule::explode().

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.CloneMeForDragging(Autodesk.AutoCAD.DatabaseServices.Entity)
This .NET method wraps the ObjectARX method AcDbTransformOverrule::cloneMeForDragging().

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.HideMeForDragging(Autodesk.AutoCAD.DatabaseServices.Entity)
This .NET method wraps the ObjectARX method AcDbTransformOverrule::hideMeForDragging().

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.TransformOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.