Autodesk.AutoCAD.DatabaseServices.AssocDependency
AssocDependencies represent information about which AssocActions depend on or modify which DBObjects.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.SetStatus(Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean)
Sets the AssocStatus of the dependency. If the status is one of the codes that indicate that the action owning the dependency will need to be evaluated (the IsEvaluationRequest() predicate returns true for such a status), it can also notify the action owning the dependency to change its status indicating that it needs to be evaluated. The action may change its status and notify the network owning the action. The network may change its status and notify its owning network, etc. until all the networks in the hierarchy are notified that they contain an action that needs to be evaluated.
If the new status satisfies the IsEvaluationRequest() predicate and EvaluationRequestSeverityLevel() of the new status is lower than the current evaluation request status of the dependency, the current higher status of the dependency is kept and not overwritten by the new lower status. Also, if the current status of the dependency satisfies the IsToBeSkipped() predicate, it is not overwritten by any new status that IsEvaluationRequest(). To change the dependency status in such a case, the dependency status needs to be first changed to IsUpToDateAssocStatus, and after that it can be changed to an IsEvaluationRequest() status.
newStatus:  The new AssocStatus of the dependency.
notifyOwningAction:  If true, and the passed-in status indicates that the dependency needs to be evaluated, the status of the AssocAction owning this dependency is set to the same status (unless the action evaluation status is already more severe than the new one). The action then notifies its owning network.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.AttachToObject(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
Attaches this dependency to a given CompoundObjectId as a persistent reactor and also orders it to be at the correct position in the list of dependencies on the object, based on the dependency order().
compoundId:  The CompoundObjectId to attach the dependency to. If regular ObjectId is passed in, it is automatically converted to CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DetachFromObject
Detaches this dependency from the DBObject it is currently attached to.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.UpdateDependentOnObject
Updates the object the dependency depends on, based on the information the dependency obtains from the owning action.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.SetDependentOnObject(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
Sets the dependent-on object of this dependency to be the given CompoundObjectId.
compoundId:  The CompoundObjectId the dependency should depend-on (may be null).

Autodesk.AutoCAD.DatabaseServices.AssocDependency.GetFirstDependencyOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the first dependency on the given DBObject.
object:  The DBObject whose first dependency is requested. The object needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.GetDependenciesOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Gets all dependencies on the given DBObject. Dependencies are attached to DBObjects in the form of persistent reactors and are ordered on the object based on their Order(). The retuned array contains the dependencies properly ordered.
readDependenciesWanted:  Read-type dependencies wanted.
writeDependenciesWanted:  Write-type dependencies wanted.
object:  The DBObject whose dependencies are requested. The object needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.NotifyDependenciesOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Gets all dependencies on the given DBObject and notifies them about a change by setting their status.
newStatus:  The new status to be set to the dependencies.
object:  The DBObject whose dependencies are to be notified. The object needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsDependentOnTheSameThingAs(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
This method returns true if this dependency depends on exactly the same "thing" (such as on the same subentity of the same entity) as the other dependency.
otherDependency:  The other dependency needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Compares this dependency with the given dependency and returns true if and only if they are equal (whatever it means).
otherDependency:  The other dependency needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.Evaluate
Called by the AssocAction.EvaluateDependencies() to update the "dirty" dependencies of the action.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.CurrentEvaluationCallback
Gets the current AssocEvaluationCallback set by the AssocAction.Evaluate() call, or NULL if no action evaluation is in progress.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsActionEvaluationInProgress
Indicates whether the system is currently evaluating an action or a network of actions.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsDependentOnObjectReadOnly
Indicates whether the dependent on object is read-only, i.e., the object is not allowed to be changed.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsRelevantChange
This property indicates whether the dependent-on "thing" really changed in such a way that the change is relevant to this particular dependency type.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.HasCachedValue
Indicates whether the dependency currently holds the cached value of the "thing" it depends on.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsDelegatingToOwningAction
Gets and sets whether some dependency methods delegate to the action that owns the dependency if the method is not directly implemented in the dependency or in the AssocDependencyBody object that the dependency may own.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DependentOnObjectStatus
Gets the current status of the DependentOnObject, can be OK, NotInitializedYet or InvalidObjectId.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsAttachedToObject
Indicates whether the dependency it attached to an object.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.NextDependencyOnObject
Gets the next dependency in the list of dependencies of an DBObject or ObjectId::Null if it is the last dependency in the list.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.PrevDependencyOnObject
Gets the previous dependency in the list of dependencies of an DBObject or ObjectId::Null if it is the first dependency in the list.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsDependentOnCompoundObject
Indicates whether the dependency is using CompoundObjectId to depend on the dependent-on-object.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DependentOnCompoundObject
A dependency is attached as a persistent reactors to all objects of the CompoundObjectId.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DependentOnObject
Gets the DBObject this dependency is attached to, or ObjectId::Null if the dependency is not attached to any object.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.OwningAction
Gets and sets the owning AssocAction.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.Order
Gets and sets the order of the dependency, i.e., the order where it should be positioned in the list of all dependencies on an DBObject.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsObjectStateDependent
Sets and gets whether the AssocAction owning the dependency requires the dependent-on DBObject to be in the expected "object state" with respect to the list of dependencies on the object, before the action can be evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsWriteDependency
Sets and gets the IsWriteDependency property.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.IsReadDependency
Sets and gets the IsReadDependency property.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.Status
Gets and sets the current AssocStatus of this dependency.

Autodesk.AutoCAD.DatabaseServices.AssocDependency.DependencyBody
Gets and sets the ObjectId of an object of a class derived from AssocDependencyBody, or a null id if no dependency body object has been set.