Autodesk.AutoCAD.DatabaseServices.Field
This .NET class wraps the AcDbField ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.String,System.Boolean)
Constructor that sets the field code.
fieldCode:  Input field code
textField:  Input flag indicating whether this is a text field

Autodesk.AutoCAD.DatabaseServices.Field.#ctor(System.String)
Constructor that sets the field code.
fieldCode:  Input field code

Autodesk.AutoCAD.DatabaseServices.Field.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags,Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren)
Sets the field code.
flag:  Input flag, which can be one or more of the FieldCodeFlags values
fieldCode:  Input field code to set

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren)
Sets the field code.
fieldCode:  Input field code to set

Autodesk.AutoCAD.DatabaseServices.Field.ConvertToTextField
Converts the field to a text field.

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCode(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags)
This function can be used to get a field code in various forms.
flags:  Input flag, which can be one or more of the FieldCodeFlags values

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCode
This function can be used to get a field code in various forms.

Autodesk.AutoCAD.DatabaseServices.Field.SetFieldCode(System.String)
Sets the field code.
fieldCode:  Input field code to set

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCodeWithChildren(Autodesk.AutoCAD.DatabaseServices.FieldCodeFlags)
This function can be used to get a field code in various forms.
flags:  Input flag, which can be one or more of the FieldCodeFlags values

Autodesk.AutoCAD.DatabaseServices.Field.GetFieldCodeWithChildren
This function can be used to get a field code in various forms.

Autodesk.AutoCAD.DatabaseServices.Field.GetChildren
Gets the child field.

Autodesk.AutoCAD.DatabaseServices.Field.GetChildrenIds
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.Field.Evaluate
This method evaluates the field.

Autodesk.AutoCAD.DatabaseServices.Field.Evaluate(System.Int32,Autodesk.AutoCAD.DatabaseServices.Database)
This method evaluates the field.
evaluationOptions:  Input context in which the field is evaluated; the context flag can be one of the predefined FieldEvaluationContext enum flags or a user-defined context flag
database:  Input database to be used for the evaluation, which can be null

Autodesk.AutoCAD.DatabaseServices.Field.GetStringValue
Returns the string.

Autodesk.AutoCAD.DatabaseServices.Field.GetData(System.String)
Gets data from the field object using a key.
key:  Input key to get the data; the key cannot be null or an empty string

Autodesk.AutoCAD.DatabaseServices.Field.SetData(System.String,System.Object,System.Boolean)
Sets data in the field object using a key. The data will be copied and stored in the field object, and filed in and filed out with it. If the data contains an object ID, it will be properly translated during wblock operations.
Pass null for data to delete the data at the specified key.
key:  Input key to use to set and get the data; the key cannot be null or an empty string
data:  Input the object that contains the data
recursive:  Input true if the data is to be set in all child fields, false if it is to be set only in this field

Autodesk.AutoCAD.DatabaseServices.Field.SetData(System.String,System.Object)
Sets data in the field object using a key.
key:  Input key to use to set and get the data; the key cannot be null or an empty string
data:  Input the object that contains the data

Autodesk.AutoCAD.DatabaseServices.Field.FindField(System.String,System.Int32,System.Int32&,System.Int32&)
This function can be used to extract the embedded fields in text.

Autodesk.AutoCAD.DatabaseServices.Field.HyperLink
Accesses the hyperlink associated with the field.

Autodesk.AutoCAD.DatabaseServices.Field.Value
Accesses the field evaluation result in its original data type.

Autodesk.AutoCAD.DatabaseServices.Field.DataType
Accesses the data type of the field evaluation result.

Autodesk.AutoCAD.DatabaseServices.Field.Format
Accesses the output format set in the field.

Autodesk.AutoCAD.DatabaseServices.Field.IsTextField
Assesses true if this field is a text field, which is text with embedded fields.

Autodesk.AutoCAD.DatabaseServices.Field.EvaluatorId
Accesses the ID of the evaluator used by the field for evaluation.

Autodesk.AutoCAD.DatabaseServices.Field.FilingOption
Accesses the filing option set in the field.

Autodesk.AutoCAD.DatabaseServices.Field.EvaluationOption
Accesses the evaluation option explicitly set in the field.

Autodesk.AutoCAD.DatabaseServices.Field.EvaluationStatus
Accesses the evaluation status set by the evaluator.

Autodesk.AutoCAD.DatabaseServices.Field.State
Accesses the field state, which can be one or more of the FieldState values.