Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs
This class provides data for the OnDimensionValueChanged function of the Jig class.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs.#ctor(System.Int32,System.Double)
This constructor sets the index and value for the new object.
index:  Input the index of the dimension
value:  Input the floating point value of the dimension

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs.Value
Accesses the value of the dimension.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionChangedEventArgs.Index
Accesses the index value.