Autodesk.AutoCAD.GraphicsInterface.Polyline
This .NET class wraps the ObjectARX AcGiPolyline Class.

Autodesk.AutoCAD.GraphicsInterface.Polyline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.IntPtr)
Constructor.
pPoints:  A list of points
normal:  Input normal.
pBaseSubEntMarker:  Subentity marker for first segment.

Autodesk.AutoCAD.GraphicsInterface.Polyline.#ctor
Constructor.

Autodesk.AutoCAD.GraphicsInterface.Polyline.BaseSubEntMarker
Accesses the subentity marker.

Autodesk.AutoCAD.GraphicsInterface.Polyline.Normal
Accesses the Normal.

Autodesk.AutoCAD.GraphicsInterface.Polyline.Points
Accesses the list of points.