Autodesk.AutoCAD.GraphicsInterface.TransientManager
This .NET class wraps the AcGiTransientManager ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.TransientManager.AddTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.TransientDrawingMode,System.Int32,Autodesk.AutoCAD.Geometry.IntegerCollection)
This function adds a transient to a list of viewports.
added:  Input the transient to be added
mode:  Input the drawing mode where transient will be added
subDrawingMode:  Input the sub drawing mode of specified drawing mode
viewportNumbers:  Input viewport numbers for viewports to add this transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.EraseTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.Geometry.IntegerCollection)
This function erases a transient from a list of viewports.
erased:  Input the transient to be removed
viewportNumbers:  Input viewport numbers for viewports to erase this transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.EraseTransients(Autodesk.AutoCAD.GraphicsInterface.TransientDrawingMode,System.Int32,Autodesk.AutoCAD.Geometry.IntegerCollection)
This function erases all transients in the specified subDrawingMode from a list of viewports.
mode:  Input the drawing mode where transient stores
subDrawingMode:  Input the sub drawing mode of specified drawing mode of transient being erased
viewportNumbers:  Input viewport numbers for viewports to erase this transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.UpdateTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.Geometry.IntegerCollection)
Update a transient via the transient manager.
updated:  Input the transient being updated via transient manager
viewportNumbers:  Input viewport numbers for viewports to update this transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.AddChildTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function adds a child transient to specified parent transient.
added:  Input the adding child transient
parent:  Input the parent transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.EraseChildTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function erases a child transient from specified parent transient.
erased:  Input the erasing child transient
parent:  Input the parent transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.UpdateChildTransient(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function only updates a child transient of the specified parent transient.
updated:  Input the updating child transient
parent:  Input the parent transient

Autodesk.AutoCAD.GraphicsInterface.TransientManager.CurrentTransientManager
Accesses the current transient manager.