Autodesk.AutoCAD.Geometry.ExternalCurve3d
This .NET class wraps the AcGeExternalCurve3d ObjectARX class.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.ExternalCurveKind
Provides information concerning the native system in which the external curve definition was created.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.NativeCurve
Returns gelib native representation for the external curve.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsNativeCurve
Certain external curve definition may have corresponding native gelib representations.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsDefined
Determines whether the instance is empty.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsNurbCurve
Determines whether the external curve instance can be represented by a curve definition that is native to gelib.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsEllipticalArc
Determines whether the external curve instance can be represented by a curve definition that is native to gelib.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsCircularArc
Determines whether the external curve instance can be represented by a curve definition that is native to gelib.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsLineSegment
Determines whether the external curve instance can be represented by a curve definition that is native to gelib.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsRay
Assesses if the curve is a ray.

Autodesk.AutoCAD.Geometry.ExternalCurve3d.IsLine
Determines whether the external curve instance can be represented by a curve definition that is native to gelib.