Autodesk.AutoCAD.DatabaseServices.AnnotationScale
This .NET class wraps the AcDbAnnotationScale ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.IsTemporaryScale
Assesses whether the scale is temporarily stored in the drawing.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.Scale
Accesses the annotation scale factor.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.DrawingUnits
Accesses the drawing units portion of the annotation scale.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.PaperUnits
The paper units must be positive and non-zero.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.CollectionName
Accesses the name of the annotation scale collection.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.UniqueIdentifier
Accesses the unique annotation scale identifier.

Autodesk.AutoCAD.DatabaseServices.AnnotationScale.Name
Accesses the name of the annotation scale.