Autodesk.AutoCAD.DatabaseServices.LayerTable
This .NET class wraps the AcDbLayerTable ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LayerTable.GenerateUsageData
Generates usage data for each LayerTableRecord in this layer table.

Autodesk.AutoCAD.DatabaseServices.LayerTable.GetUnreconciledLayers
Retrieves the unreconciled layer.
idArray:  Input ID of the array to retrieve the unreconciled layers

Autodesk.AutoCAD.DatabaseServices.LayerTable.GetEnumerator
Returns an enumerator for this collection.

Autodesk.AutoCAD.DatabaseServices.LayerTable.SkippingReconciled
Accesses the skipped reconciled layers.

Autodesk.AutoCAD.DatabaseServices.LayerTable.IncludingHidden
Accesses the hidden layers.

Autodesk.AutoCAD.DatabaseServices.LayerTable.HasUnreconciledLayers
Assesses if the table has unreconciled layers.