Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout
This wraps the ObjectARX AcDbTextEditorWipeout class.

Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout.BackgroundFillColor
Gets and sets the background fill color.

Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout.BackgroundScaleFactor
Gets and sets the background scale factor.

Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout.UseBackgroundColor
Gets and sets the flag to use the background color.

Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout.BackgroundFillEnabled
Gets and sets the flag to enable the background fill.

Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout.MaxBackgroundScaleFactor
This wraps the ObjectARX AcDbTextEditorWipeout::maxBackgroundScaleFactor() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout.MinBackgroundScaleFactor
This wraps the ObjectARX AcDbTextEditorWipeout::minBackgroundScaleFactor() method.