Autodesk.AutoCAD.DatabaseServices.MText
This .NET class wraps the AcDbMText ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MText.#ctor
The constructor creates a default, empty object.

Autodesk.AutoCAD.DatabaseServices.MText.SetAttachmentMovingLocation(Autodesk.AutoCAD.DatabaseServices.AttachmentPoint)
This member function changes the attachment of the MTEXT object, just as Attachment does, however it also moves the location (as per Location) in order to keep the current extent unchanged.
value:  Input desired AttachmentPoint type value

Autodesk.AutoCAD.DatabaseServices.MText.SetContentsRtf(System.String)
This method sets the contents of the MText object from the RTF-encoded text string pointed to by unnamed.
value:  Input RTF-encoded string

Autodesk.AutoCAD.DatabaseServices.MText.CorrectSpelling
Intended to be used internally, and requires that additional speller initialization be performed before calling.

Autodesk.AutoCAD.DatabaseServices.MText.GetBoundingPoints
Appends 4 points to the collection as follows: [0] == top left corner of text area
[1] == top right corner of text area
[2] == bottom left corner of text area
[3] == bottom right corner of text area
Returns the collection of points (in WCS) defining bounding box of text as displayed on screen.

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback)
This .NET method wraps the AcDbMText.explodeFragments() ObjectARX function by calling the ExplodeFragments(MTextFragmentCallback enumerator, Object userData, WorldDraw context) method with both userData and context set to null.
enumerator:  Input fragment elaboration callback function

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback,System.Object)
This .NET method wraps the AcDbMText.explodeFragments() ObjectARX function by calling the ExplodeFragments(MTextFragmentCallback enumerator, Object userData, WorldDraw context) method with context set to null.
enumerator:  Input fragment elaboration callback function
userData:  Input user data

Autodesk.AutoCAD.DatabaseServices.MText.ExplodeFragments(Autodesk.AutoCAD.DatabaseServices.MTextFragmentCallback,System.Object,Autodesk.AutoCAD.GraphicsInterface.WorldDraw)
This function runs through the MText object's text string breaking it up into fragments, calling the fragment elaboration function enumerator for each fragment.
enumerator:  Input fragment elaboration callback function
userData:  Input user data
context:  Input WorldDraw object

Autodesk.AutoCAD.DatabaseServices.MText.ConvertFieldToText
If the contents of MText contains fields, this function converts them to text and removes the fields.

Autodesk.AutoCAD.DatabaseServices.MText.getMTextWithFieldCodes
This is getMTextWithFieldCodes, a member of class MText.

Autodesk.AutoCAD.DatabaseServices.MText.SetDynamicColumns(System.Double,System.Double,System.Boolean)
Sets column type to DynamicColumns with specified width, gutter, and auto height setting.
width:  Input new column width
gutter:  Input new column gutter
auto_height:  Input new auto-height setting

Autodesk.AutoCAD.DatabaseServices.MText.SetStaticColumns(System.Double,System.Double,System.Int32)
Sets column type to StaticColumns with specified width, gutter, and number of columns.
width:  Input new column width
gutter:  Input new column gutter
count:  Input new auto-height setting

Autodesk.AutoCAD.DatabaseServices.MText.SetColumnHeight(System.Int32,System.Double)
Sets the height of the specified column.
index:  The column's height to set
height:  Column height

Autodesk.AutoCAD.DatabaseServices.MText.GetColumnHeight(System.Int32)
Gets the height of the specified column.
index:  The column's height to get

Autodesk.AutoCAD.DatabaseServices.MText.Height
Accesses the height value of the font.

Autodesk.AutoCAD.DatabaseServices.MText.ColumnFlowReversed
Accesses the flow reversed setting, which determines how columns are added.

Autodesk.AutoCAD.DatabaseServices.MText.ColumnGutterWidth
Accesses the column gutter width.

Autodesk.AutoCAD.DatabaseServices.MText.ColumnWidth
Accesses the width of each column.

Autodesk.AutoCAD.DatabaseServices.MText.ColumnAutoHeight
Accesses the auto height setting, which specifies whether dynamic columns use the MText height or a per-column user-defined height.

Autodesk.AutoCAD.DatabaseServices.MText.ColumnCount
Accesses the number of columns.

Autodesk.AutoCAD.DatabaseServices.MText.ColumnType
Accesses the column type.

Autodesk.AutoCAD.DatabaseServices.MText.LineSpaceDistance
Accesses the spacing between lines of text.

Autodesk.AutoCAD.DatabaseServices.MText.ShowBorders
Gets the flag controlling mtext border's visibility.

Autodesk.AutoCAD.DatabaseServices.MText.UseBackgroundColor
Accesses if background color is in use for this object.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundTransparency
Accesses the background fill transparency.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundScaleFactor
Accesses the background scale factor.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundFillColor
Accesses the current background fill color.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundFill
Assesses whether background fill is on.

Autodesk.AutoCAD.DatabaseServices.MText.LineSpacingFactor
Accesses the line spacing factor (a value between 0.25 and 4.00).

Autodesk.AutoCAD.DatabaseServices.MText.LineSpacingStyle
Accesses the line spacing style, either AtLeast (the line spacing is a minimum value) or Exactly (the line spacing is absolute).

Autodesk.AutoCAD.DatabaseServices.MText.BlockEnd
Accesses the string "}".

Autodesk.AutoCAD.DatabaseServices.MText.BlockBegin
Accesses the string "{".

Autodesk.AutoCAD.DatabaseServices.MText.AlignChange
Accesses the string "A".

Autodesk.AutoCAD.DatabaseServices.MText.StackStart
Accesses the string "S".

Autodesk.AutoCAD.DatabaseServices.MText.ParagraphBreak
Accesses the string "P".

Autodesk.AutoCAD.DatabaseServices.MText.LineBreak
Accesses the string "p".

Autodesk.AutoCAD.DatabaseServices.MText.TrackChange
Accesses the string "T".

Autodesk.AutoCAD.DatabaseServices.MText.ObliqueChange
Accesses the string "Q".

Autodesk.AutoCAD.DatabaseServices.MText.WidthChange
Accesses the string "W", which indicates a width change.

Autodesk.AutoCAD.DatabaseServices.MText.HeightChange
Accesses the string "H".

Autodesk.AutoCAD.DatabaseServices.MText.FontChange
Accesses the string "F".

Autodesk.AutoCAD.DatabaseServices.MText.ColorChange
Accesses the string "C".

Autodesk.AutoCAD.DatabaseServices.MText.StrikethroughOff
Gets the mtext strike-through turning off string.

Autodesk.AutoCAD.DatabaseServices.MText.StrikethroughOn
Gets the mtext strike-through turning on string.

Autodesk.AutoCAD.DatabaseServices.MText.UnderlineOff
Accesses the string "l".

Autodesk.AutoCAD.DatabaseServices.MText.UnderlineOn
Accesses the string "L".

Autodesk.AutoCAD.DatabaseServices.MText.OverlineOff
Accesses the string "o".

Autodesk.AutoCAD.DatabaseServices.MText.OverlineOn
Accesses the string "O".

Autodesk.AutoCAD.DatabaseServices.MText.NonBreakSpace
Accesses the string "~".

Autodesk.AutoCAD.DatabaseServices.MText.ActualWidth
Accesses the overall width of the bounding rectangle that surrounds the formatted text.

Autodesk.AutoCAD.DatabaseServices.MText.ActualHeight
Accesses the overall height of the bounding rectangle that surrounds the formatted text.

Autodesk.AutoCAD.DatabaseServices.MText.Text
Accesses the MText contents with formatting removed.

Autodesk.AutoCAD.DatabaseServices.MText.ContentsRTF
Returns an RTF encoded string that is a translated version of the contents of the AcDbMText object.

Autodesk.AutoCAD.DatabaseServices.MText.Contents
Accesses the character contents of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.FlowDirection
Accesses the direction that the text string follows from its start to its finish.

Autodesk.AutoCAD.DatabaseServices.MText.Attachment
Accesses a value describing the attachment point for the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.TextHeight
Accesses the nominal text height of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.TextStyleName
Accesses the name of the current text style.

Autodesk.AutoCAD.DatabaseServices.MText.TextStyleId
Accesses the objectId of the textStyle currently referenced by the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.Descent
Accesses the height of the maximum descender for the last line of the text.

Autodesk.AutoCAD.DatabaseServices.MText.Ascent
Accesses the height of the maximum ascender for the first line of the text.

Autodesk.AutoCAD.DatabaseServices.MText.Width
Accesses the maximum width setting used by the MText object for word wrap formatting.

Autodesk.AutoCAD.DatabaseServices.MText.Rotation
Accesses the angle between the X axis of the OCS for the normal vector of the current AutoCAD editor's UCS and the projection of the MText object's direction vector onto the plane of the AutoCAD editor's current UCS.

Autodesk.AutoCAD.DatabaseServices.MText.Direction
Accesses a Vector3d (in WCS) representing the X axis ("horizontal") for the text.

Autodesk.AutoCAD.DatabaseServices.MText.Normal
Accesses the unit normal vector of the MText object.

Autodesk.AutoCAD.DatabaseServices.MText.Location
Accesses the insertion point of the MText object.