Autodesk.AutoCAD.Geometry.Torus
This .NET class wraps the AcGeTorus ObjectARX class.

Autodesk.AutoCAD.Geometry.Torus.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Constructor.
majorRadius:  Input major radius
minorRadius:  Input minor radius
origin:  Input center
axisOfSymmetry:  Input axis of rotation
referenceAxis:  Input direction to the zero meridian
startAngleU:  Input start longitude
endAngleU:  Input end longitude
startAngleV:  Input start latitude
endAngleV:  Input end latitude

Autodesk.AutoCAD.Geometry.Torus.#ctor(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a full torus defined by input data.
majorRadius:  Input major radius
minorRadius:  Input minor radius
origin:  Input center
axisOfSymmetry:  Input axis of rotation

Autodesk.AutoCAD.Geometry.Torus.#ctor
Constructs a valid default torus.

Autodesk.AutoCAD.Geometry.Torus.GetAnglesInU
Computes start and end longitudes.

Autodesk.AutoCAD.Geometry.Torus.GetAnglesInV
Computes start and end latitudes.

Autodesk.AutoCAD.Geometry.Torus.SetAnglesInU(System.Double,System.Double)
Changes start and end longitudes to the input data.
startAngle:  Input start longitude
endAngle:  Input end longitude

Autodesk.AutoCAD.Geometry.Torus.SetAnglesInV(System.Double,System.Double)
Changes start and end latitudes to the input data.
startAngle:  Input start latitude
endAngle:  Input end latitude

Autodesk.AutoCAD.Geometry.Torus.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Changes torus definition to the input data.
majorRadius:  Input major radius
minorRadius:  Input minor radius
origin:  Input center
axisOfSymmetry:  Input axis of rotation
refAxis:  Input reference axis
startAngleU:  Input start longitude
endAngleU:  Input end longitude
startAngleV:  Input start latitude
endAngleV:  Input end latitude

Autodesk.AutoCAD.Geometry.Torus.Set(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes torus definition to the input data.
majorRadius:  Input major radius
minorRadius:  Input minor radius
origin:  Input center
axisOfSymmetry:  Input axis of rotation

Autodesk.AutoCAD.Geometry.Torus.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls Torus.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) with tolerance set to Global.
linearEntity:  Input linear entity

Autodesk.AutoCAD.Geometry.Torus.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Computes intersections with a linear entity.
linearEntity:  Input linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Torus.IsHollow
Returns true when the major radius is greater than the minor radius, producing a solid with a hole in the middle.

Autodesk.AutoCAD.Geometry.Torus.IsDegenerate
Returns true when the minor radius is less than or equal to zero or when the major radius is less than or equal to the negative of the minor radius.

Autodesk.AutoCAD.Geometry.Torus.IsDoughnut
Returns true when the major radius is greater than the minor radius, producing a solid with a hole in the middle.

Autodesk.AutoCAD.Geometry.Torus.IsVortex
Returns true when the major radius is equal to the minor radius.

Autodesk.AutoCAD.Geometry.Torus.IsApple
Returns true when the major radius is less than the minor radius but greater than zero, producing a solid with a dimple in the middle.

Autodesk.AutoCAD.Geometry.Torus.IsLemon
Returns true when the major radius is less than zero but the absolute value is not as large as the minor radius.

Autodesk.AutoCAD.Geometry.Torus.IsOuterNormal
Returns a flag indicating if the surface normal is pointing outside the closed torus.

Autodesk.AutoCAD.Geometry.Torus.ReferenceAxis
Returns the direction to the zero meridian.

Autodesk.AutoCAD.Geometry.Torus.AxisOfSymmetry
Return the axis of rotation.

Autodesk.AutoCAD.Geometry.Torus.Center
Returns the center of the torus.

Autodesk.AutoCAD.Geometry.Torus.MinorRadius
Accesses the minor radius of the torus.

Autodesk.AutoCAD.Geometry.Torus.MajorRadius
Accesses the major radius of the torus.