Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator
This class enumerates the contents of MlineStyleElementCollection objects.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.#ctor(Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollection)
Constructs a new enumeration based on an existing collection.
col:  Input collection to generate from

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.MoveNext
This method moves the collection pointer to the next object, or to the end of the collection if it is currently positioned at the final collection object.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.Reset
This method moves the collection pointer to the beginning of the collection.

Autodesk.AutoCAD.DatabaseServices.MlineStyleElementCollectionEnumerator.Current
Accesses the current enumeration.