Autodesk.AutoCAD.DatabaseServices.PlotStyleTableChangedEventArgs
This class provides data for PlotStyleTableChanged event of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.PlotStyleTableChangedEventArgs.NewName
Accesses the name of the plot style table that is newly associated with the layout denoted by Id.

Autodesk.AutoCAD.DatabaseServices.PlotStyleTableChangedEventArgs.Id
Accesses the object ID of the layout that is changing.