Autodesk.AutoCAD.DatabaseServices.ConstrainedArc
This class represents a constrained arc node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedArc.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained arc is holding on.

Autodesk.AutoCAD.DatabaseServices.ConstrainedArc.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedArc.MidPoint
Gets the mid point of the constrained arc, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedArc.EndPoint
Gets the end point of the constrained arc, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedArc.StartPoint
Gets the start point of the constrained arc, relative to the work plane of the owning Assoc2dConstraintGroup object.