Autodesk.AutoCAD.DatabaseServices.ParallelConstraint
This class represents a Parallel constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ParallelConstraint.#ctor
Default constructor.