Autodesk.AutoCAD.DatabaseServices.UnitsConverter
This class implements the System.ComponentModel.TypeConverter interface.

Autodesk.AutoCAD.DatabaseServices.UnitsConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Returns true if the object can be converted within the context.
context:  Input context to convert with
sourceType:  Input source type

Autodesk.AutoCAD.DatabaseServices.UnitsConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
This method is used to convert a string to a Units value.
context:  Input context to convert within
culture:  Input culture to convert within
value:  Input object to convert from

Autodesk.AutoCAD.DatabaseServices.UnitsConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Returns the result of converting value to destinationType in the specified culture and context.
context:  Input System.ComponentModel.ITypeDescriptorContext object.
culture:  Input System.Globalization.CultureInfo object.
value:  Input.
destinationType:  Input.

Autodesk.AutoCAD.DatabaseServices.UnitsConverter.GetConversionFactor(Autodesk.AutoCAD.DatabaseServices.UnitsValue,Autodesk.AutoCAD.DatabaseServices.UnitsValue)
Computes the conversion factor between the block's units and the current drawing's units.
from:  Input Autodesk.AutoCAD.DatabaseServices.UnitsValue object to be converted.
to:  Input Autodesk.AutoCAD.DatabaseServices.UnitsValue object converted to