Autodesk.AutoCAD.GraphicsInterface.SkyParameters
This .NET class wraps the AcGiSkyParameters ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.op_Equality(Autodesk.AutoCAD.GraphicsInterface.SkyParameters,Autodesk.AutoCAD.GraphicsInterface.SkyParameters)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.SkyParameters,Autodesk.AutoCAD.GraphicsInterface.SkyParameters)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.Saturation
The the sky's saturation level.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.RedBlueShift
Returns the red-blue shift on the sky.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.SunDirection
Returns the directional vector of the sun's light rays.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.NightColor
Returns the color of the night sky.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.GroundColor
Returns the color of the ground plane.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.SolarDiskSamples
Returns the number of samples to take on the solar disk.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.DiskIntensity
Returns the intensity of the sun disk.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.GlowIntensity
Returns the intensity of the sun glow.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.DiskScale
Returns the scale of the sun disk (1.0 = correct size).

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.VisibilityDistance
Returns the distance at which 10% haze occlusion results.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.HorizonBlur
Returns the amount of blurring between ground plane and sky.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.HorizonHeight
Returns the world-space height of the horizon plane.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.Haze
Returns the turbidity or atmosphere value.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.IntensityFactor
Returns the intensity factor which determines the level of non-physical modulation of skylight.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.AerialPerspective
Returns true if aerial perspective is applied.

Autodesk.AutoCAD.GraphicsInterface.SkyParameters.Illumination
Returns true if skylight illumination is computed.