Autodesk.AutoCAD.DatabaseServices.AssocArray
AssocArray wraps the ObjectARX class AcDbAssocArrayActionBody.

Autodesk.AutoCAD.DatabaseServices.AssocArray.CreateArray(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.VertexRef,Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters)
This method wraps AcDbAssocArrayActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.IsAssociativeArray(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method wraps the ObjectARX AcDbAssocArrayActionBody::isAssociativeArray() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.GetAssociativeArray(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method returns the AssocArray object with the given entity.

Autodesk.AutoCAD.DatabaseServices.AssocArray.GetParameters
Returns the parameter object owned by this AssocArray object.

Autodesk.AutoCAD.DatabaseServices.AssocArray.AddSourceEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Point3d)
This method wraps the ObjectARX AcDbAssocArrayActionBody::addSourceEntity() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.RemoveSourceEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method wraps the ObjectARX AcDbAssocArrayActionBody::removeSourceEntity() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.TransformItemBy(Autodesk.AutoCAD.DatabaseServices.ItemLocator,Autodesk.AutoCAD.Geometry.Matrix3d)
This method wraps the ObjectARX AcDbAssocArrayActionBody::transformItemBy() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.GetItemTransform(Autodesk.AutoCAD.DatabaseServices.ItemLocator)
This method wraps the ObjectARX AcDbAssocArrayActionBody::getTransform() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.DeleteItem(Autodesk.AutoCAD.DatabaseServices.ItemLocator,System.Boolean)
This method wraps the ObjectARX AcDbAssocArrayActionBody::deleteItem() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.ReplaceItems(Autodesk.AutoCAD.DatabaseServices.ItemLocator[],Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.VertexRef)
Replaces items, identified by their indices in the form of ItemLocator, with given substEntities and basePoint.

Autodesk.AutoCAD.DatabaseServices.AssocArray.ResetItems
Removes the item override, such as position, orientation or object replacement, from all items of this associative array.

Autodesk.AutoCAD.DatabaseServices.AssocArray.getItemLocators(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Obtains a list of ItemLocator for given list of subents of an associative array.

Autodesk.AutoCAD.DatabaseServices.AssocArray.Explode(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method wraps the AcDbAssocArrayActionBody::explode() method.

Autodesk.AutoCAD.DatabaseServices.AssocArray.SourceEntities
Gets the array of IDs of the source entities that form an item in the associative array.

Autodesk.AutoCAD.DatabaseServices.AssocArray.EntityId
Gets the associative array ID.