Autodesk.AutoCAD.DatabaseServices.G2SmoothConstraint
This class represents a G2Smooth composite constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.G2SmoothConstraint.#ctor
Default constructor.