Autodesk.AutoCAD.DatabaseServices.XrefObjectId
This .NET class wraps the AcDbXrefObjectId ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Handle)
Constructor.
XrefBlockTableRecordId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId  object.
hand:  Input Autodesk.AutoCAD.DatabaseServices.Handle object.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
LocalId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId  object.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.op_Inequality(Autodesk.AutoCAD.DatabaseServices.XrefObjectId,Autodesk.AutoCAD.DatabaseServices.XrefObjectId)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.op_Equality(Autodesk.AutoCAD.DatabaseServices.XrefObjectId,Autodesk.AutoCAD.DatabaseServices.XrefObjectId)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input System.Object object.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.ResolveObjectId
Returns the ID of the object within the xref.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Serialize
Serializes or files out DBObject.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Deserialize(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer&)
Turns the sequence of data between rbStart and rbEnd back into this object.
rbStart:  Input Autodesk.AutoCAD.DatabaseServices.ResultBuffer object.
rbEnd:  Input Autodesk.AutoCAD.DatabaseServices.ResultBuffer object.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Handle
Handle of the object within the Xref data.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.ObjectId
Object ID of the object local to the host database.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsNull
Returns true if this object does not refer to any other object.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsXref
.

Autodesk.AutoCAD.DatabaseServices.XrefObjectId.IsValid
This returns true if the xref is loaded and the handle is valid within that xref.