Autodesk.AutoCAD.DatabaseServices.DBVisualStyle
This is a .NET wrapper for the AcDbVisualStyle ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.CopyTo(Autodesk.AutoCAD.GraphicsInterface.VisualStyle)
Copies the settings to another object.
pDest:  Input visual style destination.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.CopyFrom(Autodesk.AutoCAD.GraphicsInterface.VisualStyle)
Copies the settings from another object.
pSrc:  Input visual style source

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a color property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty being set. Valid Property values for this method are:FaceMonoColorEdgeIntersectionColorEdgeObscuredColorEdgeColorEdgeSilhouetteColor
pColor:  Input AcCmColor property value.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Double,System.Double,System.Double,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a color property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceMonoColorEdgeIntersectionColorEdgeObscuredColorEdgeColorEdgeSilhouetteColor
red:  Input red color value to set. Valid value is from 0.0 to 1.0.
green:  Input green color value to set. Valid value is from 0.0 to 1.0.
blue:  Input blue color value to set. Valid value is from 0.0 to 1.0.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Double,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a double property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceOpacityFaceSpecularEdgeCreaseAngleEdgeOpacityDisplayBrightness
dVal:  Input double property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a boolean property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:EdgeHidePrecision
bVal:  Input boolean property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Int32,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets an integer property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceLightingModelFaceLightingQualityFaceColorModeFaceModifierEdgeModelEdgeStyleEdgeObscuredLinePatternEdgeIntersectionLinePatternEdgeModifierEdgeWidthEdgeOverhangEdgeJitterAmountEdgeSilhouetteWidthEdgeHaloGapEdgeIsolinesDisplayStyleDisplayShadowType
nVal:  Input integer property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Object,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set.
val:  Input Autodesk.AutoCAD.GraphicsInterface.Variant property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.GetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty)
Gets a property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty being queried.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.InternalUseOnly
Assesses if the visual style is for internal use.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.Type
Assesses the visual style type.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.Description
Accesses the description of the visual style.

Autodesk.AutoCAD.DatabaseServices.DBVisualStyle.Name
Accesses the name of the visual style.