Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
This class represents a node owned by Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode.OwningConstraintGroupId
Gets the ObjectId of its owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode.NodeId
Gets the node id of the ConstraintGroupNode.