Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32
This .NET struct wraps the AcGiPixelBGRA32 ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.#ctor(System.Byte,System.Byte,System.Byte,System.Byte)
Constructor.
blue:  Input color blue component
green:  Input color green component
red:  Input color red component
alpha:  Input color alpha-shading component

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.#ctor(System.UInt32)
Constructor.
bgra:  Input color of component

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.init
Initializes the object by resetting all values to 0.

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.Alpha
Accesses the color value's alpha-shading component.

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.Blue
Accesses the color value's blue component.

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.Green
Accesses the color value's green component.

Autodesk.AutoCAD.GraphicsInterface.PixelBGRA32.Red
Accesses the color value's red component.