Autodesk.AutoCAD.GraphicsInterface.LightTraits
This .NET class wraps the AcGiLightTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.LightTraits.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.LightTraits.On
Returns true if the light is on.