Autodesk.AutoCAD.DatabaseServices.DatabaseIOEventArgs
This class provides data for the DwgFileOpened, BeginSave and SaveComplete events of the database.

Autodesk.AutoCAD.DatabaseServices.DatabaseIOEventArgs.FileName
Accesses the name of the drawing file being operated on.