Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits
This .NET class wraps the AcGiSubEntityTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.SetSelectionMarker(System.IntPtr)
Sets the SubEntityTraits object to use markerId as the graphics marker for all graphics primitives drawn until the next call to this function, or the end of the WorldDraw() or ViewportDraw() execution.
markerId:  Input non-zero integer to use as graphics system marker

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Fill
This is Fill, a member of class SubEntityTraits.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineType
Returns the objectId of the linetypeTableRecord that is currently set in the SubEntityTraits object to be used to when drawing graphics primitives.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Layer
Returns the objectId of the layerTableRecord that is currently set in the SubEntityTraits object to be used to draw graphics primitives on.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Transparency
This .NET property wraps the ObjectARX methods AcGiSubEntityTraits.setTransparency and AcGiSubEntityTraits.transparency.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.TrueColor
Returns color through EntityColor class.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Color
Returns the AutoCAD color index value currently set within the SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.SelectionOnlyGeometry
Returns if the following geometry is only intended for selection.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.ShadowFlags
Returns the current shadow flags value, as specified by the last valid call to SetShadowFlags().The default is ShadowsCastAndReceive.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.DrawFlags
Returns the current draw flags value.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.VisualStyle
Returns the object ID of the visual style in the subentity traits.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Sectionable
Returns true if the graphics primitives drawn with this object will participate in sectioning.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Mapper
Returns a pointer to the active mapper definition.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Material
Returns the database ID of the current material assignment.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.PlotStyleDescriptor
Returns PlotStyleDescriptor property value.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.Thickness
Thickness is an extrusion in WCS units along the positive Z axis.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineTypeScale
The scaling factor of linetype can be varied by this trait.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.LineWeight
Returns the lineweight as defined by the enum LineWeight.

Autodesk.AutoCAD.GraphicsInterface.SubEntityTraits.FillType
Returns the FillType currently set in the SubEntityTraits object.