Autodesk.AutoCAD.DatabaseServices.AlignedDimension
This .NET class wraps the AcDbAlignedDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.Oblique
Accesses the extension line obliquing angle (in radians) for the dimension.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.DimLinePoint
Accesses the definition point (in WCS coordinates) that specifies where the dimension line will be.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.XLine2Point
Accesses the definition point (in WCS coordinates) that is used as the start point for the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.AlignedDimension.XLine1Point
Accesses the definition point (in WCS coordinates) that is used as the start point for the first extension line of the dimension.