Autodesk.AutoCAD.Geometry.Scale2d
This .NET class wraps AcGeScale2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Scale2d.#ctor(System.Double[])
Constructs a scale from the first two parameters of an array.
xy:  Input array

Autodesk.AutoCAD.Geometry.Scale2d.#ctor(System.Double,System.Double)
Constructs scale transformation with scale factors.

Autodesk.AutoCAD.Geometry.Scale2d.#ctor(System.Double)
Constructs the uniform scale transformation with scale factor factor.
factor:  Input uniform scale factor

Autodesk.AutoCAD.Geometry.Scale2d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Scale2d)
Sets this scale vector to the product of itself and the scale vector leftSide.
leftSide:  Input scale vector

Autodesk.AutoCAD.Geometry.Scale2d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Scale2d)
Sets this scale vector to the product of itself and the scale vector rightSide.
rightSide:  Input scale vector

Autodesk.AutoCAD.Geometry.Scale2d.MultiplyBy(System.Double)
Returns the scale vector that is the product of the input scale vector and input scale factor.
factor:  Input scale factor

Autodesk.AutoCAD.Geometry.Scale2d.Inverse
Returns the scale vector with the inverse scale factors.

Autodesk.AutoCAD.Geometry.Scale2d.IsProportional
This method calls Scale2d.IsProportional(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Scale2d.IsProportional(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the matrix of scaling corresponding to this scale vector isUniScaledOrtho().
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Scale2d.GetMatrix
Returns in the output parameter mat the matrix that corresponds to the same scaling transformations as the one determined by this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.ExtractScale(Autodesk.AutoCAD.Geometry.Matrix2d)
The function returns scale vector with scale factors equal to the lengths of the vectors forming the columns of the matrix mat.
mat:  Input matrix

Autodesk.AutoCAD.Geometry.Scale2d.RemoveScale(Autodesk.AutoCAD.Geometry.Matrix2d)
For each index i is less than 2, this function sets the i-th scale factor of this scale vector to the length of the i-th column of the matrix mat considered as vector.
mat:  Input matrix

Autodesk.AutoCAD.Geometry.Scale2d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Scale2d.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.Geometry.Scale2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Scale2d)
This method calls Scale2d.IsEqualTo(Scale2d a, Tolerance tolerance) with tolerance set to Global.
a:  Input scale vector to test equality for

Autodesk.AutoCAD.Geometry.Scale2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the matrix of scaling corresponding to this scale vector is equal to the matrix scaling corresponding to the scale vector a.
a:  Input scale vector to test equality for
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Scale2d.op_Inequality(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Scale2d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Scale2d.op_Equality(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Scale2d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Scale2d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Scale2d)
Multiplies factor and a.
factor:  Left operand
a:  Right operand

Autodesk.AutoCAD.Geometry.Scale2d.op_Multiply(Autodesk.AutoCAD.Geometry.Scale2d,System.Double)
Multiplies a and factor.
a:  Left operand
factor:  Right operand

Autodesk.AutoCAD.Geometry.Scale2d.op_Multiply(Autodesk.AutoCAD.Geometry.Scale2d,Autodesk.AutoCAD.Geometry.Scale2d)
Multiplies a and b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Scale2d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format.
format:  Input format to display
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.Geometry.Scale2d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Scale2d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Scale2d.ToArray
This method returns an array containing the coordinates of this scale vector.

Autodesk.AutoCAD.Geometry.Scale2d.Y
Returns the Y direction scale.

Autodesk.AutoCAD.Geometry.Scale2d.X
Returns the X direction scale.