Autodesk.AutoCAD.DatabaseServices.AssocValueDependency
A concrete dependency class that represents a dependency on a scalar value, such as on a numerical variable.

Autodesk.AutoCAD.DatabaseServices.AssocValueDependency.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocValueDependency.DependentOnObjectValue
Gets and sets the value in the dependent-on object and updates the cached value; queries the dependent-on object and returns its value.

Autodesk.AutoCAD.DatabaseServices.AssocValueDependency.ValueName
Gets and sets the name of the referenced value or an empty string if the value name is not needed because the referenced object exposes only a single value (it is a common case, such as for AssocVariable objects).