Autodesk.AutoCAD.DatabaseServices.TableEnumerator
This .NET class wraps the AcDbTableIterator ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.TableEnumerator.MoveNext
Returns true if the target moves to next row, column or cell.

Autodesk.AutoCAD.DatabaseServices.TableEnumerator.Reset
Resets the current target row, column or cell.

Autodesk.AutoCAD.DatabaseServices.TableEnumerator.Current
Input cell at which to  position the iterator.