Autodesk.AutoCAD.DatabaseServices.AttributeDefinition
This .NET class wraps the AcDbAttributeDefinition ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.UpdateMTextAttributeDefinition
Updates the internal MText entity from the basic AttributeDefinition properties.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.MTextAttributeDefinition
Accesses the internal MText entity, to replace or modify it.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.IsMTextAttributeDefinition
Tells whether the attribute definition is a multi-line attribute definition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.LockPositionInBlock
Accesses the lock position property of the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.FieldLength
Accesses the attribute’s field length value.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Preset
Accesses the preset flag of the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Verifiable
Accesses the verifiable flag of the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Constant
Accesses the constant flag of the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Invisible
Accesses the visibility flag of the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Tag
Accesses the tag string, which is the identifier you see on screen to represent the AttributeDefinition.

Autodesk.AutoCAD.DatabaseServices.AttributeDefinition.Prompt
Accesses the prompt string for the AttributeDefinition.