Autodesk.AutoCAD.DatabaseServices.AttributeCollection
This collection class provides a container for block reference attributes.

Autodesk.AutoCAD.DatabaseServices.AttributeCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.ObjectId[],System.Int32)
Copies the objects in the element to the array.
array:  Input the array to copy to.
index:  Input the index position to start adding at.

Autodesk.AutoCAD.DatabaseServices.AttributeCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.AttributeCollection.Count
Accesses the number of items in the collection.