Autodesk.AutoCAD.GraphicsInterface.Mapper
This .NET class wraps the AcGiMapper ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.Mapper.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.Mapper.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.Mapper.VTiling
Deprecated.

Autodesk.AutoCAD.GraphicsInterface.Mapper.UTiling
Deprecated.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Transform
Returns the transform of the mapper.

Autodesk.AutoCAD.GraphicsInterface.Mapper.AutoTransform
Returns the automatic transform mode of the mapper; one of the AutoTransform enumerators.

Autodesk.AutoCAD.GraphicsInterface.Mapper.Projection
Returns the mapping projection; one of the values from the Projection enumeration.