Autodesk.AutoCAD.Geometry.EllipticalArc3d
This .NET class wraps the AcGeEllipArc3d ObjectARX class.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Constructs an ellipse with the specified center, major and minor axes, major and minor radii, and start and end angles.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius
startAngle:  Input angle of ellipse start point
endAngle:  Input angle of ellipse end point

Autodesk.AutoCAD.Geometry.EllipticalArc3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Constructs a full ellipse with the specified center, major and minor axes, and major and minor radii.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius

Autodesk.AutoCAD.Geometry.EllipticalArc3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls EllipticalArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input plane

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ClosestPointToPlane(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this ellipse that is closest to the given plane.
plane:  Input plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity)
This method calls EllipticalArc3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input any plane

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input plane intersects the ellipse.
plane:  Input any plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d)
This method calls EllipticalArc3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the input line intersects the ellipse.
line:  Input any 3D linear entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls EllipticalArc3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) with tolerance set to Global.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.EllipticalArc3d.ProjectedIntersectWith(Autodesk.AutoCAD.Geometry.LinearEntity3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the ellipse and line that projects to the same point when projected onto a plane whose normal is projectionDirection.
line:  Input any 3D linear entity
projectionDirection:  Input direction of projection
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.GetPlane
Returns the infinite plane in which the ellipse lies.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsCircular
This method calls EllipticalArc3d.IsCircular(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsCircular(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if ellipse is a circular arc.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d)
This method calls EllipticalArc3d.IsInside(Point3d pointValue, Tolerance tolerance) with tolerance set to Global.
pointValue:  Input any 3D point

Autodesk.AutoCAD.Geometry.EllipticalArc3d.IsInside(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines whether the input point lies inside the ellipse.
pointValue:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.EllipticalArc3d.SetAxes(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the major and minor axes of the ellipse.
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis

Autodesk.AutoCAD.Geometry.EllipticalArc3d.SetAngles(System.Double,System.Double)
Changes the start point and endpoint of the ellipse by resetting the angles of the start point and endpoint.
startAngle:  Input angle of ellipse start point
endAngle:  Input angle of ellipse end point

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Changes the definition of the ellipse to have the specified center, major and minor axes, major and minor radii, and start and end angles.
center:  Input ; ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius
startAngle:  Input angle of ellipse start point
endAngle:  Input angle of ellipse end point

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double)
Changes the definition of the ellipse to be a full ellipse with the specified center, major and minor axes, and major and minor radii.
center:  Input ellipse center
majorAxis:  Input ellipse major axis
minorAxis:  Input ellipse minor axis
majorRadius:  Input ellipse major radius
minorRadius:  Input ellipse minor radius

Autodesk.AutoCAD.Geometry.EllipticalArc3d.EndPoint
Returns the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.StartPoint
Returns the start point of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.EndAngle
Returns the angle of the endpoint of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.StartAngle
Returns the angle of the ellipse start point.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MajorRadius
Accesses the major radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MinorRadius
Accesses the minor radius of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MajorAxis
Returns the major axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.MinorAxis
Returns the minor axis vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Normal
Returns the normal vector of the ellipse.

Autodesk.AutoCAD.Geometry.EllipticalArc3d.Center
Returns the center point of the ellipse.