Autodesk.AutoCAD.DatabaseServices.Extents2d
This class encapsulates values of simple 2D extents used in layouts and plot settings.

Autodesk.AutoCAD.DatabaseServices.Extents2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
This constructor creates a new 2D Extents using Point 2D values.
minimum:  Input minimum extent
maximum:  Input maximum extent

Autodesk.AutoCAD.DatabaseServices.Extents2d.#ctor(System.Double,System.Double,System.Double,System.Double)
This constructor creates a new 2D Extents using Double values.
minX:  Minimum X extent
minY:  Minimum Y extent
maxX:  Maximum X extent
maxY:  Maximum Y extent

Autodesk.AutoCAD.DatabaseServices.Extents2d.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to compare

Autodesk.AutoCAD.DatabaseServices.Extents2d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents2d)
This method compares this Extents2d object to a by calling the IsEqualTol(Extents2d a, Tolerance tolerance) overloaded method with tolerance set to Global.
a:  Object to compare

Autodesk.AutoCAD.DatabaseServices.Extents2d.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.Geometry.Tolerance)
This method compares this Extents2d object with a by testing the equivalency of their definition points.
a:  Input object to compare
tolerance:  Input tolerance to be used

Autodesk.AutoCAD.DatabaseServices.Extents2d.op_Inequality(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.DatabaseServices.Extents2d)
Returns true if a is not equivalent to b.
a:  Left-hand operand
b:  Right-hand operand

Autodesk.AutoCAD.DatabaseServices.Extents2d.op_Equality(Autodesk.AutoCAD.DatabaseServices.Extents2d,Autodesk.AutoCAD.DatabaseServices.Extents2d)
Returns true if a is equivalent to b.
a:  Left-hand operand
b:  Right-hand operand

Autodesk.AutoCAD.DatabaseServices.Extents2d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format.
format:  Input format to display
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Extents2d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.Extents2d.MaxPoint
Accesses the maximum point.

Autodesk.AutoCAD.DatabaseServices.Extents2d.MinPoint
Accesses the minimum point.