Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d
This .NET class wraps the AcDb3dPolylineVertex ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs an PolylineVertex3d that uses position as the position point.
param0:  Input WCS position point for the vertex

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.Position
Accesses the WCS point value of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d.VertexType
Accesses the the Vertex3dType of this vertex.