Autodesk.AutoCAD.DatabaseServices.ObjectEventArgs
This class provides data for various object-related events of the database.

Autodesk.AutoCAD.DatabaseServices.ObjectEventArgs.DBObject
Accesses the object that is changed.