Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine
This class represents a constrained bounded line node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained line is holding on.
ray:  Input Boolean indicating whether this bounded line is a ray.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine.MidPoint
Gets the mid point of the bounded line, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine.EndPoint
Gets the end point of the bounded line, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine.StartPoint
Gets the start point of the bounded line, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedLine.IsRay
Indicates whether this bounded line is a ray - a partially bounded line.