Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::AcDbAssocExtendSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody.GetDistance(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::distance() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody.SetDistance(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::setDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.EdgeRef[],System.Double,Autodesk.AutoCAD.DatabaseServices.Surface.EdgeExtensionType,System.Boolean)
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody.Distance
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::distance() and AcDbAssocExtendSurfaceActionBody::setDistance() methods.