Autodesk.AutoCAD.DatabaseServices.ViewRepBlockReference
The ViewRepBlockReference class represents the AcDbViewRepBlockReference entity used by model documentation views in association with a Viewport entity.

Autodesk.AutoCAD.DatabaseServices.ViewRepBlockReference.#ctor
This is ViewRepBlockReference, a member of class ViewRepBlockReference.

Autodesk.AutoCAD.DatabaseServices.ViewRepBlockReference.OwnerViewportId
This property returns the ObjectID of the associated model documentation view's Viewport entity.