Autodesk.AutoCAD.Geometry.LineSegment2d
This .NET class wraps the AcGeLineSeg2d ObjectARX class.

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a line segment whose start point is point and whose endpoint is point+vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a line segment between point1 and point2.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.LineSegment2d.GetBisector
Sets the input line to the unbounded line that is perpendicular to the line segment and passes through its midpoint.

Autodesk.AutoCAD.Geometry.LineSegment2d.BaryComb(System.Double)
Returns the point that is the weighted average of the start point and endpoint of the line segment.
blendCoefficient:  Input any real number

Autodesk.AutoCAD.Geometry.LineSegment2d.GetSegmentLength(System.Double,System.Double)
This method calls LineSegment2d.GetSegmentLength(Double fromParameter, Double toParameter, Tolerance tolerance) with tolerance set to Global.
fromParameter:  Input start point parameter
toParameter:  Input end point parameter

Autodesk.AutoCAD.Geometry.LineSegment2d.GetSegmentLength(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the segment length based on the staring and ending point parameter.
fromParameter:  Input start point parameter
toParameter:  Input end point parameter
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Changes the definition of the line segment so that the line segment passes through the input point and is tangent to the input curve.
curve:  Input any 2D curve
point:  Input any 2D point
parameter:  Input point on curve where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Curve2d,Autodesk.AutoCAD.Geometry.Curve2d,System.Double,System.Double)
Changes the definition of the line segment so that the line segment is tangent to the two input curves.
curve1:  Input any 2D curve
curve2:  Input any 2D curve
parameter1:  Input point on curve1 where line segment is tangent to curve
parameter2:  Input point on curve2 where line segment is tangent to curve

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Changes the definition of the line segment so that the start point is point1 and the endpoint is point2.
point1:  Input start point of line segment
point2:  Input end point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d)
Changes the definition of the line segment so that the start point is point and the endpoint is point+vector.
point:  Input start point of line segment
vector:  Input vector between endpoint and start point of line segment

Autodesk.AutoCAD.Geometry.LineSegment2d.Length
Returns the length of the line segment (the distance between the start point and endpoint).

Autodesk.AutoCAD.Geometry.LineSegment2d.EndPoint
Returns the endpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.MidPoint
Returns the midpoint of the line segment.

Autodesk.AutoCAD.Geometry.LineSegment2d.StartPoint
Returns the start point of the line segment.