Autodesk.AutoCAD.DatabaseServices.Entity
This .NET class wraps the AcDbEntity ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Entity.SetLayerId(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This method sets entity to reference the LayerTableRecord identified by the name specified in newValue. For an BlockReference entity, this method will also update any associated SequenceEnd subentity. Note
The only built-in entities for which kTrue has an effect are: 2dPolyline, 3dPolyline, PolyFaceMesh, and PolygonMesh.
The database containing the entity is searched for the LayerTableRecord object with the name pointed to by newValue. If the entity is not currently in a database, then the database currently in the AutoCAD editor is searched.
Specifying true for allowHidden allows newValue to denote a hidden layer. If this parameter is false (default) and newValue denotes a hidden layer the change request is silently ignored.
newValue:  Input name of the LayerTableRecord to be referenced by the entity
allowHidden:  Input Boolean indicating whether to allow newValue to specify a hidden layer

Autodesk.AutoCAD.DatabaseServices.Entity.SetPropertiesFrom(Autodesk.AutoCAD.DatabaseServices.Entity)
This method copies the ColorLayerLinetypeLinetype scaleVisibility
values from the entity pointed to by entityPointer into this entity.
entityPointer:  Input entity from which to copy the properties

Autodesk.AutoCAD.DatabaseServices.Entity.GetPlane
Returns the plane which contains the curve.

Autodesk.AutoCAD.DatabaseServices.Entity.AddSubentityPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Adds one or more subentities to an entity.
subPaths:  Input an array of FullSubentityPath identifiers to add to the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.DeleteSubentityPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Deletes one or more subentities from an entity.
subPaths:  Input an array of FullSubentityPath identifiers to delete from the entity

Autodesk.AutoCAD.DatabaseServices.Entity.TransformSubentityPathsBy(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.Geometry.Matrix3d)
Applies a geometric transformation to one or more subentities on an object.
subPaths:  Input an array of one or more FullSubentityPath objects identifying the subentities to transform
transform:  Input the WCS transformation to apply to each of the supplied subentities.

Autodesk.AutoCAD.DatabaseServices.Entity.GetGripPointsAtSubentityPath(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.GripDataCollection,System.Double,System.Int32,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.GetGripPointsFlags)
This .NET method wraps the ObjectARX method AcDbEntity::getGripPointsAtSubentPath.

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentityGeometricExtents(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Retrieves the geometric extents for a subentity.
subPath:  Input the path to the subentity

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(Autodesk.AutoCAD.DatabaseServices.SubentityType,System.IntPtr,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.DatabaseServices.ObjectId[])
This is GetSubentityPathsAtGraphicsMarker, a member of class Entity.

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(Autodesk.AutoCAD.DatabaseServices.SubentityType,System.Int64,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Obsolete - Use the GetSubentityPathsAtGraphicsMarker method that accepts an IntPtr value.

Autodesk.AutoCAD.DatabaseServices.Entity.GetGraphicsMarkersAtSubentityPathIntPtr(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Entities use various graphic primitives to draw themselves.
subPath:  Input FullSubentityPath object that contains an SubentId property with the information necessary to determine the subentity (or subentities) for which the GS Marker(s) is requested.

Autodesk.AutoCAD.DatabaseServices.Entity.Highlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
Function usage
This function uses the FullSubentityPath ID to determine which subentity in the entity is desired. It then highlights that subentity on screen. If no FullSubentityPath argument is provided, then the entire entity will be highlighted.
Typically, the FullSubentityPath object passed in via subId is obtained from the entity's Entity.GetSubentPathsAtGraphicsMarker() method. This guarantees that it is fully and properly filled in.
This function uses the entity's GetGraphicsMarkersAtSubentPath() method to get the GS markers associated with subId.
It is not necessary to balance each Highlight() function call with a corresponding call to Unhighlight(). Calling the Unhighlight() function will unhighlight the entity designated by subId regardless of how many times the highlight function has been called on it.
Warning
If the entity on which this method is called has its graphics queued for regeneration (that is, changes have been made to the entity but have not yet been reflected on screen), then this method will not cause a highlight to occur. Also, calling this method on an entity that's open for write and whose graphics are queued for regeneration may terminate AutoCAD.
To avoid this limitation, before calling highlight(), you should flush the entity's graphics by either calling the entity's draw() method, or calling the TransactionManager.FlushGraphics() function.
Function implementation in derived classes
The Entity.Highlight() implementation does all the work necessary to highlight any subentities that correspond to the subId. So, there is no need to override this method unless you wish to do some pre-or post-processing, or you wish to disable the ability to highlight subentities.
If this method is overridden and it is supposed to highlight subentities, then the Entity.Highlight() method will need to be invoked at some point within this function in order to do the actual highlighting.
Within the Entity.Highlight() method, the GetGraphicsMarkersAtSubentPath() method of this entity is called to translate the FullSubentityPath into the corresponding GS markers. So, if this function is to succeed, the GetGraphicsMarkersAtSubentPath() method needs to be implemented as well.
For more information on the subId argument, see the documentation on the GetGraphicsMarkersAtSubentPath() or GetSubentPathsAtGraphicsMarker() methods.
subId:  Input FullSubentityPath that identifies the subentity to highlight
highlightAll:  Input Boolean indicating whether to highlight in all viewports

Autodesk.AutoCAD.DatabaseServices.Entity.Highlight
Function usage
This function highlights the entire entity on the screen.

Autodesk.AutoCAD.DatabaseServices.Entity.Unhighlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
Function usage
This function uses the FullSubentityPath id to determine which subentity in the entity is desired. It then unhighlights that subentity on screen. If no FullSubentityPathargument is provided, then the entire entity will be unhighlighted.
Typically the FullSubentityPath object passed in via subId will be obtained from the entity's Entity.GetSubentPathsAtGraphicsMarker() method. This guarantees that it is fully and properly filled in.
This function uses the entity's GetGsMarkersAtSubentPath() method to get the GS markers associated with subId.
It is not necessary to balance each Highlight() function call with a corresponding call to Unhighlight(). Calling the Unhighlight() function will unhighlight the entity designated by subId regardless of how many times the highlight function has been called on it.
Function implementation in derived classes
The Entity.Unhighlight() implementation does all the work necessary to unhighlight any subentities that correspond to the subIdFullSubentPath. So, there is no need to override this method unless you wish to do some pre-or post processing, or you wish to disable the ability to unhighlight subentities.
If this method is overridden and it is supposed to unhighlight subentities, then the DBEntity.Unhighlight() method needs to be invoked at some point within this function in order to do the actual unhighlighting.
Within the Entity.Unhighlight() method, the GetGraphicsMarkersAtSubentPath() method of this entity is called to translate the FullSubentityPath into the corresponding GS markers. So, if this function is to succeed, the GetGraphicsMarkersAtSubentPath() method needs to be implemented as well.
For more information on the subId argument, see the documentation on the Entity.GetGraphicsMarkersAtSubentPath() or Entity.GetSubentPathsAtGraphicsMarker() methods.
subId:  Input FullSubentityPath that identifies which subentity to unhighlight
highlightAll:  Input Boolean indicating whether to unhighlight in all viewports

Autodesk.AutoCAD.DatabaseServices.Entity.Unhighlight
Function usage
This unhighlights the entire entity on screen.

Autodesk.AutoCAD.DatabaseServices.Entity.PushHighlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.GraphicsInterface.HighlightStyle)
This wraps the ObjectARX AcDbEntity::pushHighlight() method.
subId:  Input AcDbFullSubentPath that identifies the subentity to highlight
highlightStyle:  Input AcGiHighlightStyle for this subid

Autodesk.AutoCAD.DatabaseServices.Entity.PopHighlight(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This wraps the ObjectARX AcDbEntity::popHighlight() method.
subId:  Input AcDbFullSubentPath that identifies the subentity to unhighlight

Autodesk.AutoCAD.DatabaseServices.Entity.HighlightState(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This wraps the ObjectARX AcDbEntity::highlightState() method.

Autodesk.AutoCAD.DatabaseServices.Entity.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Matrix3d)
This function behaves exactly as its counterpart without the insertionMat parameter.
snapMode:  Input osnap mode being requested
gsSelectionMark:  Input GS marker of the subentity involved in the object snap operation
pickPoint:  Input point (in WCS coordinates) picked during the object snap operation
lastPoint:  Input point (in WCS coordinates) selected just before pickPoint
viewTransform:  Input transformation matrix to transform from WCS to DCS
snapPoints:  Input pre-existing array to append osnap points to (may already contain points); output with object snap points appended
geometryIds:  Not in use
insertionMat:  Input block transformation

Autodesk.AutoCAD.DatabaseServices.Entity.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This function must use the material provided in snapMode, gsSelectionMark, pickPoint, lastPoint, and viewTransform to determine all appropriate osnap points for the entity.
snapMode:  Input osnap mode being requested
gsSelectionMark:  Input GS marker of the subentity involved in the object snap operation
pickPoint:  Input point (in WCS coordinates) picked during the object snap operation
lastPoint:  Input point (in WCS coordinates) selected just before pickPoint
viewTransform:  Input transformation matrix to transform from WCS to DCS
snapPoints:  Input pre-existing array to append osnap points to (may already contain points); output with object snap points appended
geometryIds:  Not in use

Autodesk.AutoCAD.DatabaseServices.Entity.GetGripPoints(Autodesk.AutoCAD.DatabaseServices.GripDataCollection,System.Double,System.Int32,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.GetGripPointsFlags)
This .NET method wraps the ObjectARX method AcDbEntity::getGripPoints.

Autodesk.AutoCAD.DatabaseServices.Entity.GetGripPoints(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
Function usage
This function supports "old style" grips, in applications that existed before the enhancement of grip functionality.
gripPoints:  Input pre-existing array to append the grip points to; output with the entity's grip points appended
snapModes:  not currently used
geometryIds:  not currently used

Autodesk.AutoCAD.DatabaseServices.Entity.MoveGripPointsAt(Autodesk.AutoCAD.DatabaseServices.GripDataCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.MoveGripPointsFlags)
This .NET method wraps the ObjectARX method AcDbEntity::moveGripPointsAtSubentPaths.

Autodesk.AutoCAD.DatabaseServices.Entity.MoveGripPointsAt(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Function usage
This function is intended to be called by AutoCAD during a grip edit of the entity.
indices:  Input array containing index values (which correspond to grip points reported by the GetGripPoints() method) that indicate which grip points are currently "hot"
offset:  Input vector (in WCS coordinates) indicating the direction and magnitude that the grip points have been translated

Autodesk.AutoCAD.DatabaseServices.Entity.GetStretchPoints(Autodesk.AutoCAD.Geometry.Point3dCollection)
Function usage
This function is not intended to be called by ObjectARX applications.
stretchPoints:  Input pre-existing array to append the stretch points to; output with the entity's stretch points appended

Autodesk.AutoCAD.DatabaseServices.Entity.MoveStretchPointsAt(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Function usage
This function is intended to be called by AutoCAD during execution of a stretch command in which the entity has been selected.
indices:  Input array containing index values (which correspond to stretch points reported by the GetStretchPoints() method) that indicate which stretch points are being translated
offset:  Input vector (in WCS coordinates) indicating the direction and magnitude that the stretch points have been translated

Autodesk.AutoCAD.DatabaseServices.Entity.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.IntPtr,System.IntPtr)
Function usage
This method finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer:  Input entity with which "this" entity is to intersect
intersectType:  Input type of intersection requested
points:  Output with the points of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.IntPtr,System.IntPtr)
Function usage
This method finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer:  Input entity with which "this" entity is to intersect
intersectType:  Input type of intersection requested
points:  Output with the points of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int64,System.Int64)
Obsolete - Use the IntersectWith method that accepts IntPtr values.
Function usage
This method finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
The intersectType is used to determine how to deal with extending the two entities in order to calculate intersections.
entityPointer:  Input entity with which "this" entity is to intersect
intersectType:  Input type of intersection requested
projectionPlane:  Input plane for the projection to occur
points:  Output with the points of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.IntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int64,System.Int64)
Obsolete - Use the IntersectWith method that accepts IntPtr values. Function usage
This method finds the intersections of the entity pointed to by entityPointer and all the edges of the bounding box of this entity.
entityPointer:  Input entity with which "this" entity is to intersect
intersectType:  Input type of intersection requested
points:  Output with the points of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. Use the 0 default if not applicable.
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. Use the 0 default if not applicable.

Autodesk.AutoCAD.DatabaseServices.Entity.BoundingBoxIntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.IntPtr,System.IntPtr)
This method first calculates the bounding box for this entity (in WCS coordinates).
entityPointer:  Input entity with which "this" entity will intersect
intersectType:  Input requested intersection type
points:  Output with the points (in WCS coordinates) of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. May be 0 if not applicable
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. May be 0 if not applicable

Autodesk.AutoCAD.DatabaseServices.Entity.BoundingBoxIntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.IntPtr,System.IntPtr)
Projects the bounding box edges of this entity and the entityPointer entity onto the projectionPlane, finds the intersection points, and then projects the intersection points back onto the appropriate bounding box edge of this entity.
entityPointer:  Input entity with which "this" entity will intersect
intersectType:  Input requested intersection type
projectionPlane:  Input projection plane for the apparent intersection of the two entities
points:  Output with the points (in WCS coordinates) of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. May be 0 if not applicable
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. May be 0 if not applicable

Autodesk.AutoCAD.DatabaseServices.Entity.BoundingBoxIntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int64,System.Int64)
Obsolete - Use the BoundingBoxIntersectWith method that accepts IntPtr values instead.
First calculates the bounding box for this entity (in WCS coordinates).
entityPointer:  Input entity with which "this" entity will intersect
intersectType:  Input requested intersection type
points:  Output with the points (in WCS coordinates) of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. May be 0 if not applicable
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. May be 0 if not applicable

Autodesk.AutoCAD.DatabaseServices.Entity.BoundingBoxIntersectWith(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Intersect,Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int64,System.Int64)
Obsolete - Use the BoundingBoxIntersectWith method that accepts IntPtr values instead.
Projects the bounding box edges of this entity and the entityPointer entity onto the projectionPlane, finds the intersection points, and then projects the intersection points back onto the appropriate bounding box edge of this entity.
entityPointer:  Input entity with which "this" entity will intersect
intersectType:  Input requested intersection type
projectionPlane:  Input projection plane for the apparent intersection of the two entities
points:  Output with the points (in WCS coordinates) of intersection appended
thisGraphicSystemMarker:  Input GS marker of subentity of "this" entity that's involved in the intersection operation. May be 0 if not applicable
otherGraphicSystemMarker:  Input GS marker of subentity of the entity pointed to by entityPointer that's involved in the intersection operation. May be 0 if not applicable

Autodesk.AutoCAD.DatabaseServices.Entity.List
Function usage
This function is intended to be called from AutoCAD whenever the entity is selected during the LIST command.

Autodesk.AutoCAD.DatabaseServices.Entity.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Function usage
This function provides a means by which AutoCAD and ObjectARX applications can ask the entity to apply a transformation matrix (xform) to itself.
transform:  Input transformation matrix to be applied to the entity

Autodesk.AutoCAD.DatabaseServices.Entity.GetTransformedCopy(Autodesk.AutoCAD.Geometry.Matrix3d)
Function usage
This function creates a clone of the entity, applies the transform transformation matrix to the clone, and then returns the transformed clone.
transform:  Input matrix by which to transform the copy of the entity

Autodesk.AutoCAD.DatabaseServices.Entity.GetSubentity(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Obtains the subentity.
id:  Input the path to the subentity

Autodesk.AutoCAD.DatabaseServices.Entity.Explode(Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
This function is primarily intended for AutoCAD to call as part of an explode operation that includes this entity.
entitySet:  Input collection of pointers to new entities; this array may already contain pointers from other entities' explode() methods

Autodesk.AutoCAD.DatabaseServices.Entity.RecordGraphicsModified(System.Boolean)
This method sets the entity's state to indicate whether or not the entity should be updated on screen when it is closed. If the entity is set not to update, then any changes made will appear the next time the entity is regenerated.
If setModified is false and the entity is currently set to update its graphics on close (which is its default state), then this function sets the entity so that it will not update on screen when it is closed and objectModified notification is sent to all entity type reactors attached to the entity.
If setModified is true, then the entity is set to update on screen when it is closed.
setModified:  Input Boolean value to indicate if the entity's graphics should be updated on screen when the object is closed

Autodesk.AutoCAD.DatabaseServices.Entity.Draw
Queues up the entity's graphics and flushes the graphics queue, forcing the entity and anything else in the queue to be drawn or re-drawn on-screen.

Autodesk.AutoCAD.DatabaseServices.Entity.SaveAs(Autodesk.AutoCAD.GraphicsInterface.WorldDraw,Autodesk.AutoCAD.DatabaseServices.SaveType)
Function usage
This function is used by AutoCAD to generate the graphic primitives whenever a DWG save is occurring that requires proxy graphics to be saved for the entity.
mode:  Input pointer to fully initialized WorldDraw object (or an object of a class derived from WorldDraw)
st:  Input SaveType indicates why the saveAs is being called.

Autodesk.AutoCAD.DatabaseServices.Entity.SetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
This function sets the entity's: ColorLayerLinetypeLinetype scaleVisibilityPlot style nameLine weight
to the default values of the database indicated by sourceDatabase: If sourceDatabase == NULL, then the current database in the AutoCAD editor is used.
sourceDatabase:  Input database whose defaults will be used to set the values of the entity

Autodesk.AutoCAD.DatabaseServices.Entity.SetDatabaseDefaults
This function sets the entity's ColorLayerLinetypeLinetype scaleVisibilityPlot style nameLine weight
to the default values of the database in which the entity currently resides or, if the entity is not part of a database yet, the current database in the AutoCAD editor is used.

Autodesk.AutoCAD.DatabaseServices.Entity.SetDragStatus(Autodesk.AutoCAD.DatabaseServices.DragStatus)
This function is called when a drag operation involving this entity is starting, ending, or aborting.
status:  Value describing the status of the drag operation; one of the values from the DragStat enumeration

Autodesk.AutoCAD.DatabaseServices.Entity.SetGripStatus(Autodesk.AutoCAD.DatabaseServices.GripStatus)
This notification allows the entity to perform any required resource management tasks before the grip's GripStatus objects and any alternate basepoint objects pointed to by the GripStatus objects are deleted.
status:  Value describing the status of the grip operation; one of the values from the GripStatus enumeration

Autodesk.AutoCAD.DatabaseServices.Entity.SetSubentityGripStatus(Autodesk.AutoCAD.DatabaseServices.GripStatus,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
This function is called with a status value of GripsToBeDeleted when the grips for the subentity are about to be deleted in the host application.
status:  Input the status of the grip operation
subentity:  Input the subentity on the object whose grip status changed

Autodesk.AutoCAD.DatabaseServices.Entity.JoinEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This wraps AcDbJoinEntityPE::joinEntity, which when implemented for an Entity, it can be used to join two supported entities together.
secondaryEntity:  The secondary entity, which provides the data to be joined to the this entity.

Autodesk.AutoCAD.DatabaseServices.Entity.JoinEntities(Autodesk.AutoCAD.DatabaseServices.Entity[])
This wraps AcDbJoinEntityPE::joinEntities(), which when implemented for an Entity can be used to join supported entities together.
otherEntities:  The other entities to be joined to the primary entity. Note, some implementations might require all of these entities to be of the same type as the primary entity.

Autodesk.AutoCAD.DatabaseServices.Entity.EdgeStyleId
Get and set the edge-only visual style object ID.

Autodesk.AutoCAD.DatabaseServices.Entity.FaceStyleId
Get and set the face-only visual style object ID.

Autodesk.AutoCAD.DatabaseServices.Entity.VisualStyleId
Get and set the full visual style object ID.

Autodesk.AutoCAD.DatabaseServices.Entity.ForceAnnoAllVisible
Accesses the current ANNOALLVISIBLE value for the database
See the System Variables section of the AutoCAD Command Reference for information on ANNOALLVISIBLE.

Autodesk.AutoCAD.DatabaseServices.Entity.BlockName
Accesses the name of the owner block.

Autodesk.AutoCAD.DatabaseServices.Entity.MaterialMapper
Accesses the Mapper that is use to map a material to the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.MaterialId
Accesses the ID of the associated Material object.

Autodesk.AutoCAD.DatabaseServices.Entity.Material
Accesses the material name.

Autodesk.AutoCAD.DatabaseServices.Entity.ReceiveShadows
Accesses whether this entity can receive shadows.

Autodesk.AutoCAD.DatabaseServices.Entity.CastShadows
Accesses whether the entity can cast shadows.

Autodesk.AutoCAD.DatabaseServices.Entity.Hyperlinks
Accesses a collection of hyperlinks associated with the object.

Autodesk.AutoCAD.DatabaseServices.Entity.CloneMeForDragging
Accesses whether a clone should be created for use in a dragging operation.

Autodesk.AutoCAD.DatabaseServices.Entity.CompoundObjectTransform
Accesses the transformation matrix used for nested objects.

Autodesk.AutoCAD.DatabaseServices.Entity.GeometricExtents
Accesses the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the entity, and return those points as an instance of class Extents in the "extents" parameter.

Autodesk.AutoCAD.DatabaseServices.Entity.Ecs
Accesses a transformation matrix that can be used to transform vectors or points from the object's object coordinate system (OCS) to the World Coordinate System (WCS).

Autodesk.AutoCAD.DatabaseServices.Entity.IsPlanar
Assesses if a plane contains the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.CollisionType
Accesses the collision detection treatment for this entity.

Autodesk.AutoCAD.DatabaseServices.Entity.LineWeight
Accesses the LineWeight of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Visible
Accesses the visibility of an entity.

Autodesk.AutoCAD.DatabaseServices.Entity.LinetypeScale
Accesses the linetype scale factor for the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.LinetypeId
Accesses the ObjectId of the LinetypeTableRecord referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Linetype
Accesses the name string in the LinetypeTableRecord object referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.LayerId
Accesses the ObjectId of the LayerTableRecord referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Layer
Accesses the name string in the LayerTableRecord object referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.PlotStyleNameId
Accesses the object ID of the PlaceHolder object referenced by the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.PlotStyleName
Accesses the plotstyle name string of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Transparency
Accesses the transparency value for the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.EntityColor
Accesses the color settings of the entity in an EntityColor form.

Autodesk.AutoCAD.DatabaseServices.Entity.ColorIndex
Accesses the AutoCAD color number of the entity.

Autodesk.AutoCAD.DatabaseServices.Entity.Color
Accesses the full true color information for the entity within an instance of Color.

Autodesk.AutoCAD.DatabaseServices.Entity.BlockId
Accesses the ObjectId of the entity's owner, which must be a BlockTableRecord.