Autodesk.AutoCAD.GraphicsInterface.IBLBackgroundTraits
This class enables IBL background definitions to be elaborated to AcGi implementations.

Autodesk.AutoCAD.GraphicsInterface.IBLBackgroundTraits.SecondaryBackground
Gets the background to display when DisplayImage is set to false.

Autodesk.AutoCAD.GraphicsInterface.IBLBackgroundTraits.DisplayImage
Gets whether to display the IBL image as the background.

Autodesk.AutoCAD.GraphicsInterface.IBLBackgroundTraits.Rotation
Gets the rotation value for the IBL image.

Autodesk.AutoCAD.GraphicsInterface.IBLBackgroundTraits.IBLImageName
Gets the image used for IBL.

Autodesk.AutoCAD.GraphicsInterface.IBLBackgroundTraits.Enable
Gets whether IBL is currently active.