Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext
This class represents the input parameters of the CustomOsnapInfo.getOsnapInfo() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.ViewTransform
Accesses the transformation matrix to transform from WCS to DCS.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.LastPoint
Accesses the point (in WCS coordinates) selected just before PickPoint.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.PickPoint
Accesses the point (in WCS coordinates) picked during the object snap operation.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.GraphicsSystemSelectionMark
Accesses the graphic system marker of the subentity involved in the object snap operation.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapContext.PickedObject
Accesses the entity involved in the object snap operation.