Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp
This is class Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.#ctor
This is PointCloudClassificationColorRamp, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.Color(System.Int32)
This is Color, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.SetColor(System.Int32,Autodesk.AutoCAD.Colors.EntityColor)
This is SetColor, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.Visibility(System.Int32)
This is Visibility, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.SetVisibility(System.Int32,System.Boolean)
This is SetVisibility, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.SetFrom(Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp)
This is SetFrom, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.Name
This is Name, a member of class PointCloudClassificationColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp.NumColors
This is NumColors, a member of class PointCloudClassificationColorRamp.