Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator
This class enumerates the properties in a DynamicBlockReferencePropertyCollection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.MoveNext
This method moves the current pointer to the next item, or to the end marker if the current item is at the end of the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Reset
This method resets the current pointer to the first item in the collection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Current
Accesses the current item.