Autodesk.AutoCAD.GraphicsInterface.MarbleTexture
This .NET class wraps the AcGiMarbleTexture ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.Clone
Clones the marble texture.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.Set(Autodesk.AutoCAD.GraphicsInterface.MarbleTexture)
Sets the MarbleTexture object.
value:  Input existing marble texture

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MarbleTexture,Autodesk.AutoCAD.GraphicsInterface.MarbleTexture)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MarbleTexture,Autodesk.AutoCAD.GraphicsInterface.MarbleTexture)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.VeinWidth
Returns the width of veins of the marble.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.VeinSpacing
Returns the spacing between veins of the marble.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.VeinColor
Returns the vein color of the marble.

Autodesk.AutoCAD.GraphicsInterface.MarbleTexture.StoneColor
Returns the stone color value of the marble.