Autodesk.AutoCAD.DatabaseServices.Graph
This .NET class wraps the AcDbGraph ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Graph.#ctor(Autodesk.AutoCAD.DatabaseServices.GraphNode)
The first node in the graph is considered the root node.
root:  Input root node. Default is NULL.

Autodesk.AutoCAD.DatabaseServices.Graph.Node(System.Int32)
Returns the node at the index.
index:  Input desired node index

Autodesk.AutoCAD.DatabaseServices.Graph.AddNode(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds a new node to the graph.
nodeToAdd:  Node to add

Autodesk.AutoCAD.DatabaseServices.Graph.AddEdge(Autodesk.AutoCAD.DatabaseServices.GraphNode,Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds an edge between two nodes to the graph.
from:  Input the node to begin the edge at
toPointer:  Input the node to end the edge at

Autodesk.AutoCAD.DatabaseServices.Graph.DelNode(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Completely removes a node from the graph.
nodeToDelete:  Node to delete

Autodesk.AutoCAD.DatabaseServices.Graph.Reset
Deletes all of the nodes and cycle nodes, and resets the graph to being empty.

Autodesk.AutoCAD.DatabaseServices.Graph.ClearAll(System.Byte)
Used to clear the flag bit(s) in all the nodes in the graph.
flags:  Input flag values to clear for all nodes in the graph

Autodesk.AutoCAD.DatabaseServices.Graph.GetOutgoing
Takes the nodes and returns all of the outgoing nested nodes as a collection.

Autodesk.AutoCAD.DatabaseServices.Graph.FindCycles(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Sets up the internal cycle graph in order to find and label all nodes which cause circular references.
start:  Input node to begin the search for cycles at. Usually defaulted to NULL.

Autodesk.AutoCAD.DatabaseServices.Graph.BreakCycleEdge(Autodesk.AutoCAD.DatabaseServices.GraphNode,Autodesk.AutoCAD.DatabaseServices.GraphNode)
This method is used to break a cycle at a particular point.
from:  Input node that the edge begins at
toPointer:  Input node that the edge ends at

Autodesk.AutoCAD.DatabaseServices.Graph.SetNodeGrowthRate(System.Int32)
This method sets the number of nodes that are allocated to the graph at a time.
rate:  Number of nodes to allocate at once

Autodesk.AutoCAD.DatabaseServices.Graph.IsEmpty
Assesses if the graph is empty.

Autodesk.AutoCAD.DatabaseServices.Graph.NumNodes
Accesses the number of nodes in the graph.

Autodesk.AutoCAD.DatabaseServices.Graph.RootNode
Accesses the root, or first, node in the graph.