Autodesk.AutoCAD.DatabaseServices.FaceRecord
This .NET class wraps the AcDbFaceRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.#ctor(System.Int16,System.Int16,System.Int16,System.Int16)
This constructor initializes the FaceRecord to use the mesh vertices specified by the indices vertex0 through vertex3 as the four corner points of the face.
vertex0:  Input index number of first vertex for the face
vertex1:  Input index number of second vertex for the face
vertex2:  Input index number of third vertex for the face
vertex3:  Input index number of fourth vertex for the face

Autodesk.AutoCAD.DatabaseServices.FaceRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.FaceRecord.GetVertexAt(System.Int16)
This function returns the index number PolyFaceMesh vertex used as the faceIndex corner of the face.
faceIndex:  Input face corner index number (must be 0 through 3)

Autodesk.AutoCAD.DatabaseServices.FaceRecord.SetVertexAt(System.Int16,System.Int16)
This function sets the FaceRecord so that the PolyFaceMesh vertex list index number vertexIndex is used as the vertex index for the faceIndex corner of the face.
faceIndex:  Input face corner index number (must be 0 - 3)
vertexIndex:  Input index of vertex in PolyFaceMesh's vertex list that is to be used for this face corner

Autodesk.AutoCAD.DatabaseServices.FaceRecord.IsEdgeVisibleAt(System.Int16)
This function uses the visible argument to return the visibility value for the edge that starts with the face corner specified by faceIndex.
faceIndex:  Input face corner index number (must be 0 through 3)

Autodesk.AutoCAD.DatabaseServices.FaceRecord.MakeEdgeVisibleAt(System.Int16)
This function sets the edge that starts at the corner specified by faceIndex to be visible.
faceIndex:  Input index number of starting corner for edge (must be 0 - 3)

Autodesk.AutoCAD.DatabaseServices.FaceRecord.MakeEdgeInvisibleAt(System.Int16)
This function sets the edge that starts at the corner specified by faceIndex to be invisible.
faceIndex:  Input index number of starting corner for edge (must be 0 - 3)