Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint
This class represents a constrained point node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained line is holding on.

Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedPoint.Point
Gets the point position, relative to the work plane of the owning Assoc2dConstraintGroup object.