Autodesk.AutoCAD.Geometry.Line2dCollection
This class provides a container for Autodesk.AutoCAD.Geometry.Line2d objects.

Autodesk.AutoCAD.Geometry.Line2dCollection.Add(Autodesk.AutoCAD.Geometry.Line2d)
Adds the object represented by value to this collection.
value:  Input value to add

Autodesk.AutoCAD.Geometry.Line2dCollection.Contains(Autodesk.AutoCAD.Geometry.Line2d)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input value to check for

Autodesk.AutoCAD.Geometry.Line2dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Line2d)
Returns the 0-based index of the collection item that matches value.
value:  Input value to retrieve index of

Autodesk.AutoCAD.Geometry.Line2dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Line2d)
Inserts value at position index in the collection.
index:  Input index to insert at
value:  Input item to insert

Autodesk.AutoCAD.Geometry.Line2dCollection.Remove(Autodesk.AutoCAD.Geometry.Line2d)
Removes the object represented by value from this collection.
value:  Input value to remove

Autodesk.AutoCAD.Geometry.Line2dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Line2d[],System.Int32)
Copies objects in array to this collection starting from index.
array:  Input array to copy to
index:  Input index to begin copying from

Autodesk.AutoCAD.Geometry.Line2dCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Input index of value to be removed

Autodesk.AutoCAD.Geometry.Line2dCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Geometry.Line2dCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.Geometry.Line2dCollection.Count
Returns the number of objects in this collection.