Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::AcDbAssocOffsetSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody.GetDistance(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::distance() method.

Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody.SetDistance(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::setDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Double,System.Boolean)
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody.Distance
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::distance() and AcDbAssocOffsetSurfaceActionBody::setDistance ()methods.