Autodesk.AutoCAD.DatabaseServices.OsnapOverrule
This .NET class wraps the ObjectARX class AcDbOsnapOverrule.

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.IntPtr,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.Matrix3d)
This .NET method wraps the ObjectARX method: AcDbOsnapOverrule::getOsnapPoints (AcDbEntity*, AcDb::OsnapMode, Adesk::GsMarker, AcGePoint3d&, AcGePoint3d&, AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray &, AcGeMatrix3d&).

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.GetObjectSnapPoints(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes,System.IntPtr,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
This .NET method wraps the ObjectARX method: AcDbOsnapOverrule::getOsnapPoints (AcDbEntity*, AcDb::OsnapMode, Adesk::GsMarker, AcGePoint3d&, AcGePoint3d&, AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray &).

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.OsnapOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.