Autodesk.AutoCAD.DatabaseServices.AssocDependencyPE
Wrapper AcRx protocol extension base class that allows objects and entities to control whether they allow AssocDependencies to be attached to them.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyPE.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyPE.AllowsDependencies(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
This predicate allows objects and entities to control whether they allow AssocDependencies to be attached to them. Returns true if the object allows AssocDependencies to be attached to it.
isWriteDependency:  The dependency will also modify the object.
object:  The queried object, must be open for read.