Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedEllipse
This class represents a constrained ellipse arc node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedEllipse.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained bounded ellipse is holding on.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedEllipse.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedEllipse.EndPoint
Gets the end point of the constrained bounded ellipse, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedBoundedEllipse.StartPoint
Gets the start point of the constrained bounded ellipse, relative to the work plane of the owning Assoc2dConstraintGroup object.