Autodesk.AutoCAD.GraphicsInterface.ColorRGB
This .NET class wraps the AcGiColorRGB ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ColorRGB.#ctor(System.Double,System.Double,System.Double)
Creates an RGB color with color components red, green, and blue correspondingly.
red:  The red component.
green:  The green component.
blue:  The blue component.

Autodesk.AutoCAD.GraphicsInterface.ColorRGB.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ColorRGB.Blue
Accesses the blue value from 0 to 255.

Autodesk.AutoCAD.GraphicsInterface.ColorRGB.Green
Accesses the green value from 0 to 255.

Autodesk.AutoCAD.GraphicsInterface.ColorRGB.Red
Accesses the red value from 0 to 255.