Autodesk.AutoCAD.GraphicsInterface.WoodTexture
This .NET class wraps the AcGiWoodTexture ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Clone
Clones the WoodTexture object.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Set(Autodesk.AutoCAD.GraphicsInterface.WoodTexture)
Sets the realistic wood grain component of a material.
value:  Input new texture value

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.WoodTexture,Autodesk.AutoCAD.GraphicsInterface.WoodTexture)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.WoodTexture,Autodesk.AutoCAD.GraphicsInterface.WoodTexture)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.GrainThickness
Returns the thickness of the wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.AxialNoise
Returns the axial noise level of the wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.RadialNoise
Returns the radial noise level of the wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Color2
Returns the color property of the second wood grain.

Autodesk.AutoCAD.GraphicsInterface.WoodTexture.Color1
Returns the color property of the first wood grain.