Autodesk.AutoCAD.DatabaseServices.ResultBuffer
This .NET class wraps the resbuf ObjectARX struct.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Create(System.IntPtr,System.Boolean)
This method creates a managed ResultBuffer object from an unmanaged resbuf pointer.
buffer:  Input pointer
autoDelete:  Set to true if the pointer should be deleted after creation

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.GetEnumerator
Returns an enumerator object for this ResultBuffer object.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Add(System.Object)
Adds value to the end of this ResultBuffer's list.
value:  Input object to add

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Add(Autodesk.AutoCAD.DatabaseServices.TypedValue)
If value can be coerced to type TypedValue , then it is added to the end of this ResultBuffer's list.
value:  Input object to add

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.AsArray
This method returns an array of typed values representing the nodes in the resbuf chain.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.Equals(System.Object)
Returns true if this object is identical to the argument object..
obj:  Object to check against

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.op_Inequality(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.op_Equality(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture definition

Autodesk.AutoCAD.DatabaseServices.ResultBuffer.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in a specific format, with the culture-specific format defined by provider.
format:  Input format for string
provider:  Input culture definition