Autodesk.AutoCAD.DatabaseServices.MatchProperties
This .NET class wraps the AcDbMatchProperties ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MatchProperties.CopyProperties(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,System.Int32)
This method is expected to copy any appropriate properties from sourceEntity to targetEntity.
sourceEntity:  Input entity from which properties will be copied
targetEntity:  Input entity to which properties will be copied
flag:  Input bit flags indicating which properties to copy