Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
This wraps AcDbAssocPathBasedSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::AcDbAssocPathBasedSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.RemoveAllPathParams
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::removeAllPathParams() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.SetInputPaths(Autodesk.AutoCAD.DatabaseServices.PathRef[])
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::setInputPaths() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.UpdateInputPath(System.Int32,Autodesk.AutoCAD.DatabaseServices.PathRef)
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::updateInputPath() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.SetInputPoints(Autodesk.AutoCAD.DatabaseServices.VertexRef[])
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::setInputPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.GetInputPoints
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::getInputPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.MakeInputPathsDrawOnTopOfResultingSurface
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::makeInputPathsDrawOnTopOfResultingSurface() method.

Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody.InputPathParams
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::getInputPathParams() method.