Autodesk.AutoCAD.GraphicsInterface.PolylineCollection
This .NET class wraps the ObjectARX AcGiPolyline Class.

Autodesk.AutoCAD.GraphicsInterface.PolylineCollection.#ctor
Constructor.

Autodesk.AutoCAD.GraphicsInterface.PolylineCollection.Add(Autodesk.AutoCAD.GraphicsInterface.Polyline)
Adds a polyline.
value:  Input the polyline object.

Autodesk.AutoCAD.GraphicsInterface.PolylineCollection.RemoveAt(System.Int32)
Removes the polyline at the specified index.
index:  Input the specified index.

Autodesk.AutoCAD.GraphicsInterface.PolylineCollection.Clear
Clears the ployline collection object.

Autodesk.AutoCAD.GraphicsInterface.PolylineCollection.Count
Accesses the count of polylines.