Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent
This class gives the opacity component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.#ctor(System.Double,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)
This constructor initializes the material opacity component.
percentage:  Input opacity percentage
map:  Input material map

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Input object to compare against

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.Percentage
Returns the opacity percentage.

Autodesk.AutoCAD.GraphicsInterface.MaterialOpacityComponent.Map
Returns material component maps.