Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs
This class provides data for the BlockInsertionPoints event of the database.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.AlignmentVectors
Accesses the AlignmentVectors property value.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.InsertionPoints
Accesses the InsertionPoints property value.

Autodesk.AutoCAD.DatabaseServices.BlockInsertionPointsEventArgs.BlockTableRecord
Accesses the BlockTableRecord property value.