Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility
A Utility class to wrap all global utility methods.

Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility.EvaluationRequestSeverityLevel(Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Returns the severity level (positive integer) of those status values that indicate a request for an AssocAction or an AssocDependency to be evaluated, or 0 if the status does not indicate an evaluation request.
status:  The AssocStatus.

Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility.IsEvaluationRequest(Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Returns true for the AssocStatus values that are a request for an AssocAction or AssocDependency to be evaluated, and false for other AssocStatus values.
status:  The AssocStatus.

Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility.IsToBeSkipped(Autodesk.AutoCAD.DatabaseServices.AssocStatus)
Returns true if the AssocStatus indicates that the action or dependency should be skipped and treated as if it were not there.
status:  The AssocStatus.

Autodesk.AutoCAD.DatabaseServices.AssocGlobalUtility.IsDraggingProvidingSubstituteObjects(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback)
Returns true if in the middle of dragging and the AssocDraggingState indicates that the dragger is providing substitute non-database resident objects that are clones of the original database-resident objects.
evaluationCallback:  The current AssocEvaluationCallback. NULL pointer is allowed.