Autodesk.AutoCAD.DatabaseServices.HatchLoop
This class encapsulates data for defining a hatch boundary loop.

Autodesk.AutoCAD.DatabaseServices.HatchLoop.#ctor(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes)
Constructs a new HatchLoop object with a boundary loop (polyline) appended to the hatch entity.
loopType:  Input type of loop

Autodesk.AutoCAD.DatabaseServices.HatchLoop.Curves
Accesses the curves in the hatch loop.

Autodesk.AutoCAD.DatabaseServices.HatchLoop.Polyline
Accesses the polylines in the hatch loop.

Autodesk.AutoCAD.DatabaseServices.HatchLoop.LoopType
Accesses the type of loop.

Autodesk.AutoCAD.DatabaseServices.HatchLoop.IsPolyline
Assesses true if the hatch loop is a polyline.