Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback
Specifies the call for the point cloud line extraction process.

Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback.UpdateProgress(System.Int32)
Updates the progress, from 0 ~ 99.
progress:  The progress, from 0~99.

Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback.UpdateCaption(System.String)
Updates the caption displayed in the progress dialog, if any.
caption:  The caption

Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback.Cancelled
Specifies whether or not the callback is cancelled.

Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback.Cancel
Cancels the progress.

Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback.UpdateRemainTime(System.Double)
Updates the remaining time of the progress, in seconds.

Autodesk.AutoCAD.Runtime.IPointCloudExtractionProgressCallback.End
Specifies the end of the process.