Autodesk.AutoCAD.DatabaseServices.SecurityParameters
This .NET class wraps the SecurityParams ObjectARX struct.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.op_Inequality(Autodesk.AutoCAD.DatabaseServices.SecurityParameters,Autodesk.AutoCAD.DatabaseServices.SecurityParameters)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.op_Equality(Autodesk.AutoCAD.DatabaseServices.SecurityParameters,Autodesk.AutoCAD.DatabaseServices.SecurityParameters)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.TimeServer
Returns the name of the time server used for timestamping.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Comment
Returns the comment to be included with the signature.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.SerialNumber
Returns the serial number of the certificate (digital ID).

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Issuer
Returns the name of the certificate (digital ID) issuer.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Subject
Returns the name of the certificate (digital ID) subject.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Algorithm
Returns the algorithm identifier; must be SECURITYPARAMS_ALGID_RC4.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.ProviderName
Returns the name of the cryptography provider.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Password
Returns the password, formatted as a zero-terminated "wide-char" string.

Autodesk.AutoCAD.DatabaseServices.SecurityParameters.Action
Accesses the.