Autodesk.AutoCAD.GraphicsInterface.CommonDraw
This .NET class wraps the AcGiCommonDraw ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.Deviation(Autodesk.AutoCAD.GraphicsInterface.DeviationType,Autodesk.AutoCAD.Geometry.Point3d)
Returns the recommended maximum tessellation deviation of the type specified by deviationType.
deviationType:  Input desired deviation type.
pointOnCurve:  Input point locating curve or surface to be tessellated.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.NumberOfIsolines
Returns the suggested number of isolines to use to represent the entity.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.IsDragging
Returns true if the entity is currently being dragged; otherwise, returns false.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.Context
Returns the controlling context.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RawGeometry
Returns the current geometry class as an Geometry.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.SubEntityTraits
Returns the SubEntityTraits object.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RegenAbort
Provides a means to find out if an immediate termination of the graphics regeneration is requested by the system.

Autodesk.AutoCAD.GraphicsInterface.CommonDraw.RegenType
Gets the regeneration type.