Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode
This .NET class wraps the AcDbCustomOsnapMode and AcDbCustomOsnapManager ObjectARX classes.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.GraphicsInterface.Glyph)
Constructor.
localModeString:  Input local mode string
globalModeString:  Input global mode string
toolTipText:  Input tool tip text
glyph:  Input glyph to use

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.ApplyToEntityType(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.DatabaseServices.AddObjectSnapInfo)
Applies a new callback to the given entity.
entity:  Input entity to apply to
callback:  Input callback to apply

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.RemoveFromEntityType(Autodesk.AutoCAD.Runtime.RXClass)
Removes an entity type.
entity:  Input entity to remove

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Activate(System.String)
This function is used to activate an OSNAP mode.
mode:  Input custom OSNAP mode string

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Deactivate(System.String)
Used to deactivate an OSNAP mode.
mode:  Input mode string

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.IsActive(System.String)
Returns true if the mode is registered and active; otherwise, returns false.
mode:  Input custom OSNAP mode string

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.DisplayString
Gets the display string.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Bitmap
Gets the bitmap used as osnap menu item icon.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.GlyphSize
Returns the size of the glyph.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.ToolTipText
This method returns the OSNAP mode glyph and default tooltip string.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.Glyph
Returns the custom glyph.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.GlobalModeString
Returns the global custom OSNAP keyword string that user must type in which is the actual text string which AutoCAD point acquisition and running OSNAP modes will recognize.

Autodesk.AutoCAD.DatabaseServices.CustomObjectSnapMode.LocalModeString
Returns the local custom OSNAP keyword string the user must type; this is the actual text string that AutoCAD point acquisition and running OSNAP modes will recognize.