Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx
The PointCloudDefEx object (or "point cloud extension definition object") controls the actual point cloud data associated with one or more PointCloudEx entities (or "point cloud extension entity").

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.#ctor
This is PointCloudDefEx, a member of class PointCloudDefEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.classVersion
Returns the class version number that indicates which version of AcDbPointCloudEx this object represents.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.load
Loads point cloud data from the source point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.unload
Unloads all point cloud data in the AcDbPointCloudDefEx immediately, but does not delete the AcDbPointCloudDefEx itself.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.getRcsFilePath(System.String)
Gets the file path of specified RCS.
guid:  Specifies the GUID of the RCS

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.getAllRcsFilePaths
Gets the list which contains all RCS filepath.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.extents
Gets the whole extents of attached point cloud.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.defaultHeight
Returns the default extent's height of the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.defaultLength
Returns the default extent's length of the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.defaultWidth
Returns the default extent's width of the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.totalScansCount
Returns the total scan count for the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.totalRegionsCount
Returns the total region count for the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.totalPointsCount
Returns the total point count for the point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.FileType
Returns the file extension of this definition's point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.ActiveFileName
Sets the active path name of the externally referenced point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.SourceFileName
Sets the pathname of a externally referenced point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudDefEx.EntityCount
Returns the number of AcDbPointCloudEx entities in the current drawing.