Autodesk.AutoCAD.DatabaseServices.ObjectId
This .NET struct wraps the AcDbObjectId ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ObjectId.#ctor(System.IntPtr)
Constructs an object ID based on an old integer pointer.
oldId:  Input pointer to construct from

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetObject(Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Returns the object associated with this ID.
mode:  Input mode to retrieve the object
openErased:  Input Boolean indicating whether to obtain erased objects
forceOpenOnLockedLayer:  Input true if locked layers should be opened

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetObject(Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
Returns the object associated with this ID.
mode:  Input mode to retrieve the object
openErased:  Input Boolean indicating whether to obtain erased objects

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetObject(Autodesk.AutoCAD.DatabaseServices.OpenMode)
Returns the object associated with this ID.
mode:  Input mode to retrieve the object

Autodesk.AutoCAD.DatabaseServices.ObjectId.Equals(System.Object)
Returns true if this object is equal to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.DatabaseServices.ObjectId.op_Inequality(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.ObjectId.op_Equality(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.ObjectId.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture definition

Autodesk.AutoCAD.DatabaseServices.ObjectId.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Compare(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Compares this object to value1 and returns true if they are equal.
value1:  Input object to compare against

Autodesk.AutoCAD.DatabaseServices.ObjectId.ConvertToRedirectedId
This function will take the object ID for this object if it has been redirected from another database, and convert it to the actual object ID for the other database (for example: the object ID from an xref database).

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsResident
Assesses if the object associated with this objectId is resident in memory.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Null
Accesses a null object ID.

Autodesk.AutoCAD.DatabaseServices.ObjectId.NonForwardedHandle
If this object ID is in an xref database and the object associated with this object ID has been redirected to the host database, then the value of this property is the handle in the xref database.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Handle
Accesses the handle of the object associated with the object ID.

Autodesk.AutoCAD.DatabaseServices.ObjectId.OriginalDatabase
If this object ID is in an xref database and the object associated with this object ID has been redirected to the host database, then this property will return a pointer to the xref database.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsEffectivelyErased
Assesses true if the object associated with this object ID is erased or if any of the owners in the ownership hierarchy for the object (in other words, the object's owner, the object's owner's owner, etc.) are erased.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsErased
Assesses if the object associated with this object ID is erased.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsWellBehaved
Checks, in a safe way (using an exception handler), whether this AcDbObjectId is "well behaved".

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsValid
Assesses if the object ID is associated with a database that is currently in memory.

Autodesk.AutoCAD.DatabaseServices.ObjectId.IsNull
Assesses if the object ID has a null value.

Autodesk.AutoCAD.DatabaseServices.ObjectId.Database
Accesses the database in which the object ID is resident.

Autodesk.AutoCAD.DatabaseServices.ObjectId.OldIdPtr
Accesses the objectId value as a long, which is the old format (an is an array of two longs, the first element of which contains the same value as that in an objectId).

Autodesk.AutoCAD.DatabaseServices.ObjectId.OldId
Obsolete - Use the OldIdPtr property instead
Accesses the objectId value as a long, which is the old format (an is an array of two longs, the first element of which contains the same value as that in an objectId).

Autodesk.AutoCAD.DatabaseServices.ObjectId.ObjectClass
Accesses the RXClass of the object that is associated with the object id, thus guaranteeing that the result can be safely de-referenced and correctly compared against any class derived from DBObject.