Autodesk.AutoCAD.DatabaseServices.GeomapImage
The GeomapImage class represents an embedded raster image which is captured from a portion of LiveMap.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.#ctor
This is GeomapImage, a member of class GeomapImage.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.GetVertices
Gets the 4 corner points of the embeded image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.GetImageVertices
This is GetImageVertices, a member of class GeomapImage.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.ImageSize
The size of the embeded image in pixel.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.UpdateMapImage(System.Boolean)
Update the embeded image by re-capturing the live map.
Reset:  Input Boolean to indicate whether to recapture the image in optimal resolution to the screen. If true, the L

Autodesk.AutoCAD.DatabaseServices.GeomapImage.Fade
The brightness of the map image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.Contrast
The brightness of the map image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.Brightness
The brightness of the map image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.IsOutOfDate
A flag to indicate whether the image is up to date.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.MapType
The map type of the map image as an enumerated value.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.LOD
Map Level Of Details (Zoom level) at the point of captured.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.Resolution
The resolution of the image as an enumerated value that apply on top of LOD.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.ImageWidth
Width of the Geomap embeded image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.ImageHeight
Height of the Geomap embeded image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.ImageBottomLeftPoint
The original point in the bottom left corner of the embeded image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.Width
Width of the Geomap Image.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.Height
Height of the Geomap Image frame.

Autodesk.AutoCAD.DatabaseServices.GeomapImage.BottomLeftPoint
The original point in the bottom left corner of the image frame.