Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters
AssocArrayParameters wraps the ObjectARX AcDbAssocArrayParameters class.

Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters.Commit
This method commits the changes contained in the AssocArrayParameters object and syncs the changes with the database, so the changes to the array are visible on the screen.

Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters.Owner
Gets the owner (AssocArray object) of this AssocArrayParameters object.