Autodesk.AutoCAD.GraphicsInterface.PointLightTraits
This .NET class wraps the AcGiPointLightTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.#ctor
Constructor.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.HasTarget
Returns True if the light displays a target grip, else False.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.TargetLocation
The location (position) towards which the light is "pointing," in the coordinate space of the current context.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.LampColor
Returns the RGB value for the light's lamp color.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.PhysicalIntensity
Returns the physical intensity of the light in candela.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.Attenuation
Returns the attenuation parameters for this light.

Autodesk.AutoCAD.GraphicsInterface.PointLightTraits.Position
Returns the position of the light source, in the coordinate space of the current context.