Autodesk.AutoCAD.DatabaseServices.Circle
This .NET class wraps the AcDbCircle ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Circle.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs a specific circle.
center:  Input center location
normal:  Input normal vector
radius:  Input radius length

Autodesk.AutoCAD.DatabaseServices.Circle.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Circle.Diameter
Accesses the diameter of the circle.

Autodesk.AutoCAD.DatabaseServices.Circle.Circumference
Accesses the circumference of the circle.

Autodesk.AutoCAD.DatabaseServices.Circle.Normal
Accesses a vector which is at a normal to the center.

Autodesk.AutoCAD.DatabaseServices.Circle.Thickness
Accesses the thickness of the circumference.

Autodesk.AutoCAD.DatabaseServices.Circle.Radius
Accesses the radius of the circle.

Autodesk.AutoCAD.DatabaseServices.Circle.Center
Accesses the center point.