Autodesk.AutoCAD.DatabaseServices.ConcentricConstraint
This class represents a Concentric constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConcentricConstraint.#ctor
Default constructor.