Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord
This .NET class wraps the AcDbViewportTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GetPreviousBackground(Autodesk.AutoCAD.GraphicsInterface.DrawableType)
Returns the viewport's previously set background based on the specified type.
type:  Input type of the preferred previous background object.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SetPreviousBackground(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.GraphicsInterface.DrawableType)
Sets the viewport's previously set background to the specified type based on the objectId value of the object.
value:  Input object ID of the new background.
type:  Input the drawable type

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.ToneOperatorParameters
Accesses the tone operator parameters.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.Number
This is Number, a member of class ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridMajor
Returns the number of minor grid lines between each major grid line in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridFollow
Returns true of the grid will follow a dynamic UCS change in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridSubdivisionRestricted
Returns true if the grid adapts to display more lines that specified in the GRIDUNIT setting.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridAdaptive
Returns true if the grid adapts to display fewer lines in the viewport than specified by the GRIDUNIT setting.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridBoundToLimits
Returns true if the grid is drawn beyond the limits for the WCS and user-defined UCS in the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsSavedWithViewport
Returns the value of UCSVP for the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapIncrements
Returns an Point2d in which the X value represents the X spacing of the snap grid and the Y value represents the Y spacing of the snap grid.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapBase
Returns the snap basepoint (in UCS coordinates) for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapAngle
Returns the snap angle setting (in radians) for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapPair
Returns the snap IsoPair setting for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IsometricSnapEnabled
Returns true if snap mode is currently set to isometric in the ViewportTableRecord; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapEnabled
Returns true if snap mode is currently set on in the ViewportTableRecord; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridIncrements
Returns an Vector2d in which the X value represents the X spacing (in drawing units) of the grid and the Y value represents the Y spacing of the grid.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.GridEnabled
This function returns true if the grid is set on in the ViewportTableRecord; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconAtOrigin
Returns true if the ViewportTableRecord is currently set to have the UCS icon follow the current UCS origin (as long as the origin is far enough within the viewport to allow the icon to display properly).

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconEnabled
Returns true if the ViewportTableRecord is currently set to have the UCS icon display; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.FastZoomsEnabled
This function always returns true.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.CircleSides
Returns the circle zoom percent of the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsFollowMode
Returns true if the ViewportTableRecord is set to generate and display a plan view whenever the UCS changes in the viewport; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UpperRightCorner
Returns an Point2d object containing the upper right corner of the viewport window.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.LowerLeftCorner
Returns an Point2d object containing the lower left corner of the viewport window.