Autodesk.AutoCAD.GraphicsInterface.FontDescriptor
This .NET class wraps certain elements within the AcGiTextStyle ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.#ctor(System.String,System.Boolean,System.Boolean,System.Int32,System.Int32)
Constructs a new FontDescriptor.
typeFace:  Input the font name
bold:  Input true for a bold text
italic:  Input true for an italic text
characters:  Input indicating the character set being used
pitchAndFamily:  Input indicating the pitch and family being used

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.FontDescriptor,Autodesk.AutoCAD.GraphicsInterface.FontDescriptor)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.op_Equality(Autodesk.AutoCAD.GraphicsInterface.FontDescriptor,Autodesk.AutoCAD.GraphicsInterface.FontDescriptor)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.PitchAndFamily
Returns integer indicating the pitch and family being used.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.CharacterSet
Returns integer indicating the character set being used.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.Italic
Returns Boolean indicating italic text.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.Bold
Returns Boolean indicating bold text.

Autodesk.AutoCAD.GraphicsInterface.FontDescriptor.TypeFace
Returns font name.