Autodesk.AutoCAD.DatabaseServices.ObjectSnapInfo
This class represents the output parameters of CustomOsnapInfo.getOsnapInfo() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.ObjectSnapInfo.SnapCurves
Accesses the pre-existing collection to append osnap curves to (may already contain curves).

Autodesk.AutoCAD.DatabaseServices.ObjectSnapInfo.SnapPoints
Accesses the pre-existing snap points.