Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction
This class may be used instead of the transaction class in certain scenarios.

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
This function calls the Open() function of the top transaction passing on all the arguments it has received. Objects can only be obtained within the top transaction, so this function saves the trouble of having to either keep a pointer to the top transaction or use the TransactionManager.TopTransaction property to obtain it.
If the openErased Boolean is true, then even an erased object can be obtained. If openErased is false, then trying to obtain an erased entity results in an error return value.
For more information, see the section on transactions in the ObjectARX Developer's Guide.
id:  Input objectId of object to obtain
mode:  Input mode to obtain in
openErased:  Input Boolean indicating whether to obtain erased objects
forceOpenOnLockedLayer:  Input true if locked layers should be opened

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode,System.Boolean)
This function calls the Open() function of the top transaction passing on all the arguments it has received. Objects can only be obtained within the top transaction, so this function saves the trouble of having to either keep a pointer to the top transaction or use the TransactionManager.TopTransaction property to obtain it.
If the openErased Boolean is true, then even an erased object can be obtained. If openErased is false, then trying to obtain an erased entity results in an error return value.
For more information, see the section on transactions in the ObjectARX Developer's Guide.
id:  Input objectId of object to obtain
mode:  Input mode to obtain in
openErased:  Input Boolean indicating whether to obtain erased objects

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.GetObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.OpenMode)
This function calls the Open() function of the top transaction passing on all the arguments it has received.
id:  Input objectId of object to obtain
mode:  Input mode to obtain in

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.Commit
Commits the changes made in all the DBObjects opened during the OpenCloseTransaction, and then closes them.

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.Abort
Cancels the changes made in all the DBObject opened during the OpenCloseTransaction.

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.AddNewlyCreatedDBObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
obj must point to an object that is newly created (that is, it has never been closed) and is already database resident (that is, it's been added to an Database so it has an objectId).
If add == true, the object pointed to by obj is added to the top transaction. If add == false, then the object is removed from whatever transaction it's within.
obj:  Input object to be added or removed
add:  Input Boolean indicating whether to add or remove the object

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.TransactionManager
Accesses the TransactionManager for the database.