Autodesk.AutoCAD.DatabaseServices.MeshDataCollection
MeshDataCollection is the output of the SubDMesh.GetObjectMesh() method.

Autodesk.AutoCAD.DatabaseServices.MeshDataCollection.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Int32Collection,Autodesk.AutoCAD.Colors.EntityColorCollection,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Constructor.

Autodesk.AutoCAD.DatabaseServices.MeshDataCollection.MaterialIdArray
Accesses the materialIdArray value.

Autodesk.AutoCAD.DatabaseServices.MeshDataCollection.ColorArray
Accesses the colorArray value.

Autodesk.AutoCAD.DatabaseServices.MeshDataCollection.FaceArray
Accesses the faceArray value.

Autodesk.AutoCAD.DatabaseServices.MeshDataCollection.VertexArray
Accesses the vertexArray value.