Autodesk.AutoCAD.DatabaseServices.LoftProfile
This wraps the ObjectARX AcDbLoftProfile class.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.#ctor(Autodesk.AutoCAD.DatabaseServices.LoftProfile)
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile () method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
This wraps the ObjectARXAcDbLoftProfile::AcDbLoftProfile () method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.#ctor(Autodesk.AutoCAD.DatabaseServices.Entity)
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile () method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.#ctor(Autodesk.AutoCAD.DatabaseServices.PathRef)
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile ( const AcDbPathRef& pathRef) method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.#ctor
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile () method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.CopyFrom(Autodesk.AutoCAD.DatabaseServices.Profile3d)
This wraps the ObjectARX AcDbLoftProfile::operator = () method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.CopyFrom(Autodesk.AutoCAD.DatabaseServices.LoftProfile)
This wraps the ObjectARX AcDbLoftProfile::operator = () method.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.Magnitude
This wraps the ObjectARX AcDbLoftProfile::magnitude() and AcDbLoftProfile::setMagnitude() methods.

Autodesk.AutoCAD.DatabaseServices.LoftProfile.Continuity
This wraps the ObjectARX AcDbLoftProfile::continuity() and AcDbLoftProfile::setContinuity() methods.