Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition
This is class Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.AutoCAD.Geometry.DoubleCollection)
This is HatchPatternDefinition, a member of class HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.DashList
This is DashList, a member of class HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.OffsetY
This is OffsetY, a member of class HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.OffsetX
This is OffsetX, a member of class HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.BaseY
This is BaseY, a member of class HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.BaseX
This is BaseX, a member of class HatchPatternDefinition.

Autodesk.AutoCAD.GraphicsInterface.HatchPatternDefinition.Angle
This is Angle, a member of class HatchPatternDefinition.