Autodesk.AutoCAD.Geometry.ExternalSurface
This .NET class wraps the AcGeExternalSurface ObjectARX class.

Autodesk.AutoCAD.Geometry.ExternalSurface.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.ExternalSurface.Set(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Resets the definition of an instance of this class.
surfaceDef:  Input definition of the external bounded surface
surfaceKind:  Input information about the system in which the surface definition was created

Autodesk.AutoCAD.Geometry.ExternalSurface.SetToOwnSurface
Forces this instance to own its definition data.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsOwnerOfSurface
Determines whether this instance owns its definition data.

Autodesk.AutoCAD.Geometry.ExternalSurface.nativeSurface
Allows the caller to obtain native gelib representations for an instance of external surface.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsNativeSurface
Allows the caller to obtain native gelib representations for an instance of external surface.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsDefined
Determines whether the instance is empty.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsNurbSurface
Determines whether the external surface instance can be represented by a surface definition that is native to gelib.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsTorus
Returns true if the external surface is a torus, else false.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsCone
Returns true if the external surface is a cone, else false.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsCylinder
Returns true if the external surface is a cylinder, else false.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsSphere
Returns true if the external surface is a sphere, else false.

Autodesk.AutoCAD.Geometry.ExternalSurface.IsPlane
Determines whether the external surface instance can be represented by a surface definition that is native to gelib.

Autodesk.AutoCAD.Geometry.ExternalSurface.ExternalSurfaceKind
Provides information concerning the native system in which the external bounded surface definition was created.

Autodesk.AutoCAD.Geometry.ExternalSurface.ExternalSurfaceDefiniton
Returns the pointer to the external bounded surface definition.