Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent
This class gives the diffuse component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.#ctor(Autodesk.AutoCAD.GraphicsInterface.MaterialColor,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)
This constructor initializes the component's values.
color:  Input material color
map:  Input material map

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.Map
Returns the diffuse component map.

Autodesk.AutoCAD.GraphicsInterface.MaterialDiffuseComponent.Color
Returns the current diffuse color value.