Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary
This .NET class wraps the AcDbDictionaryWithDefault ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.ObjectBirthVersion
Accesses the DwgVersion and MaintenanceReleaseVersion in effect when the DictionaryWithDefault object's class was first introduced.

Autodesk.AutoCAD.DatabaseServices.DictionaryWithDefaultDictionary.DefaultId
Accesses the object ID that is the default entry for the dictionary.