Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection
This class provides a container for Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty objects.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferenceProperty[],System.Int32)
Copies objects in array to this collection, starting from index.
array:  Input array to copy from
index:  Input zero-based index to start at

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.DynamicBlockReferencePropertyCollection.Count
Accesses the number of objects in this collection.