Autodesk.AutoCAD.DatabaseServices.PointCloud
This is class Autodesk.AutoCAD.DatabaseServices.PointCloud.

Autodesk.AutoCAD.DatabaseServices.PointCloud.#ctor
This is PointCloud, a member of class PointCloud.

Autodesk.AutoCAD.DatabaseServices.PointCloud.RegenPointClouds
This is RegenPointClouds, a member of class PointCloud.