Autodesk.AutoCAD.DatabaseServices.FormattedTableData
This .NET class wraps the AcDbFormattedTableData ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.IsFormatEditable(System.Int32,System.Int32)
This function checks the cell state to determine if a cell format can be modified.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetRotation(System.Int32,System.Int32)
Returns the rotation angle of the first content in radians.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetRotation(System.Int32,System.Int32,System.Double)
Sets the rotation angle of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input angle in radians

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetScale(System.Int32,System.Int32)
Returns the scale of the first content in radians.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetScale(System.Int32,System.Int32,System.Double)
Sets the scale of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input scale

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetAlignment(System.Int32,System.Int32)
Returns the alignment of the first content in radians.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetAlignment(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellAlignment)
Sets the alignment of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input alignment

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetContentColor(System.Int32,System.Int32)
Returns the color of the first content in radians.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetContentColor(System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Sets the color of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input color

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetBackgroundColor(System.Int32,System.Int32)
Returns the background color of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetBackgroundColor(System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Sets the background color of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
value:  Input color to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetTextStyle(System.Int32,System.Int32)
Returns the text style of the first content in radians.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetTextStyle(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the text style of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input text style

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetTextHeight(System.Int32,System.Int32)
Returns the text height of the first content in radians.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetTextHeight(System.Int32,System.Int32,System.Double)
Sets the text height of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
value:  Input text height

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetMargin(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellMargins)
Returns the margin of cell, row, or column.
column:  Input column index. This can be -1. See remarks.
margin:  Input margin type to get

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetMargin(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellMargins,System.Double)
Sets the margin of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
margin:  Input margin type to set. Multiple margin types can be combined using OR.
value:  Input margin value to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetGridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the grid color of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetGridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.Colors.Color)
Sets the grid color of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line types. Multiple grid line types can be combined using OR.
value:  Input grid color to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetGridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the grid line weight of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetGridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.LineWeight)
Sets the grid line weight of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line types. Multiple grid line types can be combined using OR.
value:  Input grid line weight to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetGridLinetype(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the grid line type of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetGridLinetype(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the grid line type of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line types. Multiple grid line types can be combined using OR.
value:  Input grid line type to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetGridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the grid visibility of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetGridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.Visibility)
Sets the grid visibility of cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line types. Multiple grid line types can be combined using OR.
value:  Input grid visibility to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetOverride(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the override in specified grid line type in cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
gridLinetype:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetOverride(System.Int32,System.Int32,System.Int32)
Returns the override of cell, row, column, or content.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
content:  Input content index. This can be -1. See remarks.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetOverride(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.GridProperties)
Sets the override in specified grid line type in cell, row, or column.
row:  Input row index. This can be -1. See remarks
column:  Input column index. This can be -1. See

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.SetOverride(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellProperties)
Sets the override in cell, row, column, or content.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.
content:  Input content index. This can be -1. See remarks.
cellProperty:  Input override to set

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.RemoveAllOverrides(System.Int32,System.Int32)
Removes all the overrides in cell, row, or column.
row:  Input row index. This can be -1. See remarks.
column:  Input column index. This can be -1. See remarks.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.Merge(Autodesk.AutoCAD.DatabaseServices.CellRange)
Merges the cells in the range.
range:  Input cell range to merge

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.Unmerge(Autodesk.AutoCAD.DatabaseServices.CellRange)
Unmerges the cells in the range.
range:  Input cell range to unmerge

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.IsMerged(System.Int32,System.Int32)
Returns true if the specified cell is part of a merge range; false if not.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.FormattedTableData.GetMergeRange(System.Int32,System.Int32)
Returns merge range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.