Autodesk.AutoCAD.DatabaseServices.AssocActionParam
Abstract base class for all derived AcDbAssocXxxActionParam classes.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.#ctor
This wraps the ObjectARX AcDbAssocActionParam::AcDbAssocActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.MakeParamEmpty(System.Boolean)
This wraps the ObjectARX AcDbAssocActionParam::makeParamEmpty(bool alsoEraseOwnedObjects) method.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.MakeParamConstant
This wraps the ObjectARX AcDbAssocActionParam::makeParamConstant() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.DetachDependencies
This wraps the ObjectARX AcDbAssocActionParam::detachDependencies() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.TransformConstantGeometry(Autodesk.AutoCAD.Geometry.Matrix3d)
This wraps the ObjectARX AcDbAssocActionParam::transformConstantGeometry(const AcGeMatrix3d&) method.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.GetDependencies(System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocActionParam::getDependencies() method.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.Name
This wraps the ObjectARX AcDbAssocActionParam::name() and AcDbAssocActionParam::setName() methods.

Autodesk.AutoCAD.DatabaseServices.AssocActionParam.ParentAction
This wraps the ObjectARX AcDbAssocActionParam::parentAction() method.