Autodesk.AutoCAD.Geometry.SplineEntity2d
This .NET class wraps the AcGeSplineEnt2d ObjectARX class.

Autodesk.AutoCAD.Geometry.SplineEntity2d.GetContinuityAtKnot(System.Int32)
Returns the degree of the highest derivative that is continuous at a knot.
index:  Input knot index

Autodesk.AutoCAD.Geometry.SplineEntity2d.GetContinuityAtKnot(System.Int32,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the degree of the highest derivative that is continuous at a knot.
index:  Input knot index
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.SplineEntity2d.GetKnotAt(System.Int32)
Returns a knot value from the spline's knot vector.
index:  Input index of a knot

Autodesk.AutoCAD.Geometry.SplineEntity2d.SetKnotAt(System.Int32,System.Double)
Resets the value of a knot at a given index.
index:  Input index of knot
value:  Input value of knot

Autodesk.AutoCAD.Geometry.SplineEntity2d.GetControlPointAt(System.Int32)
Returns a control point from the array of the spline's control points.
index:  Input index of a control point

Autodesk.AutoCAD.Geometry.SplineEntity2d.SetControlPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Resets a control point from the spline's control array.
index:  Input index of a control point in the control array
point:  Input value of the point

Autodesk.AutoCAD.Geometry.SplineEntity2d.HasFitData
Returns true if the spline is constructed by using any interpolating fit data.

Autodesk.AutoCAD.Geometry.SplineEntity2d.EndPoint
Returns the point on the spline at the maximal parametric value.

Autodesk.AutoCAD.Geometry.SplineEntity2d.StartPoint
Returns the point on the curve at the minimal parameter value.

Autodesk.AutoCAD.Geometry.SplineEntity2d.EndParameter
Returns the maximal parameter on the spline.

Autodesk.AutoCAD.Geometry.SplineEntity2d.StartParameter
Returns the minimal parameter on the curve.

Autodesk.AutoCAD.Geometry.SplineEntity2d.NumControlPoints
Returns the number of control points in the control array.

Autodesk.AutoCAD.Geometry.SplineEntity2d.Knots
Return the spline's knot vector.

Autodesk.AutoCAD.Geometry.SplineEntity2d.NumKnots
Returns the number of knots in the knot vector.

Autodesk.AutoCAD.Geometry.SplineEntity2d.Order
Returns spline's order.

Autodesk.AutoCAD.Geometry.SplineEntity2d.Degree
Returns the degree of spline.

Autodesk.AutoCAD.Geometry.SplineEntity2d.IsRational
Returns a flag indicating if the spline is a polynomial or rational.