Autodesk.AutoCAD.DatabaseServices.BlockTableRecord
This .NET class wraps the AcDbBlockTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetEnumerator
Returns an enumerator that iterates through the collection.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetBlockReferenceIds(System.Boolean,System.Boolean)
Returns a list of BlockReferences that either directly or indirectly, through block nesting, reference this block. It only returns those block references that are currently active. Use getErasedBlockReferenceIds() to get a list of erased references.
directOnly:  Input an indication that only those BlockReferences that directly refer to this BlockTableRecord should be included in the IDs. If this value is true and the block is nested, the parent block's references will not be included.
forceValidity:  Input an indication that older drawings which have been demand loaded should be loaded completely, in order to find their BlockReferenceIds. This is because older drawings did not store this information. This parameter is only applicable if directOnly is false.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetErasedBlockReferenceIds
Returns a list of BlockReferences that directly reference this block.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetAnonymousBlockIds
Retrieves a collection populated with the ObjectIds of the anonymous blocks created from the dynamic block definition.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetXrefDatabase(System.Boolean)
Returns the database that defines this block table record’s contents. If incrementUnresolved is true, then a database will be returned, even if the xref block table record is currently unresolved (for reasons other than that the xref drawing file could not be found).
incrementUnresolved:  Input an indication whether or not to return the database of an unresolved xref

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockInsertionPoints
This event occurs during the insertion of a block for which an application has defined custom insertion points.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.AssumeOwnershipOf(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Causes the invoked block table record to assume the ownership of all the entities listed in the input entitiesToMove collection, and provides an optimized way of moving entities between block table records.
entitiesToMove:  Input a collection of entities to change ownership of

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.UpdateAnonymousBlocks
Updates the anonymous blocks created from this dynamic block definition to reflect any changes made to the dynamic block definition.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Hyperlinks
Accesses a collection of hyperlinks associated with the BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IncludingErased
Returns the IncludingErased property value.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Units
Accesses the units value.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsDynamicBlock
Returns true if the block table record is a dynamic block.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockScaling
Specifies whether block references associated with this block table record can be uniformly or non-uniformly scaled.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Explodable
Specifies whether block references associated with this block table record can be exploded.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.DrawOrderTableId
Returns the DrawOrderTable object ID.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.XrefStatus
Retrieves the xref status of the block table record on which this method is called.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsUnloaded
Returns true if this block table record is an xref that is currently unloaded.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.LayoutId
Accesses the layout ID.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsLayout
Returns true if this block table record represents a layout.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsFromOverlayReference
Gets and sets the BlockTableRecord's overlay flag.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsFromExternalReference
Returns true if the block table record is describing an xref drawing.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.IsAnonymous
Returns true if the block table record is anonymous.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.PreviewIcon
Accesses the preview icon.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.HasPreviewIcon
Returns true if the block table record has a preview icon.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.HasAttributeDefinitions
Returns true if the block table record contains attribute definitions.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockEndId
Returns the the block end opened openMode.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.BlockBeginId
Returns the the block begin opened openMode.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Origin
Accesses the insertion point of the block table record in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.PathName
Accesses the path and name of the xref drawing.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.Comments
Accesses the description text associated with the BlockTableRecord.