Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry
This class represents a constrained geometry node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.CommonConstraints(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry)
Returns the array of references to GeometricalConstraint objects between this constrained geometry and the other constrained geometry otherConsGeom.
otherConsGeom:  The reference to the other ConstrainedGeometry object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.FullSubentityPaths
Gets the array of FullSubentPaths of the subentities of the AutoCAD Entities that correspond to this constrained geometry.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.ConnectedGeometries
Gets the array of references to ConstrainedGeometry objects to which this constrained geometry is indirectly connected through the common constraints.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.ConnectedConstraints
Gets the the array of references to GeometricalConstraint objects which reference this constrained geometry.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.OwningRigidSet
Gets the reference to the owning ConstrainedRigidSet object which this constrained geometry belongs to.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.GeomDependencyId
Gets the ObjectId of the AssocGeomDependency object referenced by this constrained geometry.

Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry.IsReadOnly
Indicates whether this constrained geometry is read-only -- cannot be modified or transformed, in other words, it is fixed.