Autodesk.AutoCAD.DatabaseServices.MeshPointMaps
This class acts as a wrapper for a GeoMesh.

Autodesk.AutoCAD.DatabaseServices.MeshPointMaps.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructor sets the default values.
sourcePts:  Input source points collection
destPts:  Input destination points collection

Autodesk.AutoCAD.DatabaseServices.MeshPointMaps.DestPonints
Accesses the destination points collection.

Autodesk.AutoCAD.DatabaseServices.MeshPointMaps.SourcePonints
Accesses the source points collection.