Autodesk.AutoCAD.DatabaseServices.SymbolTable
This .NET class wraps the AcDbSymbolTable ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.Has(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function returns true if the table contains a record with an ObjectId that matches id.
id:  Input object ID of record to search for

Autodesk.AutoCAD.DatabaseServices.SymbolTable.Has(System.String)
This function returns true if the table contains a record with a name that matches key.
key:  Input name of record to search for

Autodesk.AutoCAD.DatabaseServices.SymbolTable.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.SymbolTable.IncludingErased
Returns erased SymbolTable entries in addition to any entries already present.