Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties
This class is a container for the GraphicsSystem.View.ViewportBorderProperties properties.

Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties.#ctor(System.Drawing.Color,System.Int32)
Constructor.
color:  Input default color
weight:  Input default weight

Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties.Weight
Returns the weight of viewport border.

Autodesk.AutoCAD.GraphicsSystem.ViewportBorderProperties.Color
Returns the color of viewport border.