Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph
This .NET class wraps the AcDbObjectIdGraph ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph.AddNode(Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode)
This function will add the ObjectIdGraphNode nodeToAdd to the graph.
nodeToAdd:  Input ObjectIdGraphNode to add to the graph.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph.DelNode(Autodesk.AutoCAD.DatabaseServices.ObjectIdGraphNode)
Removes the ObjectIdGraphNode nodeToDelete from the graph, and the AcDbObjectIdGraph wrapped by this ObjectIdGraph deletes the AcDbObjectIdGraphNode wrapped by nodeToDelete.
nodeToAdd:  Input ObjectIdGraphNode to remove from the graph.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph.FindNode(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Finds the ObjectIdGraphNode that contains the ObjectId id and returns that ObjectIdGraphNode or null if no node with that id is found in the graph.
id:  Input ObjectId for node to find.

Autodesk.AutoCAD.DatabaseServices.ObjectIdGraph.IdNode(System.Int32)
Returns the ObjectIdGraphNode at index in the ObjectIdGraph, or null if that index is not valid.
index:  Input zero based index of the node to get.