Autodesk.AutoCAD.DatabaseServices.Rectangle3d
This .NET class loosely wraps the CRectangle3d ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a new rectangle.
upperLeft:  Input upper left point
upperRight:  Input upper right point
lowerLeft:  Input lower left point
lowerRight:  Input lower right point

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.LowerRight
Accesses the lower right point.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.LowerLeft
Accesses the lower left point.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.UpperRight
Accesses the upper right point.

Autodesk.AutoCAD.DatabaseServices.Rectangle3d.UpperLeft
Accesses the upper left point.