Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker
The GeoPositionMarker class represents a Geographical location aware marker object with label.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double)
This is GeoPositionMarker, a member of class GeoPositionMarker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.#ctor
This is GeoPositionMarker, a member of class GeoPositionMarker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.TextStyle
This is TextStyle, a member of class GeoPositionMarker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.Normal
This is Normal, a member of class GeoPositionMarker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.GeoPosition
The Geographical location of the position marker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.Notes
Notes of the position marker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.TextAlignmentType
label text alignment type.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.EnableFrameText
Label text frame enabling.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.MTextVisible
The visibility of the MText label.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.MText
The position marker MText label.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.Text
The position marker text label.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.LandingGap
landing gap of the position marker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.Radius
Radius of the position marker.

Autodesk.AutoCAD.DatabaseServices.GeoPositionMarker.Position
The Insertion point of the position marker.