Autodesk.AutoCAD.DatabaseServices.UnderlayHost
This .NET class wraps the AcDbUnderlayHost ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.GetFile(System.String,System.String)
Gets an underlay file.
path:  Input fully qualified path to the file to open
password:  Input optional password

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.PdfHost
Accesses the current UnderlayHost for managing PDF underlays.

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.DgnDocHost
Returns the current DGN underlay host that uses the current document for OLE entities.

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.DgnHost
Reserved for future use.

Autodesk.AutoCAD.DatabaseServices.UnderlayHost.DwfHost
Returns the current DWF underlay host.