Autodesk.AutoCAD.DatabaseServices.PolygonMesh
This .NET class wraps the AcDbPolygonMesh ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeMClosed
This function sets the PolygonMesh to be closed in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeMOpen
This function sets the PolygonMesh to be open in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeNClosed
This function sets the PolygonMesh to be closed in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MakeNOpen
This function sets the PolygonMesh to be open in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.Straighten
This function removes all spline-fit vertices and restores the original control point polygon mesh.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.SurfaceFit
This function will fit a smooth surface to a control point mesh defined by vertices of this polygonal mesh.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex)
This function appends the PolygonMeshVertex object pointed to by toAppend to the vertex list of the PolygonMesh, establishes the PolygonMesh as the vertex's owner, and adds the vertex to the database that contains the PolygonMesh (the PolygonMesh must be database-resident for this function to succeed).
toAppend:  Input vertex to append to mesh

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.NSurfaceDensity
Accesses the surface density in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MSurfaceDensity
Accesses the surface density in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.IsNClosed
Assesses if the PolygonMesh is closed in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.IsMClosed
Assesses if the PolygonMesh is closed in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.NSize
Accesses the vertex count in the N direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.MSize
Accesses the vertex count in the M direction.

Autodesk.AutoCAD.DatabaseServices.PolygonMesh.PolyMeshType
Accesses the PolyMeshType of the PolygonMesh.