Autodesk.AutoCAD.Geometry.Matrix3d
This .Net class wraps AcGeMatrix3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Matrix3d.#ctor(System.Double[])
This constructor creates a 3D matrix based on values in an array.
data:  Input matrix array

Autodesk.AutoCAD.Geometry.Matrix3d.PreMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets this matrix to the product leftSide * (this matrix).
leftSide:  Input left side of matrix

Autodesk.AutoCAD.Geometry.Matrix3d.PostMultiplyBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets this matrix to the product (this matrix) * rightSide.
rightSide:  Input right side of matrix

Autodesk.AutoCAD.Geometry.Matrix3d.Inverse
Returns inverse matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.IsSingular
This method calls Matrix3d.IsSingular(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Matrix3d.IsSingular(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if either of the vectors e0, e1, e2 returned by the function getCoordSystem(origin,e0, e1, e2) has zero length or these vectors are parallel.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Matrix3d.Transpose
Returns the matrix that is the result of transposition of this matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix3d)
This method calls Matrix3d.IsEqualTo(Matrix3d mat, Tolerance tolerance) with tolerance set to Global.
mat:  Input matrix to compare against

Autodesk.AutoCAD.Geometry.Matrix3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if each column of this matrix is equal to the corresponding column of the matrix mat as vectors.
mat:  Input matrix to compare against
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Matrix3d.IsUniscaledOrtho
This method calls Matrix3d.IsUniscaledOrtho(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Matrix3d.IsUniscaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors and these two vectors have equal length.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Matrix3d.IsScaledOrtho
This method calls Matrix3d.IsScaledOrtho(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Matrix3d.IsScaledOrtho(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the columns of the linear part of this matrix are perpendicular to each other as 3D vectors.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Matrix3d.GetDeterminant
Gets the determinant of the matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.Displacement(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the displacement vector.
vector:  Input vector to calculate displacement from

Autodesk.AutoCAD.Geometry.Matrix3d.Rotation(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of the rotation by angle angle around the axis with vector axis passing through the point center.
angle:  Input angle of rotation
axis:  Input axis of rotation
center:  Input origin point of rotation

Autodesk.AutoCAD.Geometry.Matrix3d.Scaling(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of uniform scaling by scale factor scaleAll with respect to the point center.
scaleAll:  Input scale factor
center:  Input origin point of the scale

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Point3d)
Returns the matrix of mirroring with respect to pointValue.
pointValue:  Input point of symmetry

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Plane)
Returns the matrix of mirroring with respect to plane.
plane:  Input mirror plane

Autodesk.AutoCAD.Geometry.Matrix3d.Mirroring(Autodesk.AutoCAD.Geometry.Line3d)
Returns the matrix of mirroring with respect to line.
line:  Input line of symmetry

Autodesk.AutoCAD.Geometry.Matrix3d.WorldToPlane(Autodesk.AutoCAD.Geometry.Vector3d)
Creates a transformation matrix to transform points from WCS to plane coordinate system.
normal:  Input normal vector to the plane

Autodesk.AutoCAD.Geometry.Matrix3d.WorldToPlane(Autodesk.AutoCAD.Geometry.Plane)
Creates a transformation matrix to transform points from WCS to plane coordinate system.
plane:  Input transformation plane.

Autodesk.AutoCAD.Geometry.Matrix3d.PlaneToWorld(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix transformation from plane to world coordinates, using the normal to the plane.
normal:  Input normal to the plane for transformation

Autodesk.AutoCAD.Geometry.Matrix3d.PlaneToWorld(Autodesk.AutoCAD.Geometry.Plane)
Returns the matrix transformation from plane to world coordinates.
plane:  Input transformation plane

Autodesk.AutoCAD.Geometry.Matrix3d.Projection(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the matrix of the parallel projection into the plane projectionPlane.
projectionPlane:  Input projection plane
projectDir:  Input projection direction

Autodesk.AutoCAD.Geometry.Matrix3d.AlignCoordinateSystem(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns matrix that maps coordinate system with the origin fromOrigin and the axes fromXAxis, fromYAxis, and fromZAxis to coordinate system with the origin toOrigin and the axes toXAxis, toYAxis, and toZAxis.
fromOrigin:  Input origin point of the from coordinate system
fromXAxis:  Input vector defining the x axis of the from coordinate system
fromYAxis:  Input vector defining the y axis of the from coordinate system
fromZAxis:  Input vector defining the z axis of the from coordinate system
toOrigin:  Input origin point of the to coordinate system
toXAxis:  Input vector defining the x axis of the to coordinate system
toYAxis:  Input vector defining the y axis of the to coordinate system
toZAxis:  Input vector defining the z axis of the to coordinate system

Autodesk.AutoCAD.Geometry.Matrix3d.GetScale
Returns scale factor of matrix.

Autodesk.AutoCAD.Geometry.Matrix3d.IsInverse(Autodesk.AutoCAD.Geometry.Matrix3d)
This method calls Matrix3d.IsInverse(Matrix3d inv, Tolerance tolerance) with tolerance set to Global.
inv:  Input inverse matrix

Autodesk.AutoCAD.Geometry.Matrix3d.IsInverse(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the matrix is an inverse matrix.
inv:  Input inverse matrix
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Matrix3d.Equals(System.Object)
Returns true if this matrix is equal to the corresponding column of the object matrix.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Matrix3d.op_Inequality(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Matrix3d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix3d.op_Equality(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Matrix3d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Matrix3d)
Returns matrices a times b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Matrix3d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Matrix3d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
format:  Input format
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Matrix3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Matrix3d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Matrix3d.ToArray
This method returns this matrix as a 1-dimensional array containing 16 elements of type System.Double.

Autodesk.AutoCAD.Geometry.Matrix3d.Normal
Takes the absolute value of each element of the upper 3x3 of the matrix and returns the absolute value of the largest such element.

Autodesk.AutoCAD.Geometry.Matrix3d.CoordinateSystem3d
Returns this matrix to the matrix which maps the standard coordinate system with the origin (0, 0, 0) and axes (1, 0, 0), (0, 1, 0) and (0, 0, 1) to the coordinate system with the origin origin and axes xAxis, yAxis, and zAxis.

Autodesk.AutoCAD.Geometry.Matrix3d.Translation
Returns the matrix of the translation by the vector that defines the translation.

Autodesk.AutoCAD.Geometry.Matrix3d.Identity
Returns the reference to identity matrix.