Autodesk.AutoCAD.DatabaseServices.XrefBeginOperationEventArgs
This class provides data for the XrefBeginRestore, XrefBeginAttached and XrefBeginOtherAttached events of the database.

Autodesk.AutoCAD.DatabaseServices.XrefBeginOperationEventArgs.FileName
Gets the name of the file being xrefed.

Autodesk.AutoCAD.DatabaseServices.XrefBeginOperationEventArgs.From
Gets the database being xref.