Autodesk.AutoCAD.Geometry.Curve2dCollection
This class represents a collection of Curve2d objects.

Autodesk.AutoCAD.Geometry.Curve2dCollection.#ctor
Constructor.

Autodesk.AutoCAD.Geometry.Curve2dCollection.GetEnumerator
Returns an enumerator for this collection.

Autodesk.AutoCAD.Geometry.Curve2dCollection.RemoveAt(System.Int32)
This function removes the item at the given index if one exists.
index:  Input index of object to remove

Autodesk.AutoCAD.Geometry.Curve2dCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Geometry.Curve2dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Curve2d[],System.Int32)
Copies the elements of this collection into the provided array starting at the given index.
array:  Input array to copy to
index:  Input index to begin copying at

Autodesk.AutoCAD.Geometry.Curve2dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Curve2d)
Inserts value in to the collection, at the index specified by index.
index:  Input index to insert at
value:  Input value to insert

Autodesk.AutoCAD.Geometry.Curve2dCollection.Remove(Autodesk.AutoCAD.Geometry.Curve2d)
This function removes value from the collection if it exists.
value:  Input object to remove

Autodesk.AutoCAD.Geometry.Curve2dCollection.Contains(Autodesk.AutoCAD.Geometry.Curve2d)
Returns a Boolean indicating whether value is contained in this collection.
value:  Input object to check for.

Autodesk.AutoCAD.Geometry.Curve2dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Curve2d)
Finds the index of an item in the collection.
value:  Input object to get the index of

Autodesk.AutoCAD.Geometry.Curve2dCollection.Add(Autodesk.AutoCAD.Geometry.Curve2d)
Adds a curve to this collection.
value:  Input curve to add

Autodesk.AutoCAD.Geometry.Curve2dCollection.IsReadOnly
Returns true if Curve2dCollection is read-only; otherwise false.

Autodesk.AutoCAD.Geometry.Curve2dCollection.IsFixedSize
Returns true if Curve2dCollection has fixed size; otherwise false.

Autodesk.AutoCAD.Geometry.Curve2dCollection.Count
Returns the number of objects in this collection.