Autodesk.AutoCAD.DatabaseServices.Handle
This .NET class wraps the AcDbHandle ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Handle.#ctor(System.Int64)
Constructs a handle using the input the 64 bit handle value.
value:  Input all 64 bits of the handle

Autodesk.AutoCAD.DatabaseServices.Handle.op_Inequality(Autodesk.AutoCAD.DatabaseServices.Handle,Autodesk.AutoCAD.DatabaseServices.Handle)
Returns true if a is not equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.Handle.op_Equality(Autodesk.AutoCAD.DatabaseServices.Handle,Autodesk.AutoCAD.DatabaseServices.Handle)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.Handle.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to compare

Autodesk.AutoCAD.DatabaseServices.Handle.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.Handle.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.DatabaseServices.Handle.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.Handle.IsOne
Assesses true if the handle value in this object is 1.

Autodesk.AutoCAD.DatabaseServices.Handle.Value
Accesses the value of the handle.