Autodesk.AutoCAD.DatabaseServices.AssocAction
Any object that wants to exhibit associative behavior, i.e.

Autodesk.AutoCAD.DatabaseServices.AssocAction.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetActionBody(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the AcDbAssocAction::actionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocAction.SetStatus(Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean,System.Boolean)
Sets the AssocStatus of the action. If the status is one of the codes that indicate that the action will need to be evaluated (the IsEvaluationRequest() predicate returns true for such a status), but the current status of the action is not that it would need to be evaluated, it propagates this status up to the AssocNetwork owning the action, and higher in the network hierarchy to the network owning this network, etc, so that all owning networks know that they contain an action that needs to be evaluated.
If the new status IsEvaluationRequest() and EvaluationRequestSeverityLevel() of the new status is lower than the current evaluation request status of the action, the current higher status of the action is kept and not overwritten by the new lower status. Also, if the current status of the action IsToBeSkipped(), it is not overwritten by any new status that IsEvaluationRequest(). To change the action status in such a case, the action status needs to be first changed to IsUpToDateAssocStatus, and after that it can be changed to an IsEvaluationRequest() status.
newStatus:  The new AssocStatus of the action.
notifyOwningNetwork:  If true, and the passed-in status indicates that the action needs to be evaluated, the status of the AssocNetwork owning this dependency is set to the same status (unless the network evaluation status is already more severe than the new one).
setInOwnedActions:  If true, and this action owns some other actions (such as AssocNetwork owns actions), the status is also set in all owned actions (both directly owned and recursively owned).

Autodesk.AutoCAD.DatabaseServices.AssocAction.SetOwningNetwork(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Every action except for the topmost AssocNetwork is logically owned by a single AssocNetwork.
This network may also be the "physical" database owner of the action (the network has hard-ownership id of the action), but the "physical" owner may also be some other object. For example, for networks attached to BlockTableRecords, the "logical" owner is the top-level network of the whole database but the "physical" database owner is the subdictionary of the extension dictionary of the AcBdBlockTableRecord.
This method should not be called directly, AssocNetwork.AddAction and AssocNetwork.RemoveAction() should be used, which in turn calls setOwningNetwork().
networkId:  The AssocNetwork logically owning this action.
alsoSetAsDatabaseOwner:  Make the network the database owner of this action.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetDependencies(System.Boolean,System.Boolean)
Gets AssocDependencies of this action. The default implementation obtains all dependencies owned by the base action class and selects the ones based on the required read/write type.
If the action owns an AssocActionBody object that overrides the getDependenciesOverride() method, this method is called and it supersedes the default implementation. It allows the custom action body classes to control which dependencies to return and which not to mention.
readDependenciesWanted:  Read-type dependencies wanted.
writeDependenciesWanted:  Write-type dependencies wanted.

Autodesk.AutoCAD.DatabaseServices.AssocAction.AddDependency(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Adds the given AssocDependency to this action. The dependency may either become owned by this action (if setThisActionAsOwningAction is true) which is the most common case, or just referenced by this action.
dependencyId:  ObjectId of the AssocDependency being added to this action.
setThisActionAsOwningAction:  If true, sets this action to be the database owner of the dependency. In this case the dependency must not be already owned by any other action.

Autodesk.AutoCAD.DatabaseServices.AssocAction.RemoveDependency(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Removes the given AssocDependency from this action.
dependencyId:  ObjectId of the AssocDependency being removed from this action.
alsoEraseIt:  Erases the dependency after removing it.

Autodesk.AutoCAD.DatabaseServices.AssocAction.RemoveAllDependencies(System.Boolean)
Removes all AssocDependencies kept in the vector of dependencies of this action and optionally also erases them.
If the action owns an AssocActionBody object that overrides the RemoveAllDependenciesOverride() method, this method is called to notify about the dependencies being removed. This happens after all the dependencies have already been removed.
alsoEraseThem:  Erase the AssocDependencies after removing them.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetDependentObjects(System.Boolean,System.Boolean)
Gets objects that this action depends on or modifies. The default implementation collects all objects on which the action has AssocDependencies.
If the action owns an AssocActionBody object that overrides the GetDependentObjectsOverride() method, this method is called and it supersedes the default implementation. It allows the custom action body classes to control which objects to return and which not to mention, but usually there is no need to override this method, the default implementation that traverses all the dependencies of the action should suffice.
readDependenciesWanted:  Dependent-on objects wanted.
writeDependenciesWanted:  Modified objects wanted.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsOwnedDependency(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Checks whether the given AssocDependency is owned by this action, either directly, or if this action is a network, is owned by an action owned by the network.
dependency:  The dependency that is checked whether it is owned by this action. Needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsExternalDependency(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Checks whether the given AssocDependency, owned by this action, is external to this action, i.e., it depends on an DBObject that is not this action and is not owned by this action (when the action is a network).
dependency:  The dependency that is checked whether it is external. Needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsRelevantDependencyChange(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.IsRelevantChange() predicate.
dependency:  The dependency that is checked whether the change in the object it depends on is relevant or not. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.HasDependencyCachedValue(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.HasCachedValue() predicate.
dependency:  The dependency that is checked whether it has cached value. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.AreDependenciesOnTheSameThing(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.IsDependentOnTheSameThingAs() predicate.
dependency1:  The dependency owned by this action. It needs to be open at least for read.
dependency2:  Another dependency. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.AreDependenciesEqual(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from he owned dependency's AssocDependency.isEqualTo() predicate.
dependency1:  The dependency owned by this action. It needs to be open at least for read.
dependency2:  Another dependency. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetActionsDependentOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean,System.Boolean,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This wraps the AcDbAssocAction::getActionsDependentOnObject() method.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetActionsDependentOnObject(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean,System.Boolean)
A static method to get all actions depending on the given DBObject (these actions have AssocDependencies on this object).
dbObj:  The DBObject whose actions are requested. The object needs to be open at least for read.
readDependenciesWanted:  Actions that depend-on the object wanted.
writeDependenciesWanted:  Actions that modify the object wanted.

Autodesk.AutoCAD.DatabaseServices.AssocAction.DependentObjectCloned(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the owned dependency's AssocDependency.copied() persistent reactor callback.
dependency:  The AssocDependency on the DBObject that has been cloned.
dbObj:  The original object.
newObj:  The newly created clone.

Autodesk.AutoCAD.DatabaseServices.AssocAction.AddMoreObjectsToDeepClone(Autodesk.AutoCAD.DatabaseServices.IdMapping,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Called just before the end of the main deep-cloning loop (before AcRxEventReactor::beginDeepCloneXlation() reactor notification), when the objects have already been cloned but their ids haven't been translated yet.
idMap:  The IdMapping of the current deep cloning session.
additionalObjectsToClone:  Additional objects that the action also wants to deep clone. It is legal to add objects that have already been cloned; they will be ignored and not cloned again.

Autodesk.AutoCAD.DatabaseServices.AssocAction.PostProcessAfterDeepClone(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from a reactor notification method (ids of the clones have already been translated) to inform the source actions that they have been cloned, so that they can update the clones or do some other work that it needed.
idMap:  The IdMapping of the current deep cloning session.

Autodesk.AutoCAD.DatabaseServices.AssocAction.PostProcessAfterDeepCloneCancel(Autodesk.AutoCAD.DatabaseServices.IdMapping)
Called from a reactor notification method.
idMap:  The IdMapping of the current deep cloning session.

Autodesk.AutoCAD.DatabaseServices.AssocAction.EvaluateDependencies
This method needs to be called from the client code evaluateOverride() method, usually after the client code inspected the dependencies, found which changed, which were on erased objects, etc.

Autodesk.AutoCAD.DatabaseServices.AssocAction.EvaluateDependency(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Delegated from the owned dependency's AssocDependency.evaluateOverride() method.
dependency:  The dependency that is to be evaluated. It needs to be open at least for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.OwnedDependencyStatusChanged(Autodesk.AutoCAD.DatabaseServices.AssocDependency,Autodesk.AutoCAD.DatabaseServices.AssocStatus)
This callback is called from AssocDependency.SetStatus(..., true) and notifies the action owning the dependency that the status of the dependency has just been changed.
ownedDependency:  The dependency whose status has just been changed.
previousStatus:  Previous status of the dependency.

Autodesk.AutoCAD.DatabaseServices.AssocAction.TransformActionBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Notifes the action that the owner of the action was transformed, such as that all entities in the BlockTableRecord owning the network that owns the action were transformed.
transform:  The provided transformation matrix.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.AssocAction)
Compares this action with the given action and returns true if and only if they are equal (whatever it means).
otherAction:  The other action needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocAction.EvaluationPriority
This method provides default implementation suitable for most circumstances, but actions may override it to define their special behavior.

Autodesk.AutoCAD.DatabaseServices.AssocAction.GetDependentActionsToEvaluate(Autodesk.AutoCAD.DatabaseServices.ActionsToEvaluateCallback)
Lets the action report all other actions that need to be evaluated because this action is evaluated.
actionsToEvaluateCallback:  The method uses this callback to report other AssocActions, AssocDependencies and arbitrary DBObjects that should also be scheduled to evaluate when this action is evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocAction.Evaluate(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback)
This method is called by the client code to evaluate an action or an associative network.
evaluationCallback:  While the action is being evaluated, it calls methods of the callback object to inform the client code about the evaluation. The callback reference must not be NULL. See the definition of AssocEvaluationCallback for more details.

Autodesk.AutoCAD.DatabaseServices.AssocAction.ObjectThatOwnsNetworkInstance
Starting from this AssocAction, checks this AssocAction and its owners (in "physical" AutoCAD database object owhership sense) until an AssocNetwork is encountered whose "database" owner is not another AssocNetwork.

Autodesk.AutoCAD.DatabaseServices.AssocAction.RemoveActionsControllingObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the AcDbAssocAction::removeActionsControllingObject() method.

Autodesk.AutoCAD.DatabaseServices.AssocAction.RemoveActionsControllingObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
This wraps the AcDbAssocAction::removeActionsControllingObject() method.

Autodesk.AutoCAD.DatabaseServices.AssocAction.RemoveActionsControllingObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the AcDbAssocAction::removeActionsControllingObject() method.

Autodesk.AutoCAD.DatabaseServices.AssocAction.CurrentEvaluationCallback
Gets the current AssocEvaluationCallback set by the AssocAction.evaluate() call, or NULL if no action evaluation is in progress.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsActionEvaluationInProgress
Indicates whether the system is currently evaluating an action or a network of actions.

Autodesk.AutoCAD.DatabaseServices.AssocAction.OwningNetwork
Gets the logically owning AssocNetwork or ObjectId.Null if it is the topmost AssocNetwork.

Autodesk.AutoCAD.DatabaseServices.AssocAction.Status
Gets and sets the current AssocStatus of this action.

Autodesk.AutoCAD.DatabaseServices.AssocAction.IsActionBodyAProxy
This wraps the AcDbAssocAction::isActionBodyAProxy() method.

Autodesk.AutoCAD.DatabaseServices.AssocAction.ActionBody
Gets and sets the ObjectId of an object of a class derived from AssocActionBody, or null if no action body object has been set.