Autodesk.AutoCAD.DatabaseServices.LayerStateManager
This .NET class wraps the AcDbLayerStateManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Database to be used by the new layer state manager object.
database:  Database association constructor.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStatesDictionaryId(System.Boolean)
Returns ObjectId of the layer states extension dictionary (within the layer table extension dictionary) or ObjectId(NULL) if the database is Null, or if the symbol table is Null, or if the layer table extension dictionary or the layer states extension dictionary is Null (and createIfNotPresent is false), or if the layer table extension dictionary or layer states extension dictionary cannot be created (and createIfNotPresent is true), or if the layer table extension dictionary cannot be opened for read.
createIfNotPresent:  Input flag controlling dictionary creation

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.HasLayerState(System.String)
Checks if the layer state name is present and returns true if so, and false otherwise.
name:  Input layer state name

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SetLayerStateMask(System.String,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks)
Updates the mask used when restoring a layer state.
name:  Input name of layer state to mask
mask:  Input mask to apply to layer state

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.GetLayerStateMask(System.String)
Gets the mask for the named layer state.
name:  Input layer state name

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.DeleteLayerState(System.String)
Deletes the specified layer state.
name:  Input layer state name to delete

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.RenameLayerState(System.String,System.String)
Renames the layer state name to be newName.
name:  Input existing layer state name
newName:  Input new layer state name

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ImportLayerState(System.String)
ImportLayerState() reads the passed-in filename (saved by a previous export) and extracts layer states to import.
fileName:  Input file to extract layer states from

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ExportLayerState(System.String,System.String)
ExportLayerState() reads the passed-in layer state name and exports the corresponding layer state to the export file.
nameToExport:  Input layer state name to export
fileName:  Input filename to export layer state to

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SaveLayerState(System.String,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Saves the current state of the layer table to the layer state specified by name.
name:  Input name of layer state to save
mask:  Input mask to apply to layer state
id:  Input object ID of the viewport whose VPLAYER setting is to be captured

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.RestoreLayerState(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.DatabaseServices.LayerStateMasks)
Restores the layer state name and the VPLAYER settings for the viewport specified.
name:  Input name of layer state to make current
id:  Input object ID of the viewport whose VPLAYER setting is to be updated with the viewport data stored
undefinedLayerStatePolicy:  Input value that indicates whether to handle undefined layers
clientMask:  Input layer attribute mask

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.SetLayerStateDescription(System.String,System.String)
Sets an arbitrary description string on the layer state.
name:  Input layer state whose description is to be updated
description:  Input description string up to 255 characters

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.GetLayerStateDescription(System.String)
Retrieves the description set by SetLayerStateDescription().
name:  Input layer state whose description is to be retrieved

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateHasViewportData(System.String)
Returns a Boolean indicating whether the given layer state has viewport data associated with it.
name:  Input layer state to be interrogated

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.ImportLayerStateFromDb(System.String,Autodesk.AutoCAD.DatabaseServices.Database)
Imports the layer state name passed in name from the open drawing file pointer passed in database.
name:  Input the name of the layer state to be imported
database:  Input a pointer to a valid, readable database from which the layer state is to be imported.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.GetLayerStateNames(System.Boolean,System.Boolean)
Gets an array of the names of all the layer states.
bIncludeHidden:  Input flag to include names of hidden layer states in array.
bIncludeXref:  Input flag to include XRefs

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.GetLayerStateLayers(System.String,System.Boolean)
Gets an array of the names of all the layers that are saved in a layer state. If bInvert is true, the array will contain the names of the layers in the current drawing that are NOT saved in the layer state.
name:  Input the name of the layer state to query
bInvert:  Input if true, the returned array will contain the names of the layers in the current drawing that are NOT saved in the layer state.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.CompareLayerStateToDb(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Compares the layer values saved in a layer state to the current layer values in the drawing.
name:  Input name of layer state to be compared to the drawing.
idVp:  Input object ID of the viewport whose VPLAYER settings are to be used when comparing.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateCreated
Event if the layer state is created.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateCompareFailed
Event if the layer state compare failed.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateToBeRestored
Event if the layer state is about to be restored.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateRestored
Event if the layer state is restored.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.AbortLayerStateRestore
Event if the layer state restore process is aborted.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateToBeDeleted
Event if the layer state is about to be deleted.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateDeleted
Event if the layer state is deleted.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.AbortLayerStateDelete
Event if the layer state delete process is aborted.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateToBeRenamed
Event if the layer state is about to be renamed.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LayerStateRenamed
Event if the layer state is renamed.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.AbortLayerStateRename
Event if the layer state rename process is aborted.

Autodesk.AutoCAD.DatabaseServices.LayerStateManager.LastRestoredLayerState
Accesses the last layer state which was restored.