Autodesk.AutoCAD.Geometry.Point2d
This class wraps AcGePoint2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Point2d.#ctor(System.Double[])
Constructs 2d-point with coordinates taken from the first two elements of the input array.
xy:  Input coordinate array

Autodesk.AutoCAD.Geometry.Point2d.#ctor(System.Double,System.Double)
Constructs 2d-point with coordinates x and y.

Autodesk.AutoCAD.Geometry.Point2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transforms this pre-multiplying it by the matrix leftSide.
leftSide:  Input left side of the matrix

Autodesk.AutoCAD.Geometry.Point2d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns 2D point which is the result of rotation of this point around the origin.
angle:  Input rotation angle
origin:  Input center of rotation

Autodesk.AutoCAD.Geometry.Point2d.Mirror(Autodesk.AutoCAD.Geometry.Line2d)
Returns the 2D point which is the result of mirroring of this point with respect to 2D line line in the same plane.
line:  Input line of symmetry

Autodesk.AutoCAD.Geometry.Point2d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Returns 2d point that is the result of scaling this point with respect to the input point by the scale factor.
scaleFactor:  Input scale factor
origin:  Input center of scaling

Autodesk.AutoCAD.Geometry.Point2d.MultiplyBy(System.Double)
Returns 2D point which is the result of multiplying this point with value.
value:  Input object to be multiplied with the 2D point.

Autodesk.AutoCAD.Geometry.Point2d.DivideBy(System.Double)
Returns the 2D point which is the result of diving this point by value.
value:  Input for dividing the 2D point.

Autodesk.AutoCAD.Geometry.Point2d.Add(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the 2D point which is the result of adding this point to 2D vector value.
value:  Input object to be added.

Autodesk.AutoCAD.Geometry.Point2d.Subtract(Autodesk.AutoCAD.Geometry.Vector2d)
Returns 2D point which is the result of subtracting value from this point.
value:  Input value to subtract.

Autodesk.AutoCAD.Geometry.Point2d.GetAsVector
Converts 2D point into 2D vector with the same set of coordinates.

Autodesk.AutoCAD.Geometry.Point2d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point2d)
Evaluates and returns distance from this point to the point point.
point:  Input point to measure to

Autodesk.AutoCAD.Geometry.Point2d.GetVectorTo(Autodesk.AutoCAD.Geometry.Point2d)
Evaluates and returns the vector with respect to the point point.
point:  Input point to measure to

Autodesk.AutoCAD.Geometry.Point2d.Equals(System.Object)
Returns true if this object is equal to obj.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Point2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point2d)
This method calls Point2d.IsEqualTo(Point2d a, Tolerance tolerance) with tolerance set to Global.
a:  Input object to check against

Autodesk.AutoCAD.Geometry.Point2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this point is within the distance tolerance.equalPoint() from the point a.
a:  Input object to check against
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Point2d.op_Inequality(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Point2d.op_Equality(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Point2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Point2d)
Multiplies mat and b.
mat:  Left operand
a:  Right operand

Autodesk.AutoCAD.Geometry.Point2d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Point2d)
Multiplies a and b.
value:  Left operand
a:  Right operand

Autodesk.AutoCAD.Geometry.Point2d.op_Multiply(Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Multiplies a and value.
a:  Left operand
value:  Right operand

Autodesk.AutoCAD.Geometry.Point2d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Point2d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
format:  Input format
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Point2d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Point2d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Point2d.ToArray
This method returns an array containing the X and Y coordinate values for this point.

Autodesk.AutoCAD.Geometry.Point2d.Origin
Returns the origin of point 2D space.

Autodesk.AutoCAD.Geometry.Point2d.Y
Returns the Y coordinate axis.

Autodesk.AutoCAD.Geometry.Point2d.X
Returns the X coordinate axis.