Autodesk.AutoCAD.DatabaseServices.LayoutManager
This .NET class wraps the AcDbLayoutManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.SetCurrentLayoutId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Accesses the current layout.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.GetLayoutId(System.String)
This function returns the Layout object associated with the given input name.
name:  Input name of Layout object to search for

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CopyLayout(System.String,System.String)
This function makes a copy of an existing Layout object with the given copyName and creates a new copy with the layout name of newName.
copyName:  Input name of Layout object to be copied
newName:  Input name for new copy of Layout object

Autodesk.AutoCAD.DatabaseServices.LayoutManager.DeleteLayout(System.String)
This function removes the Layout object associated with the given layout name from the current database.
deleteName:  Input name of Layout object to delete

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CreateLayout(System.String)
This function creates a new Layout object given a unique layout name.
newName:  Input name to give new Layout object

Autodesk.AutoCAD.DatabaseServices.LayoutManager.RenameLayout(System.String,System.String)
This function renames a Layout object by the given oldName to the new name given by newName.
oldName:  Input name of Layout object to rename
newName:  Input new name for renamed Layout object

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CloneLayout(System.String,System.String,System.Int32)
This function clones the given Layout object and sets the cloned layout to the given layout name and tab order.
copyName:  Input to the old Layout name
newName:  Input the name for new layout
newTabOrder:  Optional input integer specifying new tab order

Autodesk.AutoCAD.DatabaseServices.LayoutManager.GetNonRectangularViewportIdFromClipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function returns the ObjectId for the non rectangular viewport ID associated with the given clipId.
clipId:  Input ObjectId of clip entity to get the nonrectangular viewport ID from
name:  Input name of Layout object to search for.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutExists(System.String)
This function returns true if the layout named name is found in the database.
name:  Input name of layout to find.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutCreated
This event is fired when the layout creation ends.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutToBeRemoved
This event is fired when the layout is about to be removed.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutRemoved
This event is fired when the layout removal ends.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.AbortLayoutRemoved
This event is fired when the layout remove is aborted.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutToBeCopied
This event is fired when the layout is about to be copied.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutCopied
This event is fired when the layout copy ends.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.AbortLayoutCopied
This event is fired when the layout copy is aborted.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutToBeRenamed
This event is fired when the layout is about to be renamed.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutRenamed
This event is fired when the layout rename ends.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.AbortLayoutRename
This event is fired when the layout rename is aborted.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutSwitched
This event is fired when the layout is switched.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.PlotStyleTableChanged
This event is fired when the plot style table is changed.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutsReordered
This event is fired when the layouts are reordered.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutsRefresh
This is LayoutsRefresh, a member of class LayoutManager.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.LayoutCount
Accesses the current number of layouts.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.CurrentLayout
Accesses the current layout.

Autodesk.AutoCAD.DatabaseServices.LayoutManager.Current
Accesses the current layout manager.