Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent
This class gives the refraction component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.#ctor(System.Double,Autodesk.AutoCAD.GraphicsInterface.MaterialMap)
This constructor initializes the material refraction component.
index:  Input index of refraction
map:  Input material map

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Input object to compare against

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.Index
Returns the index of refraction.

Autodesk.AutoCAD.GraphicsInterface.MaterialRefractionComponent.Map
Returns the refraction map.