Autodesk.AutoCAD.DatabaseServices.DistanceConstraint
This class represents a distance constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.#ctor(Autodesk.AutoCAD.Geometry.Vector3d)
Constructor.
direction:  Input AcGeVector3d indicating the fixed direction which is used to measure the distance. The vector length must not be zero.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.ConstrainedLineId
Gets the constrained line id.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.Direction
Gets the fixed direction of this distance constraint.

Autodesk.AutoCAD.DatabaseServices.DistanceConstraint.DirectionType
Gets the direction type of this distance constraint.