Autodesk.AutoCAD.GraphicsInterface.GdiDrawObject
This .Net class wraps the ObjectARX class AcGiGdiDrawObject.

Autodesk.AutoCAD.GraphicsInterface.GdiDrawObject.Draw(System.IntPtr,System.Drawing.Rectangle)
The method draws the GDI owner draw object into the specified bounding rectangle using the specified device context.
hDC:  Input handle to the specified device context.
bounds:  Input bounding rectangle (in logical units) in which the GDI owner draw object will be displayed.

Autodesk.AutoCAD.GraphicsInterface.GdiDrawObject.Height
Accesses the original height of the GDI owner draw object in pixel units.

Autodesk.AutoCAD.GraphicsInterface.GdiDrawObject.Width
Accesses the original width of the GDI owner draw object in pixel units.