Autodesk.AutoCAD.DatabaseServices.Vertex2d
This .NET class wraps the AcDb2dVertex ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
Copy constructor.
position:  Input Autodesk.AutoCAD.Geometry.Point3d object.
bulge:  Input System.Double object.
startWidth:  Input System.Double object.
endWidth:  Input System.Double object.
tangent:  Input System.Double object.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Tangent
Returns the curve-fit tangent direction for the vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.TangentUsed
Checks whether the curve-fit tangent direction is in use by this vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Bulge
Returns the vertex’s bulge value.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.EndWidth
Returns the end width for the vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.StartWidth
Returns the start width for the vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.Position
Returns the position value of the vertex.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.VertexType
Returns the .Vertex2dType of this vertex.