Autodesk.AutoCAD.DatabaseServices.DBObjectReference
This class contains an object's ID and the DXF group code that represents the object's type.

Autodesk.AutoCAD.DatabaseServices.DBObjectReference.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
This constructor sets the ID and kind of object reference.
id:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object
kind:  Input System.Int32 object

Autodesk.AutoCAD.DatabaseServices.DBObjectReference.Kind
Returns the Kind property value.

Autodesk.AutoCAD.DatabaseServices.DBObjectReference.ObjectId
Accesses the object ID.