Autodesk.AutoCAD.DatabaseServices.OpenModeAttribute
Reports the open mode.

Autodesk.AutoCAD.DatabaseServices.OpenModeAttribute.#ctor(Autodesk.AutoCAD.DatabaseServices.OpenMode)
Constructor.
mode:  Mode of open object

Autodesk.AutoCAD.DatabaseServices.OpenModeAttribute.OpenMode
Accesses the open mode.