Autodesk.AutoCAD.DatabaseServices.Region
This .NET class wraps the AcDbRegion ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Region.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Region.CreateFromCurves(Autodesk.AutoCAD.DatabaseServices.DBObjectCollection)
Overloads for the Region.CreateFromCurves method.
curveSegments:  Input collection to curve entities used to define the region's perimeter(s)

Autodesk.AutoCAD.DatabaseServices.Region.AreaProperties(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This function calculates the area properties of the Region.
origin:  Input point (in WCS coords) for origin of the coordinate system to usefor evaluation.
xAxis:  Input X axis (in WCS coords) of the coordinate system to use forevaluation.
yAxis:  Input Y axis (in WCS coords) of the coordinate system to use forevaluation.

Autodesk.AutoCAD.DatabaseServices.Region.BooleanOperation(Autodesk.AutoCAD.DatabaseServices.BooleanOperationType,Autodesk.AutoCAD.DatabaseServices.Region)
Performs Boolean operation between this region and otherRegion.
operation:  Input type of Boolean operation.
otherRegion:  Input pointer to another region to perform the Boolean operation

Autodesk.AutoCAD.DatabaseServices.Region.UsesGraphicsCache
This property is a wrapper for the AcDbRegion::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the region.

Autodesk.AutoCAD.DatabaseServices.Region.NumChanges
Accesses the number of changes that have occurred to this region since it was first created.

Autodesk.AutoCAD.DatabaseServices.Region.Normal
Accesses the normal vector of the region.

Autodesk.AutoCAD.DatabaseServices.Region.IsNull
Assesses if the region has no ShapeManager object within itself.

Autodesk.AutoCAD.DatabaseServices.Region.GeometricExtents
Accesses the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the entity, and return those points as an instance of class Extents in the "extents" parameter.

Autodesk.AutoCAD.DatabaseServices.Region.Area
Accesses the surface area of the region.

Autodesk.AutoCAD.DatabaseServices.Region.Perimeter
Accesses the perimeter length (in drawing units) of the region.