Autodesk.AutoCAD.DatabaseServices.BlockReference
This .NET class wraps the AcDbBlockReference ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.BlockReference.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This constructor initializes the block reference to use position (in WCS) as the position point; blockTableRecord as the object ID of the block table record to reference; the X, Y, and Z scale factors to 1.0; the rotation to 0.0; and the normal vector to (0,0,1).
position:  Input Autodesk.AutoCAD.Geometry.Point3d object, the position point
blockTableRecord:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object, the object ID of BlockTableRecord to reference

Autodesk.AutoCAD.DatabaseServices.BlockReference.GeometryExtentsBestFit
Retrieves copies of all the entities in the referenced block table record.

Autodesk.AutoCAD.DatabaseServices.BlockReference.GeometryExtentsBestFit(Autodesk.AutoCAD.Geometry.Matrix3d)
Retrieves copies of all the entities in the referenced block table record, applying parentTransform to them, and then calculating the extents on the resulting entity set.
parentTransform:  Input Autodesk.AutoCAD.Geometry.Matrix3d transformation to be applied to the block reference’s geometry

Autodesk.AutoCAD.DatabaseServices.BlockReference.ExplodeToOwnerSpace
Explodes the block reference into individual components.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ResetBlock
Resets the BlockReference to the default state of the dynamic block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ConvertToStaticBlock(System.String)
Converts the dynamic block instance to a legacy (non-dynamic) block.
newBlockName:  Input the name of the new block definition

Autodesk.AutoCAD.DatabaseServices.BlockReference.ConvertToStaticBlock
Converts the dynamic block instance to a legacy (non-dynamic) anonymous block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.UnitFactor
Returns the unit factor.

Autodesk.AutoCAD.DatabaseServices.BlockReference.BlockUnit
Accesses the units associated with block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Name
Returns the name of the associated BlockTableRecord.

Autodesk.AutoCAD.DatabaseServices.BlockReference.AnonymousBlockTableRecord
Returns the anonymous block definition used to draw the dynamic block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.DynamicBlockTableRecord
Returns the object ID of the dynamic block definition (a BlockTableRecord) if the block reference is a dynamic block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.IsDynamicBlock
Determines whether the BlockReference passed to the class constructor contains dynamic block information.

Autodesk.AutoCAD.DatabaseServices.BlockReference.DynamicBlockReferencePropertyCollection
Returns the collection the dynamic block (a BlockTableRecord) is a part of, if the block reference is a dynamic block.

Autodesk.AutoCAD.DatabaseServices.BlockReference.TreatAsBlockRefForExplode
Called by the AutoCAD EXPLODE command to determine how the entity should be exploded.

Autodesk.AutoCAD.DatabaseServices.BlockReference.AttributeCollection
Returns the AttributeCollection property value.

Autodesk.AutoCAD.DatabaseServices.BlockReference.BlockTransform
Accesses the block reference’s position (insertion point), normal vector, scale factors, and rotation so that the resulting MCS-to-drawing-WCS transform is the same as the transform matrix.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Normal
Accesses the normal vector (in WCS coordinates) of the plane containing the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Rotation
Accesses the rotation value (in radians) of the block reference.

Autodesk.AutoCAD.DatabaseServices.BlockReference.ScaleFactors
Accesses the block reference to use the X, Y, and Z scale factors contained in scale.

Autodesk.AutoCAD.DatabaseServices.BlockReference.Position
Accesses the position value (often referred to as the insertion point), in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.BlockReference.BlockTableRecord
Accesses the object ID of the BlockTableRecord referenced by the block reference.