Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry
This .NET class wraps the AcGiViewportGeometry ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.PolylineEye(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polyline is similar to the standard Geometry.Polyline, but it is described using eye coordinates.
points:  Input list of points in the polyline, in eye coordinates

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.PolygonEye(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polygon is similar to the standard Geometry.Polygon, but it is described using eye coordinates.
points:  Input list of points in the polygon, in eye coordinates

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.DeviceContextPolyline(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polyline is similar to the standard Geometry.Polyline, but it is described using display coordinates.
points:  Input list of points in the polyline, in display coordinates

Autodesk.AutoCAD.GraphicsInterface.ViewportGeometry.DeviceContextPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
This polygon is similar to the standard Geometry.Polygon, but it is described using display coordinates.
points:  Input list of points in the polygon, in display coordinates