Autodesk.AutoCAD.DatabaseServices.GripModeCollection
The collection that wraps AcArray of AcDbMultiModesGripPE::GripMode.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.GetEnumerator
Gets the internal IEnumerator object to enumerate the collection.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.Add(Autodesk.AutoCAD.DatabaseServices.GripMode)
Appends a GripMode object to the collection.
gripMode:  The mode object to add.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.Clear
Empties the collection.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.Contains(Autodesk.AutoCAD.DatabaseServices.GripMode)
Indicates whether a GripMode object is in the collection.
gripMode:  The gripMode object to test.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.GripMode[],System.Int32)
This is CopyTo, a member of class GripModeCollection.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.Remove(Autodesk.AutoCAD.DatabaseServices.GripMode)
Removes a GripMode object from the collection.
gripMode:  The gripMode object to remove.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.IsReadOnly
Indicates whether the collection is read-only.

Autodesk.AutoCAD.DatabaseServices.GripModeCollection.Count
Gets the item count in the collection.