Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId
Abstract base class used to persistently identify an SubentityId of an Entity.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.GetTransientSubentIds(Autodesk.AutoCAD.DatabaseServices.Entity)
Mapping: AssocPersSubentityId --> SubentityId(s)
Obtains all SubentityIds corresponding to this AssocPersSubentityId.
entity:  The entity needs to be open for read.
subents:  The returned SubentityIds.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.SubentType(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns the type of the subentity.
entity:  The entity needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.TransientSubentCount(Autodesk.AutoCAD.DatabaseServices.Entity)
Returns the number of transient SubentityIds corresponding to this AssocPersSubentityId.
entity:  The entity needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Returns true if this and the other AssocPersSubentityId reference are exactly the same subentity of the same entity.
other:  The other AssocPersSubentityId.
ntity:  The entity owning the subentities of this and the other AssocPersSubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.Mirror(Autodesk.AutoCAD.DatabaseServices.Entity)
Notifies this AssocPersSubentityId that the entity has been mirrored and that the AssocPersSubentityId may possibly need to update itself to identify the same subentity in the mirrored entity as it identified before the entity has been mirrored.
mirroredEntity:  The entity that has been mirrored. It needs to be open for read.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.CreateObjectAndDwgInFields(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.DwgFiler,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId&)
A static method that reads the class identification of the actual AssocPersSubentityId-derived class, creates an object of this derived class and calls DwgInFields() on it.
database:  AcDbDatabase that is going to own the AcDbAssocPersSubentId.
filer:  The filer to read the data from. The first data is the class identification.
createdPersSubentId:  This is an in/out argument used to return the created and filled-in object of an AssocPersSubentityId-derived class. If the createdPersSubentId is passed in as not NULL, the code tries to reuse the existing object, if it is of the expected derived class. If it is passed in as NULL or is not of the expected derived type, it creates a new object (deleting the existing one, if any).

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.CreateObjectAndDxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId&)
A static method that reads the class identification of the actual AssocPersSubentityId-derived class, creates an object of this derived class and calls DxfInFields() on it.
filer:  The filer to read the data from. The first data is the class identification.
createdPersSubentId:  This is an in/out argument used to return the created and filled-in object of an AssocPersSubentityId-derived class. If the createdPersSubentId is passed in as not NULL, the code tries to reuse the existing object, if it is of the expected derived class. If it is passed in as NULL or is not of the expected derived type, it creates a new object (deleting the existing one, if any).

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to write the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to write the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
The standard protocol.
auditInfo:  See the AuditInfo documentation.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.IsNull
Indicates whether this AssocPersSubentityId is null, i.e., not referencing any subentity of any entity.