Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs
This class provides data for the EntityAlignment event.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.GetPickedEntities
This method returns an array containing the full subentity paths of the picked entities.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.Direction
Accesses the Direction property value.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.ClosestPoint
Accesses the ClosestPoint property value.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.Normal
Accesses the Normal property value.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.PickPoint
Accesses the PickPoint property value.

Autodesk.AutoCAD.DatabaseServices.EntityAlignmentEventArgs.Entity
Accesses the Entity property value.