Autodesk.AutoCAD.DatabaseServices.ConstrainedDatumLine
This class represents a constrained datum unbounded line node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedDatumLine.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructor.
pointOnLine:  Input any 3D point. Relative to the work plane of the owning Assoc2dConstraintGroup object.
direction:  Input any 3D vector(must not be zero length). Relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedDatumLine.#ctor
Default constructor.