Autodesk.AutoCAD.DatabaseServices.AssocPlaneSurfaceActionBody
This wraps the ObjectARX AcDbAssocPlaneSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocPlaneSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocPlaneSurfaceActionBody::AcDbAssocPlaneSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocPlaneSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PathRef,System.Boolean)
This wraps the ObjectARX AcDbAssocPlaneSurfaceActionBody::createInstance() method.