Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection
This class provides a container for Autodesk.AutoCAD.DatabaseServices.DBObjectReference objects.

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Add(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Adds the object represented by value to this collection.
value:  Input object to add

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Returns the zero-based index of the collection item that matches value.
value:  Item to retrieve the index of

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Inserts value at position index in the collection.
index:  Index to insert at
value:  Item to insert

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Remove(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Removes the object represented by value from this collection.
value:  Item to remove

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.Contains(Autodesk.AutoCAD.DatabaseServices.DBObjectReference)
Returns a Boolean indicating whether the collection contains an object that matches value.
value:  Object to look for

Autodesk.AutoCAD.DatabaseServices.DBObjectReferenceCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DBObjectReference[],System.Int32)
Copies objects in array to this collection.
array:  Array to copy from
index:  Zero-based index to start copying at