Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh
This .NET class wraps the AcDbPolyFaceMesh ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolyFaceMeshVertex)
This function appends the PolyFaceMeshVertex object pointed to by vertexToAppend to the end of the vertex list of the PolyFaceMesh, establishes the PolyFaceMesh as the vertex's owner, and adds the vertex to the database that contains the PolyFaceMesh (the PolyFaceMesh must be database-resident for this function to succeed).
vertexToAppend:  Input vertex to append to mesh

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.AppendFaceRecord(Autodesk.AutoCAD.DatabaseServices.FaceRecord)
This function appends the FaceRecord pointed to by toAppend to the end of the facelist of the PolyFaceMesh, establishes the PolyFaceMesh object as the FaceRecord's owner, and adds the FaceRecord to the database that contains the PolyFaceMesh (the PolyFaceMesh must be database-resident for this function to succeed).
toAppend:  Input FaceRecord to append to the mesh

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.NumFaces
Accesses the number of faces in the PolyFaceMesh.

Autodesk.AutoCAD.DatabaseServices.PolyFaceMesh.NumVertices
Accesses the number of point coordinate vertices in the vertex list of the PolyFaceMesh.