Autodesk.AutoCAD.Geometry.PointOnSurface
This .NET class wraps the AcGePointOnSurface ObjectARX class.

Autodesk.AutoCAD.Geometry.PointOnSurface.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetPoint(Autodesk.AutoCAD.Geometry.Point2d)
Returns the coordinates of the point on surface at the specified point.
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetNormal(Autodesk.AutoCAD.Geometry.Point2d)
Returns the normal vector at the specified point.
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetNormal
Returns the normal vector at the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Returns the U-partial derivative at the specified point.
order:  Input order of derivative
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetUDerivative(System.Int32)
Returns the U-partial derivative of the specified order.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Returns the V-partial derivative at the specified parameter value.
order:  Input order of derivative
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetVDerivative(System.Int32)
Returns the V-partial derivative of the specified order.
order:  Input order of derivative

Autodesk.AutoCAD.Geometry.PointOnSurface.GetMixedPartial(Autodesk.AutoCAD.Geometry.Point2d)
Returns the mixed partial at the specified point.
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetMixedPartial
Returns the mixed partial at the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Point2d)
Maps the input tangent vector to the tangent plane at the specified parameter value.
vector:  Input any 2D vector
point:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnSurface.GetTangentVector(Autodesk.AutoCAD.Geometry.Vector2d)
Maps the input tangent vector to the tangent plane at the point on surface.
vector:  Input any 2D vector

Autodesk.AutoCAD.Geometry.PointOnSurface.GetInverseTangentVector(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point2d)
Projects the input vector onto the tangent plane at the specified point and returns the 2D parameter space vector that maps to this projected vector.
vector:  Input any 3D vector
point:  Input any 2D point

Autodesk.AutoCAD.Geometry.PointOnSurface.GetInverseTangentVector(Autodesk.AutoCAD.Geometry.Vector3d)
Projects the input vector onto the tangent plane at the point on surface and returns the 2D parameter space vector that maps to this projected vector.
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.PointOnSurface.Parameter
Returns the parameter value of the point on surface.

Autodesk.AutoCAD.Geometry.PointOnSurface.Surface
Returns the surface on which the point lies.