Autodesk.AutoCAD.DatabaseServices.HighlightOverrule
This .NET class wraps the ObjectARX class AcDbHighlightOverrule.

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.Highlight(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
This .NET method wraps the ObjectARX method AcDbHighlightOverrule::highlight().

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.Unhighlight(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,System.Boolean)
This .NET method wraps the ObjectARX method AcDbHighlightOverrule::unhighlight().

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.HighlightOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.