Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.#ctor
This wraps the ObjectARXAcDbAssocSweptSurfaceActionBody::AcDbAssocSweptSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.GetScaleFactor(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::scaleFactor() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.SetScaleFactor(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::setScaleFactor() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.GetAlignAngle(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::alignAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.SetAlignAngle(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::setAlignAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.GetTwistAngle(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::twistAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.SetTwistAngle(System.Double,System.String,System.String)
This wraps the ObjectARXAcDbAssocSweptSurfaceActionBody::setTwistAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.DatabaseServices.SweepOptions,System.Boolean)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.TwistAngle
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::twistAngle() and AcDbAssocSweptSurfaceActionBody::setTwistAngle () methods.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.AlignAngle
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::alignAngle() and AcDbAssocSweptSurfaceActionBody::setAlignAngle ()methods.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.ScaleFactor
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::scaleFactor() and AcDbAssocSweptSurfaceActionBody::setScaleFactor () methods.