Autodesk.AutoCAD.DatabaseServices.ObjectOverrule
This .NET class wraps the ObjectARX class AcDbObjectOverrule.

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.Open(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.OpenMode)
This .NET method wraps the ObjectARX method AcDbObjectOverrule::open().

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.Close(Autodesk.AutoCAD.DatabaseServices.DBObject)
This .NET method wraps the ObjectARX method AcDbObjectOverrule::close().

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.Cancel(Autodesk.AutoCAD.DatabaseServices.DBObject)
This .NET method wraps the ObjectARX method AcDbObjectOverrule::cancel().

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.Erase(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
This .NET method wraps the ObjectARX method AcDbObjectOverrule::erase().

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.DeepClone(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
This .NET method wraps the ObjectARX method AcDbObjectOverrule::deepClone().

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.WblockClone(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.Runtime.RXObject,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
This .NET method wraps the ObjectARX method AcDbObjectOverrule::wblockClone().

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.ObjectOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.