Autodesk.AutoCAD.DatabaseServices.XrefRedirectedEventArgs
This class provides data for the XrefRedirected event of the database.

Autodesk.AutoCAD.DatabaseServices.XrefRedirectedEventArgs.OldId
Gets the object ID of the symbol table record in the xref that is being redirected.

Autodesk.AutoCAD.DatabaseServices.XrefRedirectedEventArgs.NewId
Gets the object ID of the symbol table record that the xref symbol table record is redirected to.