Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody
Wrapper AssocDimDependencyBody manages a Dimension entity that serves as the graphical representation of a dimensional constraint.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.UpdateDependentOnObjectOverride
Updates position, size and orientation of the controlled Dimension.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.CreateAndPostToDatabase(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId&,Autodesk.AutoCAD.DatabaseServices.ObjectId&)
"Pseudo constructor".
dimId:  ObjectId of the Dimension.
dimDepId:  ObjectId of the created AssocDependency.
dimDepBodyId:  ObjectId of the created AssocDimDependencyBody.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.IsEntityAttachmentChangedOverride
Indicates whether the attachment of the controlled Dimension changed, such as the Dimension has been repositioned.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.EntityMeasurementOverride
Gets the measurement from the controlled Dimension.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.EntityTextOverride
Gets and sets the text of the controlled Dimension.