Autodesk.AutoCAD.Geometry.Position3d
This .NET class wraps the AcGePosition3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Position3d.#ctor(System.Double,System.Double,System.Double)
Constructs a 3D position object that has the specified coordinates.

Autodesk.AutoCAD.Geometry.Position3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a 3D position object with the same coordinates as the input point.
point:  Input any 3D point object

Autodesk.AutoCAD.Geometry.Position3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Position3d.Set(System.Double,System.Double,System.Double)
Changes the coordinates of the 2D position object to the input coordinates.

Autodesk.AutoCAD.Geometry.Position3d.Set(Autodesk.AutoCAD.Geometry.Point3d)
Changes the coordinates of the 3D position object to have the same coordinates as the input point.
point:  Input any 3D point