Autodesk.AutoCAD.Geometry.BoundBlock2d
This .NET class wraps the AcGeBoundBlock2d ObjectARX class.

Autodesk.AutoCAD.Geometry.BoundBlock2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a parallelogram given a vertex and two sides.
basePoint:  Input origin vertex a corner of the bounding area
direction1:  Input direction and size for first side of the bounding area
direction2:  Input direction and size for second side of the bounding area

Autodesk.AutoCAD.Geometry.BoundBlock2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs a box contracted to a segment between two points.
point1:  Input point 1
point2:  Input point 2

Autodesk.AutoCAD.Geometry.BoundBlock2d.#ctor
Constructs a parallelogram contracted to the origin of the coordinates.

Autodesk.AutoCAD.Geometry.BoundBlock2d.GetMaximumPoint
Returns the maximum point of the coordinate belonging to a block.

Autodesk.AutoCAD.Geometry.BoundBlock2d.GetMinimumPoint
Returns the minimum point of the coordinate belonging to a block.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Sets the block as a parallelogram with given vertex and sides.
basePoint:  Input origin vertex a corner of the bounding area
direction1:  Input direction and size for first side of the bounding area
direction2:  Input direction and size for second side of the bounding area

Autodesk.AutoCAD.Geometry.BoundBlock2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Sets the block as a parallelogram contracted to a segment between two points.
firstPoint:  Input first point
secondPoint:  Input second point

Autodesk.AutoCAD.Geometry.BoundBlock2d.Extend(Autodesk.AutoCAD.Geometry.Point2d)
Extends the block to include the new point.
point:  Input extension point

Autodesk.AutoCAD.Geometry.BoundBlock2d.Swell(System.Double)
Swells the block by moving the sides for the distance.
distance:  Input distance to expand the block

Autodesk.AutoCAD.Geometry.BoundBlock2d.Contains(Autodesk.AutoCAD.Geometry.Point2d)
Returns true if the point belongs to the block.
point:  Input point to test whether the point belongs to the block

Autodesk.AutoCAD.Geometry.BoundBlock2d.IsDisjoint(Autodesk.AutoCAD.Geometry.BoundBlock2d)
Returns true if the input block does not intersect with this block.
block:  Input another Autodesk.AutoCAD.Geometry.BoundBlock2d object.

Autodesk.AutoCAD.Geometry.BoundBlock2d.IsBox
Returns true if the block is a coordinate box.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Direction2
Returns direction and size for second side of the bounding area.

Autodesk.AutoCAD.Geometry.BoundBlock2d.Direction1
.

Autodesk.AutoCAD.Geometry.BoundBlock2d.BasePoint
Returns origin vertex, a corner of the bounding area.