Autodesk.AutoCAD.GraphicsInterface.Viewport
This .NET class wraps the AcGiViewport ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.Viewport.DoPerspective(Autodesk.AutoCAD.Geometry.Point3d)
Transforms value from eye coordinates to display coordinates.
value:  Input point to be transformed

Autodesk.AutoCAD.GraphicsInterface.Viewport.DoInversePerspective(Autodesk.AutoCAD.Geometry.Point3d)
Transforms value from display coordinates to eye coordinates and returns the object.
value:  Input point to be transformed

Autodesk.AutoCAD.GraphicsInterface.Viewport.GetNumPixelsInUnitSquare(Autodesk.AutoCAD.Geometry.Point3d)
In perspective mode, the WCS unit square gets smaller and encompasses fewer pixels as it recedes away from the camera, whereas in non-perspective mode, the unit square stays the same size no matter how far away from the camera.
givenWorldPoint:  Input WCS point for the center point of the display coordinate unit square

Autodesk.AutoCAD.GraphicsInterface.Viewport.LayerVisible(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the layer is not frozen in this viewport and not globally frozen.
idLayer:  Input layer to be investigated

Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewDirection
Returns the current view direction of the viewport.

Autodesk.AutoCAD.GraphicsInterface.Viewport.LinetypeGenerationCriteria
During linetype elaboration of ever smaller objects, a point is reached where the dashes are so small as to be indistinguishable from a continuous line.

Autodesk.AutoCAD.GraphicsInterface.Viewport.LinetypeScaleMultiplier
This is a value supplied by the viewport itself.

Autodesk.AutoCAD.GraphicsInterface.Viewport.FrontAndBackClipping
Fills in the parameters with information about the existence and location of front and back display clipping planes.

Autodesk.AutoCAD.GraphicsInterface.Viewport.DeviceContextViewportCorners
It positions the geometry (such as icons) that remain in a fixed position or fixed size in the viewport's display.

Autodesk.AutoCAD.GraphicsInterface.Viewport.AcadWindowId
Returns the Viewport index number of the viewport being drawn to.

Autodesk.AutoCAD.GraphicsInterface.Viewport.ViewportId
Returns the viewport ID.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraUpVector
Returns the camera "up" direction vector to the viewport camera's world coordinate "up" vector.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraTarget
Returns the camera target location point to the viewport camera's world coordinate target.

Autodesk.AutoCAD.GraphicsInterface.Viewport.CameraLocation
Returns camera location to the viewport camera's world coordinate location.

Autodesk.AutoCAD.GraphicsInterface.Viewport.IsPerspective
Returns true if perspective mode is in effect.

Autodesk.AutoCAD.GraphicsInterface.Viewport.EyeToWorldTransform
Returns the transformation matrix to the current eye coordinate to Model Coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.WorldToEyeTransform
Transforms matrix to the current World Coordinate to eye coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.EyeToModelTransform
Returns the transformation matrix to the current eye coordinate to Model Coordinate transformation matrix.

Autodesk.AutoCAD.GraphicsInterface.Viewport.ModelToEyeTransform
Transforms matrix to the current Model Coordinate to eye coordinate.