Autodesk.AutoCAD.Runtime.ProfileCurve2d
This wraps the profile curve2d, which is the output of basic elements of point cloud extraction result.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.#ctor(Autodesk.AutoCAD.Geometry.CircularArc2d)
Constructor with an arc.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.#ctor(Autodesk.AutoCAD.Geometry.LineSegment2d)
Constructor with a line segment.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.#ctor
Constructor.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.Arc
Specifies it as an arc.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.LineSeg
Specifies it as a line segment.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.IsArc
Returns an arc.

Autodesk.AutoCAD.Runtime.ProfileCurve2d.IsSegment
Returns a segment.