Autodesk.AutoCAD.Geometry.PointOnCurve3d
This .NET class wraps the AcGePointOnCurve3d ObjectARX class.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Constructs a point on the input curve at the specified parameter value.
curve:  Input any 3D curve
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetPointAtParameter(System.Double)
Returns the coordinates of the point on curve at the specified parameter value.
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetPointOnCurve(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Returns the coordinates of the point on the input curve at the specified parameter value.
curve:  Input any 3D curve
parameter:  Input parameter value

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32,Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Returns the derivative of the specified order on the input curve at the specified parameter value.
order:  Input order of derivative
curve:  Input any 3D curve
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32,System.Double)
Returns the derivative of the specified order at the specified parameter value.
order:  Input order of derivative
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetDerivative(System.Int32)
Returns the derivative of the specified order.
order:  Input order of derivative

Autodesk.AutoCAD.Geometry.PointOnCurve3d.IsSingular
Determines if first derivative vector is zero-length.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.IsSingular(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if first derivative vector is zero-length.
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetCurvature(System.Double)
Computes the curvature of the curve at the point on the curve at the specified parameter value.
parameter:  Input parameter value on curve

Autodesk.AutoCAD.Geometry.PointOnCurve3d.GetCurvature
Computes the curvature of the curve at the point on the curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Point
Returns the coordinates of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Parameter
Returns the parameter value of the point on curve.

Autodesk.AutoCAD.Geometry.PointOnCurve3d.Curve
Returns the curve on which the point lies.