Autodesk.AutoCAD.DatabaseServices.ObjectTypeAttribute
This class reports the type of an object.

Autodesk.AutoCAD.DatabaseServices.ObjectTypeAttribute.#ctor(System.Type)
Creates a new object based on an existing type.
type:  Object type

Autodesk.AutoCAD.DatabaseServices.ObjectTypeAttribute.ObjectType
Accesses the object type.