Autodesk.AutoCAD.DatabaseServices.Layout
This .NET class wraps the AcDbLayout ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Layout.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Layout.Initialize
This method will do the behind the scenes work to establish a Paper Space viewport for the layout.

Autodesk.AutoCAD.DatabaseServices.Layout.AddToLayoutDictionary(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method adds the layout to the specified database's layout dictionary, and specifies the block table record to use.
toWhichDatabase:  Input database to which to add the layout
blockTableRecordId:  Input block table record to use

Autodesk.AutoCAD.DatabaseServices.Layout.GetViewports
This function returns a collection of ObjectIds of all the Viewports that exist in the Layout's paperspace.

Autodesk.AutoCAD.DatabaseServices.Layout.Thumbnail
Accesses the thumbnail argument to point to a newly-allocated buffer that contains this layout's thumbnail bitmap.

Autodesk.AutoCAD.DatabaseServices.Layout.Extents
Accesses the current extents  setting of the layout.

Autodesk.AutoCAD.DatabaseServices.Layout.Limits
Accesses the current limits set in the layout.

Autodesk.AutoCAD.DatabaseServices.Layout.AnnoAllVisible
Accesses current ANNOALLVISIBLE value for the database
See the System Variables section of the AutoCAD Command Reference for information on ANNOALLVISIBLE.

Autodesk.AutoCAD.DatabaseServices.Layout.TabSelected
Accesses the layout tab is included in the selection set for operations that affect multiple tabs.

Autodesk.AutoCAD.DatabaseServices.Layout.TabOrder
Accesses the tab order field, which controls the order in which the layouts are displayed in the tab control that is docked to the bottom of the viewport.

Autodesk.AutoCAD.DatabaseServices.Layout.LayoutName
Accesses the user-friendly layout name that is displayed in the tab control.

Autodesk.AutoCAD.DatabaseServices.Layout.BlockTableRecordId
Accesses the Layout's associated BlockTableRecord.