Autodesk.AutoCAD.DatabaseServices.NormalConstraint
This class represents a Normal constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.NormalConstraint.#ctor
Default constructor.