Autodesk.AutoCAD.DatabaseServices.Light
This .NET class wraps the AcDbLight ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Light.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Light.SetHotspotAndFalloff(System.Double,System.Double)
Sets the hotspot and falloff angles.
hotspot:  Input the hotspot cone angle, in radians. Defines the brightest part of the spot light beam. Must be smaller than or equal to the falloff.
falloff:  Input the falloff cone angle, in radians. Defines the full cone of light. This is also known as the field angle. Must be larger than the hotspot.

Autodesk.AutoCAD.DatabaseServices.Light.ResultingColor
Gets the final color of the light.

Autodesk.AutoCAD.DatabaseServices.Light.HasTarget
Assesses if the light display has a target grip.

Autodesk.AutoCAD.DatabaseServices.Light.WebRotation
Accesses the rotation offset used to orient the goniometric data relative to the light orientation.

Autodesk.AutoCAD.DatabaseServices.Light.WebFile
Accesses the path to the file containing the light's goniometric data (e.g.

Autodesk.AutoCAD.DatabaseServices.Light.LampColorRGB
Accesses the RGB value for the light's lamp color.

Autodesk.AutoCAD.DatabaseServices.Light.LampColorPreset
Accesses the preset lamp color of the light.

Autodesk.AutoCAD.DatabaseServices.Light.LampColorTemp
Accesses the Kelvin color temperature of the light.

Autodesk.AutoCAD.DatabaseServices.Light.LampColorType
Accesses the lamp color type of the light.

Autodesk.AutoCAD.DatabaseServices.Light.IlluminanceDistance
Accesses the illuminance distance of the light.

Autodesk.AutoCAD.DatabaseServices.Light.PhysicalIntensity
Accesses the physical intensity of the light.

Autodesk.AutoCAD.DatabaseServices.Light.PhysicalIntensityMethod
Accesses the physical intensity method of the light.

Autodesk.AutoCAD.DatabaseServices.Light.Softness
Accesses the softness shadow parameter.

Autodesk.AutoCAD.DatabaseServices.Light.ShadowType
Accesses the shadow type currently in effect.

Autodesk.AutoCAD.DatabaseServices.Light.MapSize
Accesses the shadow map size.

Autodesk.AutoCAD.DatabaseServices.Light.UseLimits
Controls the use of StartLimitOffset and EndLimitOffset properties.

Autodesk.AutoCAD.DatabaseServices.Light.EndLimitOffset
Accesses the end limit parameter of light attenuation.

Autodesk.AutoCAD.DatabaseServices.Light.StartLimitOffset
Accesses the start limit shadow parameter.

Autodesk.AutoCAD.DatabaseServices.Light.AttenuationType
Accesses the type of attenuation, or decay, for this light.

Autodesk.AutoCAD.DatabaseServices.Light.Name
Accesses the name of the light object.

Autodesk.AutoCAD.DatabaseServices.Light.Direction
Accesses the direction (vector) that the rays of a distant light travel.

Autodesk.AutoCAD.DatabaseServices.Light.FalloffAngle
Accesses the falloff angle of this spot light.

Autodesk.AutoCAD.DatabaseServices.Light.HotspotAngle
Accesses the hotspot angle of this spot light.

Autodesk.AutoCAD.DatabaseServices.Light.TargetLocation
Accesses the position of the light target location, in the coordinate space of the current context.

Autodesk.AutoCAD.DatabaseServices.Light.Position
Accesses the position of the light source, in the coordinate space of the current context.

Autodesk.AutoCAD.DatabaseServices.Light.Attenuation
Accesses the light attenuation type, use limits, start limits, and end limits.

Autodesk.AutoCAD.DatabaseServices.Light.Shadow
Accesses the shadow parameters: shadow type, mapsize, softness, on/off, area-sampled shadow parameters.

Autodesk.AutoCAD.DatabaseServices.Light.Intensity
Accesses the light intensity.

Autodesk.AutoCAD.DatabaseServices.Light.LightColor
Accesses the emitted color of the light.

Autodesk.AutoCAD.DatabaseServices.Light.IsPlottable
Accesses the plottable state of the light.

Autodesk.AutoCAD.DatabaseServices.Light.IsOn
Accesses the Light on/off state.

Autodesk.AutoCAD.DatabaseServices.Light.LightType
Accesses the type of the light object.