Autodesk.AutoCAD.GraphicsSystem.DriverInfo
This class contains the Graphics system driver information.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.#ctor(System.Boolean,System.String,System.String)
This constructor sets the driver info and its hardware acceleration.
hardwareAccelerated:  Input sets whether this driver supports hardware acceleration
path:  Input full path to the driver file
driver:  Input name of the driver file

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.#ctor(System.String,System.String)
This constructor sets the driver info.
path:  Input full path to the driver file
driver:  Input name of the driver file

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.Driver
Accesses the driver file name.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.Path
Accesses the full path to the driver file.

Autodesk.AutoCAD.GraphicsSystem.DriverInfo.HardwareAccelerated
Accesses the Hardware Acceleration property.