Autodesk.AutoCAD.DatabaseServices.PerpendicularConstraint
This class represents a Perpendicular constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.PerpendicularConstraint.#ctor
Default constructor.