Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren
This class contains a field code plus its embedded or nested (child) fields.

Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren.Add(System.Int32,Autodesk.AutoCAD.DatabaseServices.Field)
Adds the new child field field to the array of children at index i.
i:  Index at which the new entry will be added to the array of children.
field:  New child field to add to the array of children at index i.

Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren.Dispose
This is Dispose, a member of class FieldCodeWithChildren.

Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren.Children
Accesses the Children property value.

Autodesk.AutoCAD.DatabaseServices.FieldCodeWithChildren.FieldCode
Accesses the FieldCode property value.