Autodesk.AutoCAD.Geometry.Vector3d
This .NET class wraps the AcGeVector3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs a 3D vector by the formula uAxis * vector2d.x + vAxis * vector2d.y
where 3D point p and 3D vectors uAxis and vAxis form a coordinate system in planar entity plane and can found by function call plane.get(p, uAxis, vAxis).
plane:  Input plane
vector2d:  Input vector

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(System.Double[])
Creates a vector using the first three elements of the array.
xyz:  Input coordinate array

Autodesk.AutoCAD.Geometry.Vector3d.#ctor(System.Double,System.Double,System.Double)
Constructs a 3D vector with coordinates x, y, and z correspondingly.

Autodesk.AutoCAD.Geometry.Vector3d.Convert2d(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns 2D vector with the coordinates corresponding to the decomposition of this vector in the basis uAxis, vAxis in the planar entity plane, where uAxis and vAxis can be found by function call plane.GetCoordinateSystem(p, uAxis, vAxis).
plane:  Input input plane

Autodesk.AutoCAD.Geometry.Vector3d.AngleOnPlane(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns the angle between the orthogonal projection of this vector into the plane through the origin with the same normal as planar entity plane and the zeroth basis vector v0 of the planar entity plane provided by the function plane.GetCoordinateSystem (p, v0, v1).
plane:  Input input plane

Autodesk.AutoCAD.Geometry.Vector3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transform this pre-multiplying it the matrix leftSide.
leftSide:  Input 3D matrix

Autodesk.AutoCAD.Geometry.Vector3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Returns 3D point which is the result of rotation of this vector around the line with axis passing through the origin.
angle:  Input angle of rotation
axis:  Input axis of rotation

Autodesk.AutoCAD.Geometry.Vector3d.Mirror(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the 3D vector which is the result of mirroring of this vector with respect to the plane with the normal normalToPlane passing through the origin.
normalToPlane:  Input plane normal

Autodesk.AutoCAD.Geometry.Vector3d.MultiplyBy(System.Double)
Multiplies this vector with value.
value:  Input value to multiply against

Autodesk.AutoCAD.Geometry.Vector3d.Add(Autodesk.AutoCAD.Geometry.Vector3d)
Adds this vector with v.
v:  Input vector to add

Autodesk.AutoCAD.Geometry.Vector3d.Subtract(Autodesk.AutoCAD.Geometry.Vector3d)
Subtracts object v from this vector.
v:  Input value to subtract by

Autodesk.AutoCAD.Geometry.Vector3d.DivideBy(System.Double)
Divides value by this vector.
value:  Input a figure to divide by

Autodesk.AutoCAD.Geometry.Vector3d.Negate
Negates this vector, namely sets it to be equal to the vector (-x, -y).

Autodesk.AutoCAD.Geometry.Vector3d.GetPerpendicularVector
Returns a vector orthogonal to this vector, namely the vector ( -y, x).

Autodesk.AutoCAD.Geometry.Vector3d.GetAngleTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the angle between this vector and the vector vector in the range [0, 2 x Pi].
vector:  Input any 3D vector
referenceVector:  Input reference vector

Autodesk.AutoCAD.Geometry.Vector3d.GetAngleTo(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the angle between this vector and the vector vector in the range [0, Pi].
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.Vector3d.GetNormal
This method calls Vector3d.GetNormal(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Vector3d.GetNormal(Autodesk.AutoCAD.Geometry.Tolerance)
Returns the unit vector codirectional to this vector.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsUnitLength
This method calls Vector3d.IsUnitLength(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Vector3d.IsUnitLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to its normalization.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsZeroLength
This method calls Vector3d.IsZeroLength(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Vector3d.IsZeroLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to zero vector.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Vector3d.IsParallelTo(Vector3d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input Autodesk.AutoCAD.Geometry.Vector3d object.

Autodesk.AutoCAD.Geometry.Vector3d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is parallel to the vector vector.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Vector3d.IsCodirectionalTo(Vector3d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.Vector3d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
This function checks if this vector is codirectional to the vector.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Vector3d.IsPerpendicularTo(Vector3d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.Vector3d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is perpendicular to the vector vector.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.DotProduct(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the dot product of this vector and the vector v.
v:  Input vector to perform dot product with

Autodesk.AutoCAD.Geometry.Vector3d.CrossProduct(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the cross product of this vector and vector vector.
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.Vector3d.ProjectTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the 3D vector that is the result of the parallel projection of this vector into the plane with normal planeNormal passing through the origin.
planeNormal:  Input plane normal
projectDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.Vector3d.OrthoProjectTo(Autodesk.AutoCAD.Geometry.Vector3d)
Returns a 3D vector which is the result of the orthogonal projection of this point into the plane with normal planeNormal passing through the origin.
planeNormal:  Input plane normal

Autodesk.AutoCAD.Geometry.Vector3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Vector3d.IsEqualTo(Vector3d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.Vector3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is within the distance tolerance.equalVector() from the vector vector.
vector:  Input any 3D vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector3d.Equals(System.Object)
Returns true if this object is equal to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Vector3d.op_Inequality(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Vector3d.op_Equality(Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Vector3d)
Transformation Function
Returns the vector equal to the product of matrix a and vector b.
a:  Input matrix
b:  Input vector

Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Vector3d)
Returns the vector equal to a multiplied by scale factor factor.
factor:  Input scale factor
a:  Input vector

Autodesk.AutoCAD.Geometry.Vector3d.op_Multiply(Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Returns the vector equal to vector a multiplied by scale factor factor.
a:  Input scale factor
factor:  Input vector

Autodesk.AutoCAD.Geometry.Vector3d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Vector3d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
format:  Input format
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Vector3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Vector3d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Vector3d.ToArray
Returns an array of type Double containing the X, Y and Z coordinate values for this vector.

Autodesk.AutoCAD.Geometry.Vector3d.LargestElement
Accesses.

Autodesk.AutoCAD.Geometry.Vector3d.LengthSqrd
Returns the square of the Euclidian length of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.Length
Returns the Euclidian length of this vector.

Autodesk.AutoCAD.Geometry.Vector3d.ZAxis
Returns the ZAxis property value.

Autodesk.AutoCAD.Geometry.Vector3d.YAxis
Returns the YAxis property value.

Autodesk.AutoCAD.Geometry.Vector3d.XAxis
Returns the XAxis property value.

Autodesk.AutoCAD.Geometry.Vector3d.Z
Returns the Z property value.

Autodesk.AutoCAD.Geometry.Vector3d.Y
Returns the Y property value.

Autodesk.AutoCAD.Geometry.Vector3d.X
Returns the X property value.