Autodesk.AutoCAD.DatabaseServices.BeginWblockSelectedObjectsEventArgs
This class provides data for the BeginWblockSelectedObjects event of the database.

Autodesk.AutoCAD.DatabaseServices.BeginWblockSelectedObjectsEventArgs.InsertionPoint
Gets the insertion point chosen by the user at the beginning of the wblock operation.

Autodesk.AutoCAD.DatabaseServices.BeginWblockSelectedObjectsEventArgs.From
Gets the database being wblock'ed.