Autodesk.AutoCAD.DatabaseServices.Polyline
This .NET class wraps the AcDbPolyline ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Polyline.#ctor(System.Int32)
The Polyline dynamically allocates memory when vertices are added.
vertices:  Input number of vertices to allocate memory for

Autodesk.AutoCAD.DatabaseServices.Polyline.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertFrom(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Fills the Polyline with data from the Polyline2d pointed to by entity. entity must point to a SimplePoly or FitCurvePoly type of Polyline2d object in a database. This function should be called from an Polyline that is not yet database-resident.
If transferId is true, the calling Polyline will become database-resident. The calling Polyline will assume the ObjectId and handle, plus any extended entity data (except data on vertices), the extension dictionary, and reactors of the Polyline2d entity entity. entity will then be deleted and set to NULL.
If transferId is false, entity will remain in the database as is and the caller must close it. The resulting Polyline will not be database-resident, and if not appended to a database, should be deleted.
entity:  Input pointer to the Polyline2d to copy from
transferId:  Input Boolean indicating whether or not to do a HandOverTo between the Polyline2d and the Polyline

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertTo(System.Boolean)
Creates an Polyline2d from the Polyline and returns the newly created Polyline2d.
If transferId is true, the newly-created Polyline2d will become database-resident and will assume the ObjectId and handle, plus any extended entity data, extension dictionary, and reactors of the Polyline on which this method is called. The Polyline will then no longer be database-resident and can be deleted by the C++ delete operator.
If transferId is false, then the Polyline will remain in the database as is and the caller must close it. The resulting Polyline2d and all its vertices will not be database-resident, and if not appended to a database, should be deleted.
transferId:  Input Boolean indicating whether or not to do a handOverTo between the Polyline and the Polyline2d.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetPoint3dAt(System.Int32)
Returns the 3D location of the vertex index in World Coordinates.
value:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetSegmentType(System.Int32)
Returns the type of segment (SegType) that is headed by the vertex index.
index:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetLineSegment2dAt(System.Int32)
If the segment at vertex index is a line, then this functions returns a representative 2D copy of that segment in the polyline's own object coordinate system (OCS).
index:  Input index (0 based) of the vertex for start of segment

Autodesk.AutoCAD.DatabaseServices.Polyline.GetArcSegment2dAt(System.Int32)
If the segment at vertex index is an arc, then this function will fill in arc with the 2D arc information (radius, center, and so on) from the polyline in the polyline's own OCS.
index:  Input index (0 based) of the vertex for start of arc

Autodesk.AutoCAD.DatabaseServices.Polyline.GetLineSegmentAt(System.Int32)
If the segment at vertex index is a line, then this functions returns a representative 3D copy of that segment in World Coordinates.
index:  Input index (0 based) of the vertex for start of segment

Autodesk.AutoCAD.DatabaseServices.Polyline.GetArcSegmentAt(System.Int32)
If the segment at vertex index is an arc, then this function will fill in arc with the 3D arc information (radius, center, and so on) from the polyline in WCS.
index:  Input index (0 based) of the vertex for start of arc

Autodesk.AutoCAD.DatabaseServices.Polyline.OnSegmentAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
Determines whether or not pt2d (specified in the polyline's Entity Coordinate System) is on the segment of the polyline starting at vertex index.
index:  Input index (0 based) of the vertex
pt2d:  Input point (in polyline OCS coords) to check at vertex index
value:  Output parameter of at vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.AddVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double)
Adds a vertex to the polyline.
index:  Input index (0 based) before which to insert the vertex
pt:  Input vertex location point
bulge:  Input bulge value for vertex
startWidth:  Input start width for vertex
endWidth:  Input end width for vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.RemoveVertexAt(System.Int32)
Removes the vertex at index.
index:  Input index (0 based) of the vertex to remove

Autodesk.AutoCAD.DatabaseServices.Polyline.GetPoint2dAt(System.Int32)
Returns the 2D location of the vertex index in the polyline's own object coordinate system (OCS).
index:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.SetPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Sets pt (in polyline OCS coordinates) to be the location of the index vertex.
index:  Input index (0 based) of the vertex
pt:  Input location for the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetBulgeAt(System.Int32)
Gets the bulge factor value at the index vertex.
index:  Input index (0 based) of the vertex for start of bulge

Autodesk.AutoCAD.DatabaseServices.Polyline.SetBulgeAt(System.Int32,System.Double)
Sets bulge to be the bulge value for the index vertex.
index:  Input index (0 based) of the vertex
bulge:  Input bulge value for the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetStartWidthAt(System.Int32)
Returns the start width.
index:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetEndWidthAt(System.Int32)
Returns the polyline segment ending width value for the polyline.
index:  Input index (0 based) of the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline.SetStartWidthAt(System.Int32,System.Double)
Sets the start width for vertex index.
index:  Input index (0 based) of the vertex
startWidth:  Input start width value for vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.SetEndWidthAt(System.Int32,System.Double)
Sets the end width for vertex index.
index:  Input index (0 based) of the vertex
endWidth:  Input end width value for vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.MinimizeMemory
Optimizes the memory usage of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.MaximizeMemory
"Decompresses" any memory compression that may currently be used by the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.Reset(System.Boolean,System.Int32)
Resets the polyline's vertex data.
If reuse is true, then the NumberOfVertices number of vertices are left intact and all vertices beyond that number are deleted.
If reuse is false, then NumberOfVertices is ignored and all existing vertex information will be deleted.
reuse:  Input Boolean indicating whether or not to retain some vertices
vertices:  Input number of vertices to retain

Autodesk.AutoCAD.DatabaseServices.Polyline.Length
Accesses the total length of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.HasWidth
Assesses if the polyline has any width values set for any of the segments.

Autodesk.AutoCAD.DatabaseServices.Polyline.HasBulges
Assesses if the polyline has any bulge factors set for any of the segments.

Autodesk.AutoCAD.DatabaseServices.Polyline.NumberOfVertices
Accesses the number of vertices in the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.IsOnlyLines
Assesses if there are only lines in the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.Normal
Accesses the normal (in WCS coordinates) to the plane containing the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.ConstantWidth
Accesses the polyline's constant width.

Autodesk.AutoCAD.DatabaseServices.Polyline.Thickness
Accesses the thickness (extrusion depth or height) of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.Elevation
Accesses the distance of the polyline's plane from the WCS origin.

Autodesk.AutoCAD.DatabaseServices.Polyline.Plinegen
If true, the polyline displays its linetype across vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline.Closed
Accesses whether the polyline should be closed (that is, there is a segment drawn from the last vertex to the first) or not.