Autodesk.AutoCAD.Geometry.OffsetSurface
This .NET class wraps the AcGeOffsetSurface ObjectARX class.

Autodesk.AutoCAD.Geometry.OffsetSurface.#ctor(Autodesk.AutoCAD.Geometry.Surface,System.Double)
Constructs an offset object defined by input data.
baseSurface:  Input base surface
offsetDistance:  Input offset distance

Autodesk.AutoCAD.Geometry.OffsetSurface.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.OffsetSurface.Set(Autodesk.AutoCAD.Geometry.Surface,System.Double)
Changes offset definition to the one specified by input data.
surface:  Input base surface
offsetDistance:  Input offset distance

Autodesk.AutoCAD.Geometry.OffsetSurface.OffsetDist
Returns offset distance.

Autodesk.AutoCAD.Geometry.OffsetSurface.ConstructionSurface
Accesses the base surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.OriginalSurface
Computes pointer to the original surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsTorus
Returns flag indicating if offset is a torus.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsCone
Returns flag indicating if offset is a cone surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsCylinder
Returns flag indicating if offset is a cylinder surface.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsSphere
Returns flag indicating if offset is a sphere.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsBoundedPlane
Returns flag indicating if offset is a bounded plane.

Autodesk.AutoCAD.Geometry.OffsetSurface.IsPlane
Returns flag indicating if offset is a plane.