Autodesk.AutoCAD.GraphicsSystem.Configuration
This .NET class wraps the AcGsConfig ObjectARX class.

Autodesk.AutoCAD.GraphicsSystem.Configuration.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsSystem.Configuration.Configure
Applies and saves configuration changes.

Autodesk.AutoCAD.GraphicsSystem.Configuration.ShowConfigDialog(System.String)
Displays various configuration related dialogs.
dlgType:  Input attribute for dialog type

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsInConfiguring
Returns true if the product is currently in the process of configuring the hardware, false otherwise is returned.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SaveToRegistry
Saves the settings to the registry.

Autodesk.AutoCAD.GraphicsSystem.Configuration.Restore
Restores the hardware certification result.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetHardwareAcceleratedDrivers
Returns the name and path of the current hardware accelerated driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DegradationChainPosition(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel)
Returns the position of the degradation channel in the degradation chain.
channel:  Input the degradation position will be returned.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DegradationChannelAt(System.Int32)
Returns the degradation channel at the specified position in the degradation chain.
order:  Input for which degradation channel will be returned.

Autodesk.AutoCAD.GraphicsSystem.Configuration.ShiftDegradationChainPosition(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel,System.Boolean)
Shifts the specified degradation channel down or up in the degradation chain.The degradation chain is the list of degradation channels which are enabled and placed in a specific order. Upon degradation, the chain is traversed, degrading one channel at a time until the target frame rate is reached or the last channel has been degraded.
channel:  Input Autodesk.AutoCAD.GraphicsSystem.DegradationChannel object.
shiftDown:  Input.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetCanDegradeChannel(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel)
The degradation chain is the list of degradation channels which are enabled and placed in a specific order.
channel:  Input object to query.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetCanDegradeChannel(Autodesk.AutoCAD.GraphicsSystem.DegradationChannel,System.Boolean)
Enables or disables the status of the given degradation channel.
channel:  Input degradation channel whose status is to be changed.
degrade:  Input degradation channel status.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureMode
Returns the current graphics hardware Feature Mode as a FeatureModeType enum value.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureModeAvailable
Returns the available value for the graphics hardware Feature Mode.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureMode(Autodesk.AutoCAD.GraphicsSystem.FeatureModeType)
Sets the current graphics hardware Feature Mode.
type:  Input as a FeatureModeType enum value

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsHardwareAccelerationEnabled
Queries the system on whether hardware acceleration is enabled or not.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsHardwareAccelerationAvailable
Queries the system on whether hardware acceleration is available or not.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsHardwareAccelerationRecommended
Queries the system on whether hardware acceleration is recommended or not.

Autodesk.AutoCAD.GraphicsSystem.Configuration.setHardwareAcceleration(System.Boolean)
Specifies whether hardware acceleration is enabled.
bEnable:  Input Boolean as hardware acceleration state

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsNoHardwareOverrideEnabled
Check to see if AutoCAD is running in safe mode.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetEffectList(Autodesk.AutoCAD.GraphicsSystem.EffectListType)
Get a list of all hardware effects and their configuration status.
type:  Type of desired list.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetCertificationData
Gets aggregated Hardware Certification information.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetVirtualDeviceName
Gets the name of the virtual device.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GenerateVertexNormals
Returns True if the vertex normals will be generated for surfaces that request normal generation, False otherwise.

Autodesk.AutoCAD.GraphicsSystem.Configuration.Transparency
Accesses the transparency quality.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DiscardBackFaces
Returns true if back faces are discarded; it returns false if they are drawn.

Autodesk.AutoCAD.GraphicsSystem.Configuration.Handedness
Retrieves the currently configured handedness of the data passed in to the GS.

Autodesk.AutoCAD.GraphicsSystem.Configuration.RedrawOnWindowExpose
Returns true if geometry is re-rasterized before the screen is updated; it returns false if geometry is not re-rasterized.

Autodesk.AutoCAD.GraphicsSystem.Configuration.AdaptiveDegradation
Returns true if adaptive degradation is enabled; it false if adaptive generation is disabled.

Autodesk.AutoCAD.GraphicsSystem.Configuration.FrameRate
Returns an integer between 1 and 60, representing the display speed in frames per second that must be maintained during view manipulations for adaptive degradation mode.

Autodesk.AutoCAD.GraphicsSystem.Configuration.CurveTessellationTolerance
Retrieves the amount of detail (tessellation lines or triangles) displayed for curves.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SurfaceTessellationTolerance
Retrieves the amount of detail (tessellation lines or triangles) displayed for surfaces.The return value is an integer between 0 and 100.

Autodesk.AutoCAD.GraphicsSystem.Configuration.MaxLODs
Returns an integer between 1 and 10, representing the number of tessellations that the Graphics System will cache for dynamic tessellation.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DynamicTessellation
Returns true if dynamic tessellation is enabled; it returns else if dynamic tessellation is disabled.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DefaultHardwareAcceleratedDriver
Retrieves the name and path of the default hardware accelerated driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.HardwareAcceleratedDriver
Retrieves the name and path of the current hardware accelerated driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.CurrentDisplayDriver
Queries the configuration settings for the current display driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverSearchPath
Retrieves the driver search path.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverRevision
Returns the revision number of this version of the driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverVersion
Returns the major version number of the driver.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DriverName
Retrieves the driver name.