Autodesk.AutoCAD.Geometry.CubicSplineCurve2d
This .NET class wraps the AcGeCubicSplineCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d,System.Double)
Constructs a cubic interpolation spline approximating curve with the distance of epsilon.
curve:  Input generic 2D curve
epsilon:  Input approximation tolerance value

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Constructs an interpolation cubic spline going through the fit points.
fitPoints:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tolerance object.
fitPoints:  Input interpolating points
startDerivative:  Input derivative at the beginning of spline
endDerivative:  Input derivative at the end of spline
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructs an interpolation cubic spline going through the fit points.
fitPoints:  Input interpolating points

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs an interpolation cubic spline going through the fit points within tolerance specified by the tol object.
fitPoints:  Input interpolating points
tolerance:  Input tolerance object

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.GetFitPointAt(System.Int32)
Resets the fit point at the specified index to the input value.
index:  Input index of a fitPoint point

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
Resets the fit point at the specified index to the input value.
index:  Input index of a fit point
point:  Input fit point

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.GetFirstDerivativeAt(System.Int32)
Returns the first derivative at the interpolation point specified by its index.
index:  Input index of an interpolation point

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.SetFirstDerivativeAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector2d)
Resets the derivative at the specified index to the input value.
index:  Input index of a fit point
derivative:  Input derivative

Autodesk.AutoCAD.Geometry.CubicSplineCurve2d.NumFitPoints
Returns number of the spline's fit points.