Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo
This .NET class wraps the AcDbDatabaseSummaryInfo ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input System.Object to compare

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.op_Inequality(Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo,Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo)
Compares the two operands and returns true if they are not equivalent.
a:  Input left operand
b:  Input right operand

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.op_Equality(Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo,Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo)
Compares the two operands and returns true if they are equivalent.
a:  Input left operand
b:  Input right operand

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input System.IFormatProvider object

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.CustomProperties
Accesses the custom properties property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.HyperlinkBase
Accesses the hyperlink base property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.RevisionNumber
Accesses the revision number.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.LastSavedBy
Accesses the last saved by property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Comments
Accesses the comments property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Keywords
Accesses the keywords property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Author
Accesses the author property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Subject
Accesses the subject value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo.Title
Accesses the title.