Autodesk.AutoCAD.Geometry.PolylineCurve3d
This .NET class wraps the AcGePolyline3d ObjectARX class.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double)
Constructs a polyline approximating a curve within the specified epsilon.
curve:  Input curve to be approximated by polyline
epsilon:  Input approximation epsilon

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs a polyline with the knots and point values established.
knots:  Input knot vectors
controlPoints:  Input collection of fit points

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection)
Constructs a polyline with the specified fit points.
points:  Input collection of fit points

Autodesk.AutoCAD.Geometry.PolylineCurve3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.PolylineCurve3d.FitPointAt(System.Int32)
Returns fit point at the specified index i.
i:  Input index of a fit point

Autodesk.AutoCAD.Geometry.PolylineCurve3d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets the fit point at the specified index i.
i:  Input index of a fit point
point:  Input fit point

Autodesk.AutoCAD.Geometry.PolylineCurve3d.NumberOfFitPoints
Returns number of fit points.