Autodesk.AutoCAD.Runtime.DynamicLinkerEventArgs
.

Autodesk.AutoCAD.Runtime.DynamicLinkerEventArgs.#ctor(System.String)
Constructs a new link to a file.
fileName:  Input file name

Autodesk.AutoCAD.Runtime.DynamicLinkerEventArgs.FileName
Returns the FileName property value.