Autodesk.AutoCAD.Geometry.BoundedPlane
This .NET class wraps the AcGeBoundedPlane ObjectARX class.

Autodesk.AutoCAD.Geometry.BoundedPlane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs a bounded planar surface defined by origin and two other points.
p1:  Input point
origin:  Input origin point
p2:  Input point

Autodesk.AutoCAD.Geometry.BoundedPlane.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs a bounded planar surface defined by a point and two vectors.
origin:  Input plane origin
u:  Input U direction
v:  Input V direction

Autodesk.AutoCAD.Geometry.BoundedPlane.#ctor
Constructs a valid default infinite planar surface.

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane)
This method calls BoundedPlane.IntersectWith(BoundedPlane plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input bounded plane

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.BoundedPlane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if there is any segment intersection.
plane:  Input bounded plane
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane)
This method calls BoundedPlane.IntersectWith(BoundedPlane plane, Tolerance tolerance) with tolerance set to Global.
plane:  Input bounded plane

Autodesk.AutoCAD.Geometry.BoundedPlane.IntersectWith(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns flag indicating if a segment intersection takes place.
plane:  Input bounded plane
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.BoundedPlane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes plane definition to the one specified by input data as per the origin point and the points on plane, p1 and p2.
p1:  Input first point on plane
origin:  Input origin point
p2:  Input second point on plane

Autodesk.AutoCAD.Geometry.BoundedPlane.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes plane definition to the one specified by input data, as per the origin point and input vectors u and v.
origin:  Input origin point
u:  Input u vector
v:  Input Autodesk.AutoCAD.Geometry.Vector3d object, v vector