Autodesk.AutoCAD.DatabaseServices.DataLinkManager
This .NET class wraps the AcDbDataLinkManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.GetDataLink
Returns a collection of data links.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.GetDataLink(System.String)
Returns the object ID for the selected data link.
name:  Name of the data link to get.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.AddDataLink(Autodesk.AutoCAD.DatabaseServices.DataLink)
Adds the specified data link object to the manager.
dataLink:  Data link object to add to the manager.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.RemoveDataLink(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified data link from the manager.
idDataLink:  Reference to the data link to remove.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.RemoveDataLink(System.String)
Removes the specified data link from the manager.
name:  Key to retrieve the data link.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.Update(Autodesk.AutoCAD.DatabaseServices.UpdateDirection,Autodesk.AutoCAD.DatabaseServices.UpdateOption)
Updates the data for all the data links.
direction:  Update direction.
option:  Update options.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.Update(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.UpdateDirection,Autodesk.AutoCAD.DatabaseServices.UpdateOption)
Updates the data for the specified data links.
dataIds:  Data link ids to update
direction:  Update direction.
option:  Update options.

Autodesk.AutoCAD.DatabaseServices.DataLinkManager.DataLinkCount
Returns the number of data links.