Autodesk.AutoCAD.DatabaseServices.DBDictionary
This .NET class wraps the AcDbDictionary ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.GetAt(System.String)
This function searches the dictionary for an entry with key entryName and, if found, returns its object ID.
entryName:  String representing the entry's search key name to look for

Autodesk.AutoCAD.DatabaseServices.DBDictionary.NameAt(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function searches the dictionary for an entry with object ID objId and returns the search key name of the dictionary entry.
objId:  Object ID to search for

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the object specified is in the dictionary.
objId:  Object to search for

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Contains(System.String)
Returns true if the object specified is in the dictionary.
entryName:  Name to search by

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function removes an entry specified by its object ID in objId from the dictionary.
objId:  Object ID of the object to remove

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Remove(System.String)
This function removes and entry specified by its 'key' from the dictionary.
key:  String representing the entry's key (or name)

Autodesk.AutoCAD.DatabaseServices.DBDictionary.SetName(System.String,System.String)
This function renames the entry specified by oldName to the new name specified by newName.
oldName:  String representing the entry's old key string name
newName:  String representing the entry's new key string name

Autodesk.AutoCAD.DatabaseServices.DBDictionary.GetEnumerator
This function returns a new enumerator.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.CopyTo(Autodesk.AutoCAD.DatabaseServices.DBDictionaryEntry[],System.Int32)
Copies objects in array to this object, starting from index.
array:  Array to receive data from
index:  Index to begin at

Autodesk.AutoCAD.DatabaseServices.DBDictionary.IncludingErased
Accesses the including erased property value.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.Count
Accesses the number of items in the dictionary.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.MergeStyle
Accesses the merge style property value.

Autodesk.AutoCAD.DatabaseServices.DBDictionary.TreatElementsAsHard
Accesses whether elements are treated hard or not.