Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d
This .NET class wraps AcGeCurveCurveInt3d ObjectARX class.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an object that represents the intersection of the two input curves, curve1 and curve2.
curve1:  Input first curve
curve2:  Input second curve
range1:  Input first range interval
range2:  Input second range interval
planeNormal:  Input optional plane normal

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an object that represents the intersection of the two input curves.
curve1:  Input first curve
curve2:  Input second curve
planeNormal:  Input optional plane normal

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.#ctor
This default constructor is used as a placeholder where the curves are specified by a subsequent call to one of the set() functions.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionRanges
Returns the two intervals for which intersection points and overlap occur.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionPoint(System.Int32)
Returns the intersection points between the two curves.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionParameters(System.Int32)
Returns the parameter values on each curve of the specified intersection point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetPointOnCurve1(System.Int32)
Returns the specified intersection point intersection as an PointOnCurve3d object of the first curve.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetPointOnCurve2(System.Int32)
Returns the specified intersection point intersection as an PointOnCurve3d object of the second curve.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.IsTangential(System.Int32)
Returns whether the specified intersection point is a tangential intersection.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.IsTransversal(System.Int32)
Returns whether the specified intersection point is a transversal intersection.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetIntersectionPointTolerance(System.Int32)
Returns the tolerance that was used to find the specified intersection point.
intersection:  Input index to the intersection desired

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OverlapCount
Returns the number of intervals of overlap between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OverlapDirection
Returns true if the two curves are oriented in the same direction where they overlap and false if they are oriented in the opposite direction.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.GetOverlapRanges(System.Int32)
Returns the intervals of overlap of each curve of the specified overlap.
overlap:  Input number of overlaps to get intervals for

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.ChangeCurveOrder
Reverses the order of the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo1
Reorders intersection points so that they are returned in increasing parameter values with respect to the first curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo2
Reorders intersection points so that they are returned in increasing parameter values with respect to the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Interval,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls CurveCurveIntersector3d.Set(Curve3d curve1, Curve3d curve2, Interval range1, Interval range2, Vector3d planeNormal, Tolerance tolerance) with tolerance set to Global.
curve1:  Output Autodesk.AutoCAD.Geometry.Curve3d object; first curve
curve2:  Output Autodesk.AutoCAD.Geometry.Curve3d object; second curve
range1:  Output Autodesk.AutoCAD.Geometry.Interval object; first range interval
range2:  Output Autodesk.AutoCAD.Geometry.Interval object; second range interval
planeNormal:  Input optional plane normal

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Set(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
Resets the two curves, curve1 and curve2, that are to be intersected.
curve1:  Input first curve
curve2:  Input second curve
planeNormal:  Input optional plane normal

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.NumberOfIntersectionPoints
Returns the number of intersection points between the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Tolerance
Returns the tolerance used when intersecting the two curves.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.PlaneNormal
Returns the plane normal that getIntConfigs() uses to compute the configurations at an intersection point.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Curve2
Returns a pointer to the second curve.

Autodesk.AutoCAD.Geometry.CurveCurveIntersector3d.Curve1
Returns a pointer to the first curve.