Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory
This is class Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory.NumOfCoordinate
This is NumOfCoordinate, a member of class GeoCoordinateCategory.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory.GetCoordinateAt(System.Int32)
This is GetCoordinateAt, a member of class GeoCoordinateCategory.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory.CreateAll
This is CreateAll, a member of class GeoCoordinateCategory.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory.ID
This is ID, a member of class GeoCoordinateCategory.