Autodesk.AutoCAD.Geometry.Curve3d
This .NET class wraps the AcGeCurve3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Curve3d.GetInterval
Returns the parametric range of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.SetInterval(Autodesk.AutoCAD.Geometry.Interval)
Sets the parametric range of the curve based on the parametric value.
value:  Input parametric interval on which this curve is defined

Autodesk.AutoCAD.Geometry.Curve3d.GetReverseParameterCurve
Reverses the parametric direction of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve3d)
This method calls Curve3d.GetDistanceTo(Curve3d curve, Tolerance tolerance) with tolerance set to Global.
curve:  Input any 3D curve

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the closest points between this curve and the input curve.
curve:  Input any 3D curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Curve3d.GetDistanceTo(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 3D point

Autodesk.AutoCAD.Geometry.Curve3d.GetDistanceTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the distance between the input point and the closest point on this curve.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d)
This method calls Curve3d.GetClosestPointTo(Curve3d curve, Tolerance tolerance) with tolerance set to Global.
curve3d:  Input any 3D curve

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest points between this curve and the input curve.
curve3d:  Input any 3D curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Curve3d.GetClosestPointTo(Point3d curve, Tolerance tolerance) with tolerance set to Global.
point:  Input any 3D point

Autodesk.AutoCAD.Geometry.Curve3d.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the closest point on this curve to the input point.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Curve3d.GetProjectedClosestPointTo(Curve3d curve, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
curve3d:  Input any 3D curve
projectDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the points on the two curves which when projected onto a plane whose normal is projectDirection are the closest points on the projected curves.
curve3d:  Input any 3D curve
projectDirection:  Input direction of projection
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Curve3d.GetProjectedClosestPointTo(Point3d curve, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
point:  Input any 3D point
projectDirection:  Input direction of projection

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on the curve which when projected onto a plane whose normal is projectDirection is the closest point on the projected curve to the input point.
point:  Input any 3D point
projectDirection:  Input direction of projection
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Curve3d.GetNormalPoint(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 3D point

Autodesk.AutoCAD.Geometry.Curve3d.GetNormalPoint(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Finds the point on the input curve whose normal passes through the input point.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoBoundBlockOf(Autodesk.AutoCAD.Geometry.Interval)
Returns the bounding box of the specified sub-interval of the curve.
range:  Input sub-interval of curve

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
This method calls Curve3d.GetProjectedEntity(Plane projectionPlane, Vector3d projectDirection, Tolerance tolerance) with tolerance set to Global.
projectionPlane:  Input plane on which curve is to be projected
projectDirection:  Input direction in which curve is to be projected

Autodesk.AutoCAD.Geometry.Curve3d.GetProjectedEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the entity that is the projection of the curve onto the projection plane in the specified direction.
projectionPlane:  Input plane on which curve is to be projected
projectDirection:  Input direction in which curve is to be projected
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoProjectEntity(Autodesk.AutoCAD.Geometry.Plane)
This method calls Curve3d.GetOrthoProjectEntity(Plane projectionPlane, Tolerance tolerance) with tolerance set to Global.
projectionPlane:  Input plane on which curve is to be projected

Autodesk.AutoCAD.Geometry.Curve3d.GetOrthoProjectEntity(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the entity that is the orthogonal projection of the curve onto the projection plane.
projectionPlane:  Input plane on which curve is to be projected
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(System.Double)
This method calls Curve3d.IsOn(Double value, Tolerance tolerance) with tolerance set to Global.
value:  Input parameter value

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if input parameter value is within valid parametric range of curve.
value:  Input parameter value
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double&)
Determines if the point lies on curve.
point:  Input any 3D point
value:  Input parameter value of point if point lies on curve

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point:  Input any 3D point
value:  Input parameter value of point if point lies on curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Curve3d.IsOn(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 3D point

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if input point lies on curve.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Curve3d.GetParameterOf(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input any 3D point

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterOf(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the parameter value of point.
point:  Input any 3D point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType)
This method calls Curve3d.GetTrimmedOffset(Double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType, Tolerance tolerance) with tolerance set to Global.
distance:  Input offset distance
planeNormal:  Input normal vector to plane of curve
extensionType:  Input determines how offset curve will be extended at points of C1 discontinuity

Autodesk.AutoCAD.Geometry.Curve3d.GetTrimmedOffset(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.OffsetCurveExtensionType,Autodesk.AutoCAD.Geometry.Tolerance)
Returns one or more offset curves that represent the trimmed offset of the curve.
distance:  Input offset distance
planeNormal:  Input normal vector to plane of curve
extensionType:  Input determines how offset curve will be extended at points of C1 discontinuity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsClosed
This method calls Curve3d.IsClosed(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Curve3d.IsClosed(Autodesk.AutoCAD.Geometry.Tolerance)
Determines if start point and endpoint of curve are the same.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane&)
Determines if curve is planar.
plane:  Input plane on which this curve lies if it is planar

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is planar.
plane:  Input plane on which this curve lies if it is planar
tolerance:  EvaluatePoint

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d&)
Determines if curve is linear.
line:  Input line on which this curve lies if it is linear

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear.
line:  Input line on which this curve lies if it is linear
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane&)
Returns true if both curve are planar and lie in the same plane.
curve3d:  Input any 3D curve
plane:  Input plane in which this curve and input curve lie

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane&,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if both curve are planar and lie in the same plane.
curve3d:  Input any 3D curve
plane:  Input plane in which this curve and input curve lie
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsPeriodic(System.Double&)
Determines if the curve is periodic.
period:  Input period of curve parameter

Autodesk.AutoCAD.Geometry.Curve3d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity3d&)
Determines if the curve is degenerate and if so returns the entity which the curve degenerates into.
result:  Output type of degenerate entity

Autodesk.AutoCAD.Geometry.Curve3d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity3d&,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the curve is degenerate and if so returns the entity which the curve degenerates into.
result:  Output type of degenerate entity
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetLength(System.Double,System.Double,System.Double)
Returns the arc length of the curve between the two parameter values.
fromParameter:  Input parameter value of interval start
toParameter:  Input parameter value of interval end (must be larger than fromParameter)
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetParameterAtLength(System.Double,System.Double,System.Boolean,System.Double)
Returns the parameter value of the point whose arc length distance (from the point with parameter value datumParameter) is the input length. In other words, if t = paramAtLength (datumParameter, length, direction, tolerance)
then length (t, datumParameter, tolerance) is (approximately) equal to length.
datumParameter:  Input parameter value
length:  Input arc length
direction:  Input parameter direction
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetArea(System.Double,System.Double)
This method calls Curve3d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) with tolerance set to Global.
startingParameter:  Input parameter value of interval start
endingParameter:  Input parameter value of interval end (must be larger than startParameter)

Autodesk.AutoCAD.Geometry.Curve3d.GetArea(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the area of the interval of the curve defined by startingParameter and endingParameter.
startingParameter:  Input parameter value of interval start
endingParameter:  Input parameter value of interval end (must be larger than startParameter)
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.GetSplitCurves(System.Double)
Returns two segments which are obtained by splitting the curve at the input parameter value.
value:  Input parameter value at which curve is to be split

Autodesk.AutoCAD.Geometry.Curve3d.Explode(Autodesk.AutoCAD.Geometry.Interval)
Explodes the curve into its individual components.
interval:  Input interval of curve that is to be exploded

Autodesk.AutoCAD.Geometry.Curve3d.EvaluatePoint(System.Double)
Returns the point on the curve that corresponds to the input parameter value.
value:  Input parameter value at which curve is to be evaluated

Autodesk.AutoCAD.Geometry.Curve3d.GetSamplePoints(System.Int32)
Returns the specified number of points on the curve.
numSample:  Input number of points that are to be returned

Autodesk.AutoCAD.Geometry.Curve3d.GetSamplePoints(System.Double,System.Double,System.Double)
Returns a list of points on the curve between fromParameter and toParameter.
fromParameter:  Input starting parameter
toParameter:  Input ending parameter
chordHeight:  Input chord-height tolerance

Autodesk.AutoCAD.Geometry.Curve3d.GetNewSamplePoints(System.Double,System.Double,System.Double)
Returns a list of points on the curve.
fromParameter:  Input starting parameter
toParameter:  Input ending parameter
chordHeight:  Input chord-height tolerance

Autodesk.AutoCAD.Geometry.Curve3d.EndPoint
Returns the end point of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.StartPoint
Returns the start point of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.HasEndPoint
Returns true if curve has an endpoint.

Autodesk.AutoCAD.Geometry.Curve3d.HasStartPoint
Returns true if curve has a start point.

Autodesk.AutoCAD.Geometry.Curve3d.OrthoBoundBlock
Returns the bounding box of the curve.

Autodesk.AutoCAD.Geometry.Curve3d.BoundBlock
Returns the bounding box of the curve.