Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem
The GeoCoordinate class represents a coordinate reference system (CRS) definition.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.GetProjectionParamList(System.Boolean)
This is GetProjectionParamList, a member of class GeoCoordinateSystem.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.CreateAll(Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory)
This is CreateAll, a member of class GeoCoordinateSystem.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.CreateAll
This is CreateAll, a member of class GeoCoordinateSystem.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Create(System.String)
Instantiates a new GeoCoordinateSystem object from the current virtual catalog.
coordSysIdOrFullDef:  A coordinate system name. For example: "WORLD-MERCATOR"

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.WktRepresentation
This is WktRepresentation, a member of class GeoCoordinateSystem.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.XmlRepresentation
This is XmlRepresentation, a member of class GeoCoordinateSystem.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.GeodeticExtents
Get the geodetic extent of this CRS's, the range of longitude and latitude.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.CartesianExtents
Gets the Cartesian extent of this CRS's.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Offset
Gets the projection method parameter offset easting of this CRS.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Ellipsoid
Gets the related ellipsoid.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Datum
Gets the datum, if any, referenced by this this CRS.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.UnitScale
Gets a factor, that the length units of this CRS instance must be multiplied with to calculate the equivalent in meters.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.GeoUnit
Gets a factor, that the length units of this CRS instance must be multiplied with to calculate the equivalent in meters.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Unit
Gets the unit of the coordinate system axis of this CRS.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.ProjectionCode
Gets the unit of the coordinate system axis of this CRS.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Description
Gets the projection method of this CRS.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.Type
Get this definition's description, if there's any.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.EPSGcode
Get this CRS's EPSG code.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateSystem.ID
Get this CRS's identifier string, which is also being referred to as a (coordinate system) code.