Autodesk.AutoCAD.DatabaseServices.DetailViewStyle
The wrapper class for the AcDbDetailViewStyle class.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.#ctor
This is DetailViewStyle, a member of class DetailViewStyle.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.GetViewLabelPattern(Autodesk.AutoCAD.DatabaseServices.Field)
This method gets the pattern for view label.
field:  Input: a field object to be updated with the view label pattern master field.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.SetViewLabelPattern(System.String,Autodesk.AutoCAD.DatabaseServices.Field)
Sets the pattern for view label.
pattern:  Input: the pattern string for the view label.
field:  Input: optional pointer to a Field

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.DefaultViewName(System.Int32)
Returns the default detail view name based on the given index.
index:  The index of the default name.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ValidateViewName(System.String)
Validates the given name as a detail view name.
name:  Input: section name to validate.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.SetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
Sets this object's properties to the default values of given database.
dataBasePointer:  Input: database to be used

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.PostViewStyleToDb(Autodesk.AutoCAD.DatabaseServices.Database,System.String)
Add this view style object to the given database using the given name.
dataBasePointer:  Input: database to be updated.
styleName:  Input: name to be used for this view style.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BorderLineTypeId
The ObjectId of the linetype for the detail view border line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BorderLineColor
The color for the detail view border line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BorderLineWeight
The line weight for the detail view border line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ModelEdge
The type of model edge for the detail view.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ShowViewLabel
Indicates whether the section view should display the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelPattern
The pattern for the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelAlignment
The type of alignment for the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelAttachment
The type of attachment for the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelOffset
The offset distance for the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextHeight
The height for the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextColor
The color for detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextStyleId
The id of the text style table record to be associated to the detail view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ConnectionLineTypeId
The ObjectId of the linetype for the detail view symbol connection line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ConnectionLineColor
The color for the detail view symbol connection line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ConnectionLineWeight
The line weight for the detail view symbol connection line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BoundaryLineTypeId
The ObjectId of the linetype for the detail view symbol boundary line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BoundaryLineColor
The color for the detail view symbol boundary line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.BoundaryLineWeight
The line weight for the detail view symbol boundary line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ShowArrowheads
Indicates whether the detail symbol should display the detail view symbol arrowhead.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ArrowSymbolSize
The size for the detail view symbol arrowhead.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ArrowSymbolColor
The color for the detail view symbol arrowhead.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ArrowSymbolId
The objectId of the block table record used to represent the detail view symbol arrowhead.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierPlacement
The identifier placement flags relating to the detail view symbol boundary.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierOffset
The offset of the detail view symbol identifier from the extension line.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierHeight
The text height to be used by the identifier of detail view symbols.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierColor
The color to be used for the identifier detail view symbols.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierStyleId
The id of the text style table record to be associated to detail symbol identifier.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IsModifiedForRecompute
Indicates whether the detail view style has been modified and associated detail views and detail view symbols need to be updated.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.Description
The description of the detail view style.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.Name
The name of the detail view style.