Autodesk.AutoCAD.DatabaseServices.RasterImageDef
This .NET class wraps the AcDbRasterImageDef ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.LocateActivePath
Returns the path name of the actual file being currently used to define the image.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Embed
This function is currently unimplemented, but may appear in a future release.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Load
Enables "lazy loading" of the image pixel data from the source image file (specified by RasterImageDef.SourceFileName) into an ATIL object.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Unload(System.Boolean)
Immediately unloads the image data in RasImageDef from the Image Engine's working memory, but does not delete the RasImageDef itself. Triggers notification that causes all dependent RasterImage entities are redrawn as frames only. Requires that the RasterImageDef be open for writing.
If modifyDatabase is true, then undo recording will be done for the changes made to the RasterImageDef object.
modifyDatabase:  Input Boolean indicating whether or not to do undo recording

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.GetEntityCount(System.Boolean&)
Returns the number of RasterImage entities in the current drawing that are dependent upon this object for display graphics.
locked:  Input locked value

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.UpdateEntities
Causes all the RasterImage entities in the current drawing that are dependent upon this object to be redrawn when this object is next closed.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ImageCopy(System.Boolean)
Creates a copy of the image data, and returns a pointer to it. Note
Since the ATIL Engine doesn't make a physical copy of the image unless or until the original or the copy is modified, this function can be used for efficient read-only access to the source image data.
forceImageLoad:  Input Boolean indicating whether to load the image if it is not currently loaded

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.OpenImage
Returns the associated image data object for writing.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.CloseImage
Closes the associated image data object, and updates any changes to the image instances in AutoCAD.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SetImage(System.IntPtr,System.IntPtr,System.Boolean)
Directly specifies an in-memory Atil.Image or a custom Atil.FileReadDescriptor to be used. Either image or fileDescription can be null, but not both. Copies of the Atil.Image and Atil.FileReadDescriptor are retained by the RasterImageDef, so the caller's copy of these objects may be deleted at any time.
This function is intended for use by raster editing application developers.
The Loaded status must be false when this function is called. It can be used to construct an RasterImageDef object in lieu of calling ActiveFileName.
If image is not null and is valid, the "loaded" status is set true. Otherwise, "loaded" status is set to false. If image is null, then fileDescription must be a valid read or write Atil.FileReadDescriptor from which an image can be read on demand.
If fileDescription is not null and is valid, resolution and file type information is extracted from it. If fileDescription has a valid file path, it is used as the "active path." Otherwise, "active path" is set to the null string.
If modifyDatabase is true, undo recording will be done for changes made to the RasterImageDef object.
Use ImageModified and the RasterImageDefReactor mechanism to be notified of attempts to delete this image. Otherwise, the user may be able to Unload or Reload the image through the user interface, possibly losing image data that hasn't been saved to disk.
image:  Input NULL or pointer to valid Atil::Image object
fileDescription:  Input NULL or pointer to valid Atil::FileReadDescriptor object
modifyDatabase:  Input Boolean indicating whether to do undo recording

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.CreateImageDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Creates a new image dictionary if the function RasterImageDef.GetImageDictionary returns 0, indicating that no image dictionary exists.
database:  Input AutoCAD database in which to create the dictionary

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.GetImageDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the object ID of the image dictionary in the specified drawing database or 0 if the dictionary was not found.
database:  Input AutoCAD database in which to find the dictionary

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SuggestName(Autodesk.AutoCAD.DatabaseServices.DBDictionary,System.String)
Operates on the original image file name to produce a string as similar as possible to the original file name, but suitable for use in the image dictionary.
imageDictionary:  Input pointer to the (previously opened for reading) image dictionary within which this name must be unique
newImagePathName:  Input pointer to a string containing the source image file or path name

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ImageModified
Accesses the state of the internal "image data modified" flag, which is true if the image has been modified.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.UndoStoreSize
Accesses the current value of the Undo store size.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.FileDescCopy
Accesses a copy to this object's Atil.FileReadDescriptor member.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ResolutionUnits
Accesses the units in which the image resolution was specified in the source image file.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ResolutionMMPerPixel
Accesses the default physical size of a single image pixel in millimeters.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.FileType
Accesses the type of image file, such as BMP for a Windows bitmap.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ColorDepth
Accesses the number of bits per pixel for the source image data.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Organization
Accesses the pixel organization scheme of the source image file.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Size
Accesses the raw image size in pixels.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.IsLoaded
Assesses if the image is loaded.
Note
Due to lazy loading, the image may not be physically loaded in memory, even though IsLoaded returns true.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.IsEmbedded
Assesses if the image is embedded in the drawing file.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SearchForActivePath
This searches the local drives and network for a valid image file that matches the source file name that is saved in the drawing file.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.ActiveFileName
Accesses the path name of the actual file being currently used to define the image.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.SourceFileName
Accesses the path name of the externally referenced image file name.