Autodesk.AutoCAD.DatabaseServices.LoftedSurface
This .NET class wraps the AcDbLoftedSurface ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GetGuideProfile(System.Int32)
Returns the guide profile at zero-based index.
idx:  Input index of guide.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GetCrossSectionProfile(System.Int32)
Returns the cross section profile at zero-based index.
idx:  Input index of cross section.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.EndCrossSectionMagnitude
Gets and sets the magnitude of the surface takeoff vector at the last cross section, magnitude of the surface takeoff vector at the first profile.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.EndGuideCurveMagnitude
Gets and sets the magnitude of the surface takeoff vector at the last guide, magnitude of the surface takeoff vector at the first profile.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.StartCrossSectionMagnitude
Gets the magnitude of the surface takeoff vector at the first cross section, magnitude of the surface takeoff vector at the first profile.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.StartGuideCurveMagnitude
Gets the magnitude of the surface takeoff vector at the first guide, magnitude of the surface takeoff vector at the first profile.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.EndCrossSectionContinuity
Gets and set the continuity at the last cross section.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.EndGuideCurveContinuity
Gets the continuity at the last guide.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.StartCrossSectionContinuity
Gets the continuity at the first cross section.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.StartGuideCurveContinuity
Gets the continuity at the first guide.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.PathProfile
Gets the path profile that was used to create the surface, or null if no path was used.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GuideProfiles
Gets the list of guide profiles that were used to create the surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.CrossSectionProfiles
Gets the list of cross section profiles that were used to create the surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.NumberOfGuideCurves
Gets the number of guides for the surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.NumberOfCrossSections
Gets the number of cross sections for the surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.Closed
Indicates whether the lofted surface is closed.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.SurfaceType
Gets the type of lofted surface: ordinary loft, blend, or network.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.LoftOptions
Gets the loft options used to create this surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.PathEntity
Gets the path curve of the surface, or null if no path profile was used to create the surface.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.GuideCurves
Accesses the Autodesk.AutoCAD.DatabaseServices.Entity[] guide curves.

Autodesk.AutoCAD.DatabaseServices.LoftedSurface.CrossSections
Accesses the number of cross sections.