Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits
This .NET class wraps the AcGiSpotLightTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.SetHotspotAndFalloff(System.Double,System.Double)
Sets the hotspot and falloff angles for this light, in radians.
hotspot:  Input hotspot cone angle, in radians. Defines the brightest part of the spot light beam. Must be smaller than or equal to the falloff angle.
falloff:  Input falloff angle, in radians. Defines the full cone of light. This is also known as the field angle. Must be larger than or equal to the hotspot.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.LampColor
Returns the RGB value for the light's lamp color.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.PhysicalIntensity
Returns the physical intensity of the light in candela.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Attenuation
Returns the attenuation parameters for this light.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Falloff
Returns the falloff angle of this spotlight.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Hotspot
Returns the hotspot angle of this spotlight.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.TargetLocation
Returns the location (position) towards which the spot light is "pointing," in the coordinate space of the current context.

Autodesk.AutoCAD.GraphicsInterface.SpotLightTraits.Position
Returns the position of this light in the coordinate space of the current context..