Autodesk.AutoCAD.Runtime.VariableChangedEventArgs
Provides more information in conjunction with AcRxVariableReactor::changed event.

Autodesk.AutoCAD.Runtime.VariableChangedEventArgs.NewValue
Gets the new value of the variable.

Autodesk.AutoCAD.Runtime.VariableChangedEventArgs.OldValue
Gets the old value of the variable.