Autodesk.AutoCAD.DatabaseServices.LayoutEventArgs
This class provides data for various events of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.LayoutEventArgs.Name
Accesses the name of the layout that is changing.

Autodesk.AutoCAD.DatabaseServices.LayoutEventArgs.Id
Accesses the object ID of the layout that is changing.