Autodesk.AutoCAD.DatabaseServices.FitData
This class encapsulates the data returned by the Spline.getFitData() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.FitData.GetFitPoints
Returns the fit points of the spline, in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.FitData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.FitData)
Compares this object to other and returns true if they are equal.
other:  Object to compare with

Autodesk.AutoCAD.DatabaseServices.FitData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.FitData,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests other against this object for equivalency within the tolerance range specified by tolerance.
other:  Object to compare with
tolerance:  Tolerance range

Autodesk.AutoCAD.DatabaseServices.FitData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to compare with

Autodesk.AutoCAD.DatabaseServices.FitData.op_Inequality(Autodesk.AutoCAD.DatabaseServices.FitData,Autodesk.AutoCAD.DatabaseServices.FitData)
Returns true if a is not equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.FitData.op_Equality(Autodesk.AutoCAD.DatabaseServices.FitData,Autodesk.AutoCAD.DatabaseServices.FitData)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.FitData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.FitData.EndTangent
Accesses the end tangent of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.StartTangent
Accesses the start tangent of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.TangentsExist
Assesses whether or not specific tangents exist at the endpoints.

Autodesk.AutoCAD.DatabaseServices.FitData.FitTolerance
Accesses the fit tolerance of spline.

Autodesk.AutoCAD.DatabaseServices.FitData.Degree
Accesses the degree of spline.