Autodesk.AutoCAD.Runtime.Dictionary
This .NET class wraps the AcRxDictionary ObjectARX class.

Autodesk.AutoCAD.Runtime.Dictionary.At(System.Int32)
Returns an object at the id or NULL if the id was not found in the dictionary.
id:  Input dictionary entry ID of the object to retrieve.

Autodesk.AutoCAD.Runtime.Dictionary.At(System.String)
Returns an object at the key or NULL if the key was not found in the dictionary.
key:  Input lookup key string to search for.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.Int32,Autodesk.AutoCAD.Runtime.RXObject)
Puts value into the dictionary at index id.
id:  Input dictionary entry ID at which to put value.
value:  Input object to add to the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.String,Autodesk.AutoCAD.Runtime.RXObject,System.Int32&)
Puts value into the dictionary with key as the lookup key and returns the new entry's dictionary ID in retId for future searches for this object using retId instead of the key.
key:  Input lookup key string to use.
value:  Input object to add to the dictionary.
retId:  Output dictionary entry ID for the newly entered value.

Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.String,Autodesk.AutoCAD.Runtime.RXObject)
Puts value into the dictionary with key as the lookup key.
key:  Input lookup key string to use.
value:  Input item to add to the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.ResetKey(System.Int32,System.String)
Makes a copy of the newKey string and sets it to be the lookup key for the entry at index id.
id:  Input dictionary entry ID at which to put value.
newKey:  Input new lookup key string to use.

Autodesk.AutoCAD.Runtime.Dictionary.ResetKey(System.String,System.String)
Makes a copy of the newKey string and sets it to be the lookup key for the entry that currently has the lookup key, oldKey.
oldKey:  Input lookup key string to be found and changed.
newKey:  Input new lookup key string to use.

Autodesk.AutoCAD.Runtime.Dictionary.AtKeyAndIdPut(System.String,System.Int32,Autodesk.AutoCAD.Runtime.RXObject)
Adds value to the dictionary with an existing id.
newKey:  Input lookup key string to use.
id:  Input dictionary entry ID at which to put value.
value:  Input object to add to the dictionary.

Autodesk.AutoCAD.Runtime.Dictionary.Remove(System.Int32)
Removes the dictionary entry at index id.
id:  Input dictionary entry ID of the entry to remove.

Autodesk.AutoCAD.Runtime.Dictionary.Remove(System.String)
Removes the dictionary entry with lookup key, key.
key:  Input lookup key string for entry to be removed.

Autodesk.AutoCAD.Runtime.Dictionary.Contains(System.Int32)
Returns a value indicating whether the collection contains an object that matches value.
id:  Input dictionary entry ID.

Autodesk.AutoCAD.Runtime.Dictionary.Contains(System.String)
Returns a value indicating whether the collection contains an object that matches value.
key:  Input key to check for

Autodesk.AutoCAD.Runtime.Dictionary.IdAt(System.String)
Returns the dictionary ID for the entry indexed by key.
key:  Input lookup key string to search for.

Autodesk.AutoCAD.Runtime.Dictionary.KeyAt(System.Int32)
Returns a pointer to the lookup key string for the entry indexed by id.
id:  Input dictionary entry ID to search for.

Autodesk.AutoCAD.Runtime.Dictionary.GetEnumerator
Returns an enumerator object.

Autodesk.AutoCAD.Runtime.Dictionary.Count
The number of pointers to the Object.

Autodesk.AutoCAD.Runtime.Dictionary.IsSorted
Returns true if the dictionary is sorted.

Autodesk.AutoCAD.Runtime.Dictionary.IsCaseSensitive
Returns true or false depending on the value of the "ignoreCase" flag passed to the Kernel.newAcRxDictionary() function.

Autodesk.AutoCAD.Runtime.Dictionary.DeletesObjects
Returns true if the dictionary calls delete on the contained Object pointers dictionary is deleted.