Autodesk.AutoCAD.DatabaseServices.PatternDefinition
This class encapsulates the data returned by the Hatch.getPatternDefinitionAt() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.#ctor(System.Double,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.DoubleCollection)
Constructs a new object.
patternAngle:  Input pattern angle
basePoint:  Input base coordinates
offsetVector:  Input offset coordinates
dashOffsets:  Input dash offsets

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.GetDashes
Returns a collection of values that specify the dashes in the pattern definition.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.OffsetY
Accesses the offsetY coordinate.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.OffsetX
Accesses the offsetX coordinate.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.BaseY
Accesses the baseY coordinate.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.BaseX
Accesses the baseX coordinate.

Autodesk.AutoCAD.DatabaseServices.PatternDefinition.Angle
Accesses the pattern angle.