Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule
This .NET class wraps the ObjectARX class AcDbPropertiesOverrule.

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.List(Autodesk.AutoCAD.DatabaseServices.Entity)
This .NET method wraps the ObjectARX method AcDbPropertiesOverrule::list().

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.GetClassID(Autodesk.AutoCAD.DatabaseServices.DBObject)
This .NET method wraps the ObjectARX method AcDbPropertiesOverrule::getClassID().

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.DatabaseServices.PropertiesOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.