Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection
This class contains a collection of Object IDs.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Index of object to remove

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Clear
Erases the entire collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Add(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the object represented by value to this collection.
value:  Item to add

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if value exists within the collection.
value:  Item to check for

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns the zero-based index of the collection item that matches value.
value:  Item to search for

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts value at position index in the collection.
index:  Index to insert at
value:  Item to add

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the object represented by value from this collection.
value:  Object to remove

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.ObjectId[],System.Int32)
Copies objects in array to this collection, starting from index.
array:  Array to copy from
index:  Index to begin at

Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection.Count
Accesses the total number of objects in the collection.