Autodesk.AutoCAD.DatabaseServices.AssocVariable
AssocVariable keeps a name, value and expression.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.SetName(System.String,System.Boolean)
Sets the name of the variable. It does not verify the name. Names should be validated using the AssocVariable.ValidateNameAndExpression method before being used.
If the updateReferencingExpressions argument is true, it also finds all expressions referencing this variable and changes them (changes their strings) to reflect the new name of the variable.
newName:  New name of the variable.
updateReferencingExpressions:  If true, it finds all expressions referencing this variable and changes them (changes their strings) to reflect the new name of the variable.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.FindObjectByName(System.String,Autodesk.AutoCAD.Runtime.RXClass)
Using this AssocVariable as the starting context, searches for an object with the given name.
objectName:  The name of the searched-for object.
pObjectClass:  The class of the searched-for object (isKindOf() test is used).

Autodesk.AutoCAD.DatabaseServices.AssocVariable.ValidateNameAndExpression(System.String,System.String,System.String&)
Validates the given nameToValidate, expressionToValidate or both, to see whether they can be used as name and/or expression for this variable.
nameToValidate:  The variable name to validate. May be null.
expressionToValidate:  The variable expression to validate. May be null.
errorMessage:  Error string if the name or expression is not valid, empty otherwise.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.EvaluateExpression(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection&,Autodesk.AutoCAD.DatabaseServices.ResultBuffer[]&,Autodesk.AutoCAD.DatabaseServices.ResultBuffer&)
A helper method allowing to evaluate the expression at any time without modifying the variable and by explicitly providing values of the referenced objects (variables).
objectIds:  Array of ids of value-providing objects. It is an in/out argument. It is being appended during the evaluation with ids of the value-providing objects whose values have been obtained (currently these objects are only AssocVariables).
objectValues:  Array of values of value-providing objects. It is an in/out argument. It is being appended during the evaluation with values of the value-providing objects whose values have been obtained (currently these objects are only AssocVariables).
evaluatedExpressionValue:  Returned evaluated value of the expression.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.EvaluateExpression(Autodesk.AutoCAD.DatabaseServices.ResultBuffer&)
A helper method allowing the expression to evaluated at any time without modifying the variable.
evaluatedExpressionValue:  Returned evaluated value of the expression.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.AddGlobalCallback(Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback)
See the explanation of AssocVariableCallback.
pCallback:  The callback to be registered.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.RemoveGlobalCallback(Autodesk.AutoCAD.DatabaseServices.AssocVariableCallback)
See the explanation of AssocVariableCallback.
pCallback:  The callback to be unregistered.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.globalCallback
Returns a callback that is the collection of all callbacks registered by client code.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.EvaluatorId
Gets and sets the id of the expression evaluator that is used to parse the expression.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.Description
Gets and sets the description of the variable which is an arbitrary string.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.Value
Gets and sets the evaluated and cached value of the variable.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.Expression
Gets the expression or an empty string if the variable is a constant.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.Name
Gets the variable name which is an arbitrary string.