Autodesk.AutoCAD.Geometry.ClipBoundary2d
This .NET class wraps the AcGeClipBoundary2d ObjectARX class.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructs a n convex open or closed polyline clip boundary (one or more edges).
clipBoundary:  Input 2d point array

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs an ortho-aligned rectangular clip boundary.
firstCorner:  Input corner of a rectangle
secondCorner:  Input corner of a rectangle

Autodesk.AutoCAD.Geometry.ClipBoundary2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.Set(Autodesk.AutoCAD.Geometry.Point2dCollection)
Resets the object to an convex open or closed polyline clip boundary (one or more edges).
clipBoundary:  Input 2d point array

Autodesk.AutoCAD.Geometry.ClipBoundary2d.Set(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Resets the object to an ortho-aligned rectangular clip boundary.
firstCorner:  Input first corner of a rectangle
secondCorner:  Input second corner of a rectangle

Autodesk.AutoCAD.Geometry.ClipBoundary2d.ClipPolygon(Autodesk.AutoCAD.Geometry.Point2dCollection)
Clips the specified closed polygon against the clip boundary.
rawVertices:  Input 2d point array defining the input polygon. Self-intersecting and winding polygons are allowed.

Autodesk.AutoCAD.Geometry.ClipBoundary2d.ClipPolyline(Autodesk.AutoCAD.Geometry.Point2dCollection)
Clips the specified closed polyline against the clip boundary.
rawVertices:  Input 2d point array defining the input polyline. Self-intersecting and winding polylines are allowed.