Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel
This .NET class wraps the AcGsGraphicsKernel ObjectARX class.

Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel.#ctor(System.IntPtr)
This is GraphicsKernel, a member of class GraphicsKernel.

Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel.#ctor
This is GraphicsKernel, a member of class GraphicsKernel.