Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp
This is class Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.#ctor
This is PointCloudColorRamp, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.Color(System.Int32)
This is Color, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.SetColor(System.Int32,Autodesk.AutoCAD.Colors.EntityColor)
This is SetColor, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.Visibility(System.Int32)
This is Visibility, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.SetVisibility(System.Int32,System.Boolean)
This is SetVisibility, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.SetFrom(Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp)
This is SetFrom, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.Name
This is Name, a member of class PointCloudColorRamp.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp.NumColors
This is NumColors, a member of class PointCloudColorRamp.