Autodesk.AutoCAD.DatabaseServices.UnderlayFile
This .NET class wraps the AcDbUnderlayFile ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayFile.Items
Returns the underlay items that should be referenced.