Autodesk.AutoCAD.Geometry.Surface
This .NET class wraps the AcGeSurface ObjectARX class.

Autodesk.AutoCAD.Geometry.Surface.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Surface.GetClosestPointTo(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input point on surface

Autodesk.AutoCAD.Geometry.Surface.GetClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns in the output argument result the point on this surface that is closest to the point point.
point:  Input point on surface
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.GetEnvelope
Returns the minimal pair of intervals such that the corresponding rectangle in parameter space contains the parameter domain of this surface.

Autodesk.AutoCAD.Geometry.Surface.ParameterOf(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Surface.ParameterOf(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input point on surface

Autodesk.AutoCAD.Geometry.Surface.ParameterOf(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Inverse evaluator.
point:  Input point on surface
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point2d)
This method calls Surface.IsOn(Point3d point, Point2d parameterPoint, Tolerance tolerance) with tolerance set to Global.
point:  Input point on surface
parameterPoint:  Input parameter point

Autodesk.AutoCAD.Geometry.Surface.IsOn(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if the point point is on the surface within tolerance.
point:  Input point on surface
parameterPoint:  Input parameter point
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.ClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Surface.ClosestPointTo(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input point on surface

Autodesk.AutoCAD.Geometry.Surface.ClosestPointTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the point on this surface that is closest to the point point.
point:  Input point on surface
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.DistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Surface.DistanceTo(Point3d point, Tolerance tolerance) with tolerance set to Global.
point:  Input point on surface

Autodesk.AutoCAD.Geometry.Surface.DistanceTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Returns the minimal distance between this surface and the point point.
point:  Input point on surface
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.IsClosedInU
This method calls Surface.IsClosedInU(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Surface.IsClosedInU(Autodesk.AutoCAD.Geometry.Tolerance)
Indicates whether the surface is closed in the u direction or not.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.IsClosedInV
This method calls Surface.IsClosedInV(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Surface.IsClosedInV(Autodesk.AutoCAD.Geometry.Tolerance)
Indicates whether the surface is closed in the v direction or not.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Surface.EvaluatePoint(Autodesk.AutoCAD.Geometry.Point2d)
Evaluator.
parameter:  Input parameter point

Autodesk.AutoCAD.Geometry.Surface.ReverseNormal
The normal to the surface is evaluated either by formula
+ partialU.crossProduct(partialV).normalize()
or by formula
- partialU.crossProduct(partialV).normalize()
When a surface is created, the normal evaluation formula is set to the one with "+".

Autodesk.AutoCAD.Geometry.Surface.IsNormalReversed
Returns true if the normal to the surface is evaluated as
- partialU.crossProduct(partialV).normalize()
Returns false if the normal to the surface is evaluated as
+ partialU.crossProduct(partialV).normalize().