Autodesk.AutoCAD.DatabaseServices.CompositeConstraint
This class represents a composite constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.CompositeConstraint.OwnedConstraints
Gets the array of references to GeometricalConstraint objects which are owned by this composite constraint.