Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs
This class provides data for LayoutCopied event of the LayoutManager class.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.NewName
Accesses the name of the new layout.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.Name
Accesses the name of the layout that is copied.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.NewId
Accesses the object ID of the new layout.

Autodesk.AutoCAD.DatabaseServices.LayoutCopiedEventArgs.Id
Accesses the object ID of the layout that is copied.