Autodesk.AutoCAD.GraphicsInterface.GenericTexture
This .NET class wraps the AcGiGenericTexture ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.Clone
Creates a clone of the object and returns the clone.

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.Set(Autodesk.AutoCAD.GraphicsInterface.GenericTexture)
Sets the generic texture property from GenericTexture's generic collection parameters.
value:  Input new value

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.CopyFrom(Autodesk.AutoCAD.GraphicsInterface.GenericTexture)
Implemented for the Object protocol.

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.op_Equality(Autodesk.AutoCAD.GraphicsInterface.GenericTexture,Autodesk.AutoCAD.GraphicsInterface.GenericTexture)
operator.

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.GenericTexture,Autodesk.AutoCAD.GraphicsInterface.GenericTexture)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.GenericTexture.Definition
Assigns a new Variant value to this generic texture.