Autodesk.AutoCAD.DatabaseServices.UcsTableRecord
This .NET class wraps the AcDbUCSTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.GetUcsBaseOrigin(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Returns the origin point of the input orthographic view when UCSBASE is set to this UCS.
view:  Input orthographic view

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.SetUcsBaseOrigin(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the origin point of the input orthographic view when UCSBASE is set to this UCS.
origin:  Input origin point
view:  Input orthographic view

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.YAxis
Accesses the Y-axis of the table record.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.XAxis
Accesses the X-axis of the table record.

Autodesk.AutoCAD.DatabaseServices.UcsTableRecord.Origin
Accesses the origin of the table record.