Autodesk.AutoCAD.DatabaseServices.SectionSettings
This .NET class wraps the AcDbSectionSettings ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Reset(Autodesk.AutoCAD.DatabaseServices.SectionType)
Resets the settings for the specified section type to defaults based on the section type nSecType whose settings are to be reset.
nSecType:  Input section type to be reset

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Reset
Resets the settings for all section types.

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GenerationOptions(Autodesk.AutoCAD.DatabaseServices.SectionType)
Returns the section generation options flag expressed as an Generation> enumerator.
nSecType:  Input section type for which the generation options object is to be returned

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetGenerationOptions(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeneration)
Sets the generation options flag.
nSecType:  Input section type for which the generation options are to be set
nOptions:  Input options flag to set

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GetSourceObjects(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets the source object IDs which are used to generate the section when the generation option is SourceSelectedObjects.
nSecType:  Input section type for which the source objects are to be returned
ids:  Output collection of the object IDs

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetSourceObjects(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets the source object IDs, which are used to generate a section when the generation option is SourceSelectedObjects.
nSecType:  Input section type
ids:  Input source object IDs

Autodesk.AutoCAD.DatabaseServices.SectionSettings.DestinationBlock(Autodesk.AutoCAD.DatabaseServices.SectionType)
Returns the ID of the block which will be replaced during section generation when the generation option is DestinationReplaceBlock.
nSecType:  Input section type for which the destination block is to be returned

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetDestinationBlock(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the block name that will be replaced during section generation when the generation option is DestinationReplaceBlock.
nSecType:  Input section type for which the destination block is to be set
id:  Input ID of the block to be replaced during section generation

Autodesk.AutoCAD.DatabaseServices.SectionSettings.DestinationFile(Autodesk.AutoCAD.DatabaseServices.SectionType)
Returns the output file name to which the generated section will be written when the generation option is DestinationFile.
nSecType:  Input section type for which the destination file is to be returned

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetDestinationFile(Autodesk.AutoCAD.DatabaseServices.SectionType,System.String)
Sets the output file name to which the generated section will be written when the generation option is DestinationFile.
nSecType:  Input section type for which the destination file is to be set
pszFileName:  Input destination file name

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Visibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns true if the specified section geometry is visible, or false if it is not visible.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetVisibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the visibility of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
bVisible:  Input visibility value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Color(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the color of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Layer(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the layer name of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLayer(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the layer of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
pszLayer:  Input layer to set

Autodesk.AutoCAD.DatabaseServices.SectionSettings.Linetype(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the linetype of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLinetype(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the linetype of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
pszLinetype:  Input new linetype

Autodesk.AutoCAD.DatabaseServices.SectionSettings.LinetypeScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the linetype scale of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input section type

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetLinetypeScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the linetype scale of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
fScale:  Input new linetype scale

Autodesk.AutoCAD.DatabaseServices.SectionSettings.PlotStyleName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the plot style name of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetPlotStyleName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the plot style name of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
pszPlotStyleName:  Input plot style name

Autodesk.AutoCAD.DatabaseServices.SectionSettings.LineWeight(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the line weight of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.FaceTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the face transparency of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetFaceTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Int32)
Sets the face transparency of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
nTransparency:  Input edge transparency to set, in the range 0-100

Autodesk.AutoCAD.DatabaseServices.SectionSettings.EdgeTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the edge transparency of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetEdgeTransparency(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Int32)
Sets the edge transparency of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
nTransparency:  Input edge transparency to set, in the range 0-100

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchVisibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the visibility of hatch in the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchVisibility(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the hatch visibility of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
bVisible:  Input visibility value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GetHatchPatternType(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Gets the hatch pattern type of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.GetHatchPatternName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Gets the hatch pattern name of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchPatternType(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,Autodesk.AutoCAD.DatabaseServices.HatchPatternType)
Sets the hatch pattern type of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
nPatternType:  Input pattern type

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchPatternName(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.String)
Sets the hatch pattern name of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
sNewName:  Input hatch pattern name

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchAngle(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hatch angle of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchAngle(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the hatch angle of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
fAngle:  Input hatch angle

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchSpacing(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hatch spacing of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchSpacing(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the hatch spacing of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HatchScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hatch scale of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHatchScale(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Double)
Sets the hatch scale of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.HiddenLine(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the hidden line visibility of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetHiddenLine(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the hidden line visibility of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
bHiddenLine:  Input visibility value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.DivisionLines(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry)
Returns the visibility of division lines in the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value

Autodesk.AutoCAD.DatabaseServices.SectionSettings.SetDivisionLines(Autodesk.AutoCAD.DatabaseServices.SectionType,Autodesk.AutoCAD.DatabaseServices.SectionGeometry,System.Boolean)
Sets the division line visibility of the specified section geometry.
nSecType:  Input section type
nGeometry:  Input geometry value
bShow:  Input true if division lines are to be shown, or false if they are to be hidden

Autodesk.AutoCAD.DatabaseServices.SectionSettings.CurrentSectionType
Returns the current section type set in the section plane, expressed as an SectionSettings.SectionType enumerator.