Autodesk.AutoCAD.DatabaseServices.LongTransaction
This wraps the ObjectARX AcDbLongTransaction class.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.#ctor(System.IntPtr,System.Boolean)
Constructor.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.AddToWorkSet(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the ObjectARX AcDbLongTransaction::addToWorkSet() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.RemoveFromWorkSet(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the ObjectARX AcDbLongTransaction::removeFromWorkSet() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.SyncWorkSet
This wraps the ObjectARX AcDbLongTransaction::syncWorkSet() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.OriginObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This wraps the ObjectARX AcDbLongTransaction::originObject() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.WorkSetHas(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This wraps the ObjectARX AcDbLongTransaction::workSetHas() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.RegenWorkSetWithDrawOrder
This wraps the ObjectARX AcDbLongTransaction::regenWorkSetWithDrawOrder() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.DisallowDrawOrder
This wraps the ObjectARX AcDbLongTransaction::disallowDrawOrder() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.ActiveIdMap
This wraps the ObjectARX AcDbLongTransaction::activeIdMap() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.LongTransactionName
This wraps the ObjectARX AcDbLongTransaction::getLongTransactionName() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.DestinationBlock
This wraps the ObjectARX AcDbLongTransaction::destinationBlock() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.OriginBlock
This wraps the ObjectARX AcDbLongTransaction::originBlock() method.

Autodesk.AutoCAD.DatabaseServices.LongTransaction.Type
This wraps the ObjectARX AcDbLongTransaction::type() method.