Autodesk.AutoCAD.DatabaseServices.OrdinateDimension
This is class Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.#ctor(System.Boolean,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This is OrdinateDimension, a member of class OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.#ctor
This is OrdinateDimension, a member of class OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.LeaderEndPoint
This is LeaderEndPoint, a member of class OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.DefiningPoint
This is DefiningPoint, a member of class OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.Origin
This is Origin, a member of class OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.UsingXAxis
This is UsingXAxis, a member of class OrdinateDimension.

Autodesk.AutoCAD.DatabaseServices.OrdinateDimension.UsingYAxis
This is UsingYAxis, a member of class OrdinateDimension.