Autodesk.AutoCAD.Geometry.CompositeParameter
This value type encapsulates the data that defines the parameter of a point on a composite curve.

Autodesk.AutoCAD.Geometry.CompositeParameter.#ctor(System.Int32,System.Double)
Constructor.
segmentIndex:  Input segment index
localParameter:  Input local parameter

Autodesk.AutoCAD.Geometry.CompositeParameter.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.CompositeParameter.IsEqualTo(Autodesk.AutoCAD.Geometry.CompositeParameter)
This method calls CompositeParameter.IsEqualTo(CompositeParameter a, Tolerance tolerance) with tolerance set to Global.
a:  Input object to compare with

Autodesk.AutoCAD.Geometry.CompositeParameter.IsEqualTo(Autodesk.AutoCAD.Geometry.CompositeParameter,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a against this object for equivalency within the tolerance range specified by tolerance.
a:  Input Autodesk.AutoCAD.Geometry.CompositeParameter object.
tolerance:  Input Autodesk.AutoCAD.Geometry.Tolerance object.

Autodesk.AutoCAD.Geometry.CompositeParameter.op_Inequality(Autodesk.AutoCAD.Geometry.CompositeParameter,Autodesk.AutoCAD.Geometry.CompositeParameter)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.CompositeParameter.op_Equality(Autodesk.AutoCAD.Geometry.CompositeParameter,Autodesk.AutoCAD.Geometry.CompositeParameter)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.CompositeParameter.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.CompositeParameter.LocalParameter
Returns LocalParameter property value.

Autodesk.AutoCAD.Geometry.CompositeParameter.SegmentIndex
Returns the SegmentIndex property value.