Autodesk.AutoCAD.DatabaseServices.TableContent
This .NET class wraps the AcDbTableContent ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.TableContent.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.TableContent.GetCellStyle(System.Int32,System.Int32)
Gets the cell style of cell, row, or column.
row:  Input System.Int32 object; row index. This can be -1.
column:  Input System.Int32 object; column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.TableContent.SetCellStyle(System.Int32,System.Int32,System.String)
Sets the cell style of cell, row, or column.
row:  Input System.Int32 object; row index. This can be -1.
column:  Input System.Int32 object; column index. This can be -1.
cellStyle:  Input System.String object; cell style to set. The cell style should exist in the table style set in this table.

Autodesk.AutoCAD.DatabaseServices.TableContent.GetRowHeight(System.Int32)
Returns the row height.
row:  Input System.Int32 object; row index. It should be more than or equal to 0 and less than the number of rows.

Autodesk.AutoCAD.DatabaseServices.TableContent.SetRowHeight(System.Int32,System.Double)
Sets the row height.
row:  Input System.Int32 object.
height:  Input System.Double object.

Autodesk.AutoCAD.DatabaseServices.TableContent.GetColumnWidth(System.Int32)
Returns the column width.
column:  Input System.Int32 object; column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.TableContent.SetColumnWidth(System.Int32,System.Double)
Sets the column width.
column:  Input System.Int32 object; column index. It should be more than or equal to 0 and less than the number of columns.
width:  Input System.Double object; column width to set

Autodesk.AutoCAD.DatabaseServices.TableContent.TableStyleId
Returns the table style id.