Autodesk.AutoCAD.DatabaseServices.Solid3d
This .Net class wraps the ObjectARX class AcDbSolid3d.

Autodesk.AutoCAD.DatabaseServices.Solid3d.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateBox(System.Double,System.Double,System.Double)
Creates a box solid primitive with centroid at world origin.
lengthAlongX:  Input value for length of the box
lengthAlongY:  Input value for width of the box
lengthAlongZ:  Input value for height of the box

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateFrustum(System.Double,System.Double,System.Double,System.Double)
Creates a cylinder or cone with the world origin being centered about its diameter and positioned at half of the height.
height:  Input height for the frustum
radiusAlongX:  Input radius for the frustum in X direction
radiusAlongY:  Input radius for the frustum in Y direction
topRadius:  Input radius for top end of the frustum

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSphere(System.Double)
Creates a sphere with centroid at world origin and radius radius.
radius:  Input radius for the sphere

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateTorus(System.Double,System.Double)
Creates a torus with centroid at the WCS origin and using the WCS Z axis as the axis of rotational symmetry for the torus.
majorRadius:  Input major radius for the torus
minorRadius:  Input minor radius for the torus

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateWedge(System.Double,System.Double,System.Double)
Creates a wedge solid with center at the WCS origin.
lengthAlongX:  Input length for the wedge
lengthAlongY:  Input width for the wedge
lengthAlongZ:  Input height for the wedge

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreatePyramid(System.Double,System.Int32,System.Double,System.Double)
Creates a pyramid with the world origin being centered about its base and positioned at half of the height.
height:  Input height for pyramid
sides:  Input number of sides for pyramid
radius:  Input radius for inscribed circle of bottom polygon
topRadius:  Input radius for inscribed circle of top polygon

Autodesk.AutoCAD.DatabaseServices.Solid3d.Extrude(Autodesk.AutoCAD.DatabaseServices.Region,System.Double,System.Double)
Creates a solid by extruding region, a distance of height with a taper angle of taper.
region:  Input a region object
height:  Input height for extrusion
taperAngle:  Input taper angle in radians

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeAlongPath(Autodesk.AutoCAD.DatabaseServices.Region,Autodesk.AutoCAD.DatabaseServices.Curve,System.Double)
Creates a solid by extruding region along the path curve.
region:  Input a region object
path:  Input a curve object to extrude along
taperAngle:  Input extrusion taper angle in radians

Autodesk.AutoCAD.DatabaseServices.Solid3d.Revolve(Autodesk.AutoCAD.DatabaseServices.Region,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Creates a solid by revolving region around the axis defined by the projection of the line from axisPoint to axisPoint+axisDir onto the plane containing region.
region:  Input region object to be revolved
axisPoint:  Input point on the line to be projected to create the axis of revolution
axisDir:  Input vector representing the direction of the line to be projected to create the axis of revolution
angleOfRevolution:  Input angle of revolution in radians

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateRevolvedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Creates revolved solid by revolving an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateRevolvedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Creates revolved solid by revolving an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSweptSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates a swept solid by sweeping an entity or face along a path.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSweptSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates a swept solid by sweeping an entity or face along a path.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateExtrudedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,System.Double,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates an extruded solid by extruding an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateExtrudedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates an extruded solid by extruding an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateExtrudedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Creates an extruded solid by extruding an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateLoftedSolid(Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftOptions)
This wraps the ObjectARX AcDb3dSolid::createLoftedSolid () method.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateLoftedSolid(Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.LoftOptions)
This .NET method wraps the ObjectARX method AcDb3dSolid::createLoftedSolid.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateFrom(Autodesk.AutoCAD.DatabaseServices.Entity)
This is CreateFrom, a member of class Solid3d.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CheckInterference(Autodesk.AutoCAD.DatabaseServices.Solid3d)
Checks whether this solid interferes with otherSolid.
otherSolid:  Input pointer for other solid

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSection(Autodesk.AutoCAD.Geometry.Plane)
Creates an Region entity that represents the intersection of plane with the solid, and returns the region that represents the section.
plane:  Input plane to use as the section cutting plane

Autodesk.AutoCAD.DatabaseServices.Solid3d.StlOut(System.String,System.Boolean)
Writes out a Stereo Lithography (STL) representation of this solid to a file with the name fileName.
If asciiFormat is true, then the STL file format will be ASCII text; otherwise, it will be a binary format file. Any pre-existing fileName file will be overwritten.
fileName:  Input file name
asciiFormat:  Input Boolean indicating file format

Autodesk.AutoCAD.DatabaseServices.Solid3d.BooleanOperation(Autodesk.AutoCAD.DatabaseServices.BooleanOperationType,Autodesk.AutoCAD.DatabaseServices.Solid3d)
Performs Boolean operation between this solid and Solid.
operation:  Input type of Boolean operation
solid:  Input the other solid with which to carry out the Boolean operation

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.DatabaseServices.Surface,System.Boolean)
Slices the solid by a given surface. If the negativeHalfToo parameter is true, the negative side of the solid is also created.
surface:  Input the surface entity to be used to slice the solid
negativeHalfToo:  Input flag to indicate whether the other side of the solid is to be generated

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.DatabaseServices.Surface)
Slices the solid by a given surface.
surface:  Input the surface entity to be used to slice the solid

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.Geometry.Plane,System.Boolean)
Slices the solid with plane and sets the solid to be the portion on the positive normal side plane.
plane:  Input plane to be used for slicing the solid
negativeHalfToo:  Input flag to indicate whether the other side of the solid is to be generated

Autodesk.AutoCAD.DatabaseServices.Solid3d.Slice(Autodesk.AutoCAD.Geometry.Plane)
Slices the solid with plane and sets the solid to be the portion on the positive normal side plane.
plane:  Input plane to be used for slicing the solid

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyEdge(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Copies the specified edge as an AutoCAD entity, which can be an Line, AcDbCircle, AcDbArc, Ellipse, or AcDbSpline.
subEntityId:  Input subentity ID of an edge in the Solid3d

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyFace(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Copies the specified face as an AutoCAD entity, which can be an Region if the face is planar, or otherwise will be an Body.
subEntityId:  Input subentity ID of a face in the Solid3d

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double,System.Double)
Extrudes faces of a solid by a distance of height with a taper angle of taper.
subentityIds:  Input array of subentity IDs of faces to be extruded; these faces must be planar
height:  Input extrusion distance to be applied to the specified faces. Use a positive value to extrude in the direction of the face normals, which point outward from the solid. Use a negative value to extrude faces into the solid.
taper:  Input angle of tapering to be applied to the extrusion; the tapering is relative to the axis formed from the center of each face in the direction of the face normal when a positive height is used or in the opposite direction when a negative height is used; this value should be between half pi and half pi

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFacesAlongPath(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.Curve)
Extrudes the given faces along the given path curve entity, which must be an Line, AcDbArc, Circle, AcDbEllipse, AcDbSpline, AcDb2dPolyline, or a non-spline fit 3dPolyline.
subentityIds:  Input array of subentity IDs of faces to be extruded; these faces must be planar
path:  Input a curve object to extrude along

Autodesk.AutoCAD.DatabaseServices.Solid3d.ImprintEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
Intersects the given entity with the solid and imprints their intersection graph onto the solid.
entity:  Input entity to be imprinted

Autodesk.AutoCAD.DatabaseServices.Solid3d.CleanBody
Removes all edges and faces not necessary to support the topology of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetBody(System.Double)
Offsets all faces of the solid by the given distance.
offsetDistance:  Input distance to offset each face

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double)
Offsets the given faces of the solid by the given distance.
subentityIds:  Input array of subentity IDs of faces to be offset
offsetDistance:  Input distance to offset each face

Autodesk.AutoCAD.DatabaseServices.Solid3d.RemoveFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[])
Removes the given faces, growing the adjacent faces to fill the gaps.
subentityIds:  Input array of subentity IDs of faces to be removed

Autodesk.AutoCAD.DatabaseServices.Solid3d.SeparateBody
Separates the solid into a list of solids representing the additional disjoint volumes.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ShellBody(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double)
Changes the solid into a thin-walled solid shell with the faces offset to the outside of the solid when given positive offset distances, and to the inside when given negative distances.
subentityIds:  Input array of subentity IDs of faces to be removed from the shell
offsetDistance:  Input distance to offset each face

Autodesk.AutoCAD.DatabaseServices.Solid3d.TaperFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Tapers the given faces of the solid about the given base point and supplied draft vector by a given draft angle.
subentityIds:  Input array of subentity IDs of faces to be tapered
basePoint:  Input origin of the draft plane
draftVector:  Input draft direction vector
draftAngle:  Input draft angle

Autodesk.AutoCAD.DatabaseServices.Solid3d.TransformFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the given faces of the solid by applying the transformation matrix to rotate and or move the faces.
subentityIds:  Input array of subentity IDs of faces to be transformed
matrix:  Input rotation and/or translation matrix to be applied to the faces

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityColor(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Colors.Color)
Sets the color of the face or edge subentity of the Solid3d to the specified AutoCAD color.
subEntityId:  Input ID of subentity face or edge to be colored
color:  Input color for the subentity

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityColor(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Retrieves the color of the specified subentity.
subEntityId:  Input subentity Id

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets a material on a specified subentity.
subEntityId:  Input subentity Id
materialId:  Input object Id of the material

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Returns the material of the specified subentity.
subEntityId:  Input subentity Id

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.GraphicsInterface.Mapper)
Sets an explicit material mapper on the specified subentity.
subEntityId:  Input subentity ID
mapper:  Input a Mapper object

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Retrieves the material mapper for the specified subentity.
subEntityId:  Input subenttity Id

Autodesk.AutoCAD.DatabaseServices.Solid3d.ConvertToBrepAtSubentPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Converts individual history items from a parameterized type such as a box to a simple boundary-representation without its parameter or type information.
paths:  Input array of references to history items

Autodesk.AutoCAD.DatabaseServices.Solid3d.ChamferEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.SubentityId,System.Double,System.Double)
Creates chamfers at the edges of a solid.
subentityIds:  Input object ids of edges at which the chamfer will be applied
baseSubentityId:  Input object id of the base face where the chamfer will be applied
baseDist:  Input chamfer distance on the base face
otherDist:  Input chamfer distance on the other faces

Autodesk.AutoCAD.DatabaseServices.Solid3d.FilletEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
Creates rounded fillets the edges of a solid.
subentityIds:  Input object ids of the edges where the fillet will be applied
radius:  Input radius at the corresponding edge
startSetback:  Input start setback at the corresponding edge
endSetback:  Input end setback at the corresponding edge

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSculptedSolid(Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.Geometry.IntegerCollection)
This wraps the ObjectARX AcDb3dSolid::createSculptedSolid() method.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ProjectOnToSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Vector3d)
This wraps the ObjectARX AcDb3dSolid::projectOnToSolid() method.

Autodesk.AutoCAD.DatabaseServices.Solid3d.UsesGraphicsCache
This property is a wrapper for the AcDb3dSolid::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the region.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ShowHistory
Returns whether items in the history should be drawn when the system variable SHOWHIST is 1.

Autodesk.AutoCAD.DatabaseServices.Solid3d.RecordHistory
Returns whether the solid will record operations supported by solid history.

Autodesk.AutoCAD.DatabaseServices.Solid3d.NumChanges
Returns the number of changes that have occurred to this solid since it was first created.

Autodesk.AutoCAD.DatabaseServices.Solid3d.IsNull
Returns true if the solid does not have a ShapeManager object within itself.

Autodesk.AutoCAD.DatabaseServices.Solid3d.MassProperties
Returns the MassProperties property value.

Autodesk.AutoCAD.DatabaseServices.Solid3d.GeometricExtents
Accesses the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the entity, and return those points as an instance of class Extents in the "extents" parameter.

Autodesk.AutoCAD.DatabaseServices.Solid3d.Area
Returns the area set to the surface area of the solid.