Autodesk.AutoCAD.DatabaseServices.Table
This .NET class wraps the AcDbTable ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Table.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Table.ColumnWidth(System.Int32)
Obsolete. Returns the column width at the specified column index in the table.
col:  Input zero-based column index

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnWidth(System.Double)
Sets a uniform column width for all the columns in the table.
width:  Input uniform width to be used for all the columns in the table

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnWidth(System.Int32,System.Double)
Obsolete. Sets the column width at the specified column index in the table.
col:  Input zero-based column index
width:  Input width to be used for the specified column

Autodesk.AutoCAD.DatabaseServices.Table.RowHeight(System.Int32)
Obsolete. Returns the row height of the specified row in the table.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.SetRowHeight(System.Double)
Sets a uniform row height for all the rows in the table.
height:  Input height to be used for the specified row

Autodesk.AutoCAD.DatabaseServices.Table.SetRowHeight(System.Int32,System.Double)
Obsolete. Sets the row height for the specified row index in the table.
row:  Input zero-based row index
height:  Input height to be used for the specified row

Autodesk.AutoCAD.DatabaseServices.Table.MinimumColumnWidth(System.Int32)
Obsolete. Returns the minimum column width at the specified column index in the table.
col:  Input zero-based column index

Autodesk.AutoCAD.DatabaseServices.Table.MinimumRowHeight(System.Int32)
Obsolete. Returns the minimum row height for the specified row in the table.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.Alignment(System.Int32,System.Int32)
Obsolete. Returns the alignment of the text or block in the specified cell of the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetAlignment(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellAlignment)
Obsolete. Sets the alignment of the text or block in the specified cell of the table.
row:  Input specifying the zero-based row index for the ce
col:  Input specifying the zero-based column index for the cell
align:  Input enum value specifying the cell alignment

Autodesk.AutoCAD.DatabaseServices.Table.SetAlignment(Autodesk.AutoCAD.DatabaseServices.CellAlignment,System.Int32)
Obsolete. Sets the cell alignment for the specified row types.
align:  Input cell alignment
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.IsBackgroundColorNone(System.Int32,System.Int32)
Obsolete. Returns true if the background color for the specified cell in the table is set to no color value.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Int32,System.Int32,System.Boolean)
Obsolete. Enables or disables the background color for the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
value:  Input indicating whether to enable the background color for the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Boolean,System.Int32)
Obsolete. Enables or disables the background color for the specified row type.
value:  Input indicating whether to enable the background color for the specified row type
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.BackgroundColor(System.Int32,System.Int32)
Obsolete. Returns the background color of the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColor(System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Obsolete. Sets the background color of the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
color:  Input background color

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColor(Autodesk.AutoCAD.Colors.Color,System.Int32)
Obsolete. Sets the background color for the specified row types.
color:  Input background color
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.ContentColor(System.Int32,System.Int32)
Obsolete. Returns the color of the cell content for the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetContentColor(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Obsolete. Sets the color of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
color:  Input Autodesk.AutoCAD.Colors.Color object.

Autodesk.AutoCAD.DatabaseServices.Table.SetContentColor(System.Int32,System.Int32,Autodesk.AutoCAD.Colors.Color)
Obsolete. Sets the color of the cell content for the specified cell in the table.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.
color:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetContentColor(Autodesk.AutoCAD.Colors.Color,System.Int32)
Obsolete. Sets the content color for the specified row types.
color:  Input text color
rowType:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.TextStyle(System.Int32,System.Int32)
Obsolete. Returns the object ID of the text style of the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete. Sets the table object to use the TextStyleTableRecord specified by id for the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
id:  Input TextStyleTableRecord object ID

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Obsolete. Sets the table object to use the TextStyleTableRecord specified by id for the specified row types.
id:  Input TextStyleTableRecord object ID
rowTypes:  Input row types for which to set the text style

Autodesk.AutoCAD.DatabaseServices.Table.TextHeight(System.Int32,System.Int32)
Obsolete. Returns the text height of the specified table cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Int32,System.Double)
Obsolete. Sets the text height of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
height:  Input text height

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Double)
Obsolete. Sets the text height for the specified table cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
height:  Input text height

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Double,System.Int32)
Obsolete. Sets the text height for the specified row types.
height:  Input text height
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.GridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
Obsolete. Returns the grid lineweight of the specified edge of the cell.
row:  Input row index. This can be -1.
col:  Input column index. This can be -1.
edge:  Input integer specifying the edge index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.LineWeight)
Obsolete. Sets the grid line weight in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line types. Multiple grid line types can be combined using OR.
lineWeight:  Input grid line weight to set

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLineWeight(System.Int32,System.Int32,System.Int16,Autodesk.AutoCAD.DatabaseServices.LineWeight)
Obsolete. Sets the grid lineweight of the specified edge of the cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
edges:  Input specifying the edge index for the cell
value:  Input lineweight to be used for the grid at the specified edge of the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLineWeight(Autodesk.AutoCAD.DatabaseServices.LineWeight,System.Int32,System.Int32)
Obsolete. Sets the lineweight for a given grid line type and row type of the table object.
lineWeight:  Input lineweight value
borders:  Input grid line types for which to set the lineweight
rows:  Input row types for which to set the lineweight

Autodesk.AutoCAD.DatabaseServices.Table.GridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
Obsolete. Returns the grid color of the specified edge of the cell.
row:  Input object specifying the zero-based row index for the cell
col:  Input object specifying the zero-based column index for the cell
edge:  Input object specifying the edge index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.Colors.Color)
Obsolete. Sets the grid color of cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid color to set
color:  Input grid line types. Multiple grid line types can be combined using OR.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridColor(System.Int32,System.Int32,System.Int16,Autodesk.AutoCAD.Colors.Color)
Obsolete. Sets the grid color of the specified edge of the cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
edges:  Input specifying the edge index for the cell
color:  Input color to be used for the grid at the specified edge of the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridColor(Autodesk.AutoCAD.Colors.Color,System.Int32,System.Int32)
Obsolete. Sets the grid color for a given grid line type and row type of the table object.
color:  Input color
borders:  Input grid line types for which to set the color
rows:  Input row types for which to set the color

Autodesk.AutoCAD.DatabaseServices.Table.GridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
Obsolete. Returns the grid visibility of the specified edge of the cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
edge:  Input specifying the edge index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.Visibility)
Obsolete. Sets the grid visibility of cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line types. Multiple grid line types can be combined using OR.
visibility:  Input grid visibility to set

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Int32,System.Int32,System.Int16,System.Boolean)
Obsolete. Sets the grid visibility of the specified edge of the cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
edges:  Input specifying the edge index for the cell
value:  Input visibility to be used for the grid at the specified edge of the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Obsolete. Sets the grid visibility for a given grid line type and row type of the table object.
visible:  Input visibility
borders:  Input grid line type for which to set the visibility
rows:  Input row type for which to set the visibility

Autodesk.AutoCAD.DatabaseServices.Table.TableStyleOverrides
Obsolete. Returns the table style overrides.

Autodesk.AutoCAD.DatabaseServices.Table.ClearTableStyleOverrides(System.Int32)
Obsolete. Clears the overrides used in a table and its cells.
options:  Input System.Int32 object.

Autodesk.AutoCAD.DatabaseServices.Table.CellType(System.Int32,System.Int32)
Returns the cell type of the cell at the specified location in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetCellType(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.TableCellType)
Obsolete. Sets the cell type to be applied to the cell at the specified location in the table.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell
type:  Input enum value specifying the cell type

Autodesk.AutoCAD.DatabaseServices.Table.GetCellExtents(System.Int32,System.Int32,System.Boolean,Autodesk.AutoCAD.Geometry.Point3dCollection)
Obsolete. Gets the cell extents for the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
isOuterCell:  Output System.Boolean object indicating whether the specified cell is an outer cell
pts:  Output Autodesk.AutoCAD.Geometry.Point3dCollection object; point collection containing the cell extents information

Autodesk.AutoCAD.DatabaseServices.Table.AttachmentPoint(System.Int32,System.Int32)
Obsolete. Returns the attachment point of the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.CellStyleOverrides(System.Int32,System.Int32)
Obsolete. Returns the cell overrides for the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.DeleteCellContent(System.Int32,System.Int32)
Obsolete. Deletes the cell content for the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.RowType(System.Int32)
Obsolete. Returns the row type of the specified row in the table.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.TextStringConst(System.Int32,System.Int32)
Obsolete. Returns a copy of the null-terminated text string in the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.TextString(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.FormatOption)
Obsolete. Returns the formatted text string of the content.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
nOption:  Input format option

Autodesk.AutoCAD.DatabaseServices.Table.TextString(System.Int32,System.Int32)
Obsolete. Returns a copy of the null-terminated text string in the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,System.Int32,System.String)
Obsolete. Sets the text for the first content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents
text:  Input null-terminated text string

Autodesk.AutoCAD.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,System.String)
Obsolete. Sets the text as the value in the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
value:  Input null-terminated text string

Autodesk.AutoCAD.DatabaseServices.Table.FieldId(System.Int32,System.Int32)
Obsolete. Returns the object ID of the Field in the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetFieldId(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.CellOption)
Obsolete. Sets the id of the field at the specified index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
fieldId:  Input field id to set
option:  Input one of the CellOption values. If this is InheritCellFormat then the format of the cell will be set in the field.

Autodesk.AutoCAD.DatabaseServices.Table.SetFieldId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete. Sets the Field object ID for the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.
fieldId:  Input field id to set

Autodesk.AutoCAD.DatabaseServices.Table.TextRotation(System.Int32,System.Int32)
Obsolete. Returns the rotation angle of the text in the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextRotation(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.RotationAngle)
Obsolete. Sets the rotation angle of the text in the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
rot:  Input specifying the text rotation angle for the cell

Autodesk.AutoCAD.DatabaseServices.Table.IsAutoScale(System.Int32,System.Int32)
Obsolete. Returns the status of the mBlockAutoFit flag at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetAutoScale(System.Int32,System.Int32,System.Boolean)
Obsolete. Sets the auto fit flag, which determines whether to automatically fit the block into the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
autoFit:  Input Boolean indicating whether to auto fit the block at the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.BlockTableRecordId(System.Int32,System.Int32)
Obsolete. Returns the object ID of the block table record at the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Obsolete. Sets the id of the block table record for the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
blockId:  Input block table record id to set
autoFit:  Input System.Boolean object indicating whether to auto fit the block into the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Obsolete. Sets the object ID of the block table record at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
blockId:  Input BlockTableRecord object ID
autoFit:  Input indicating whether to auto fit the block into the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.BlockScale(System.Int32,System.Int32)
Obsolete. Returns the scale factor of the block reference at the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockScale(System.Int32,System.Int32,System.Double)
Obsolete. Sets the scale factor of the block reference at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
scale:  Input scale factor

Autodesk.AutoCAD.DatabaseServices.Table.BlockRotation(System.Int32,System.Int32)
Obsolete. Returns the rotation angle of the block reference at the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockRotation(System.Int32,System.Int32,System.Double)
Obsolete. Sets the rotation angle of the block reference at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
rotationalAngle:  Input rotation angle

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete. Gets the block attribute value if the content at the specified content index is a block with attributes.
row:  Input System.Int32 object specifying the zero-based row index for the cell
column:  Input System.Int32 object specifying the zero-based column index for the cell
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
attDefId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object.

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete. Gets the attribute value from the block cell using the specified object ID key.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
attributeDefinitionId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object.

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Obsolete. Sets the block attribute value if the content at the specified content index is a block with attributes.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents
attDefId:  Input the object ID of the AttributeDefinition object
value:  Input character string specifying attribute value

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Obsolete. Sets the block attribute value if the content at the specified content index is a block with attributes.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
attributeDefinitionId:  Input the object ID of an of AttributeDefinition object
value:  Input character string specifying attribute v

Autodesk.AutoCAD.DatabaseServices.Table.InsertColumns(System.Int32,System.Double,System.Int32)
Inserts one or more columns at the specified index.
col:  Input specifying the zero-based column index for the cell
width:  Input width for the inserted columns
columns:  Input number of columns to insert

Autodesk.AutoCAD.DatabaseServices.Table.DeleteColumns(System.Int32,System.Int32)
Deletes the specified number of columns from the table at the column index col.
col:  Input System.Int32 object specifying the zero-based column index for the cell
columns:  Input System.Int32 object number of columns to delete

Autodesk.AutoCAD.DatabaseServices.Table.InsertRows(System.Int32,System.Double,System.Int32)
Inserts one or more rows at the specified index.
row:  Input specifying the zero-based row index for the cell
height:  Input height for the inserted rows
rows:  Input number of rows to insert

Autodesk.AutoCAD.DatabaseServices.Table.DeleteRows(System.Int32,System.Int32)
Deletes the specified number of rows from the table at the row index row.
row:  Input System.Int32 object specifying the zero-based row index for the cell
rows:  Input System.Int32 object number of rows to delete

Autodesk.AutoCAD.DatabaseServices.Table.MergeCells(Autodesk.AutoCAD.DatabaseServices.CellRange)
This function merges cells within the specified range.
range:  Input range of cells to merge

Autodesk.AutoCAD.DatabaseServices.Table.UnmergeCells(Autodesk.AutoCAD.DatabaseServices.CellRange)
This function unmerges a cells within a specified range.
range:  Input the cell range

Autodesk.AutoCAD.DatabaseServices.Table.IsMergedCell(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellRange&)
Obsolete. Returns true if the specified cell is within merged cells.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
range:  Output the range of merged cells

Autodesk.AutoCAD.DatabaseServices.Table.GenerateLayout
This function will update the table object according to the current table style.

Autodesk.AutoCAD.DatabaseServices.Table.RecomputeTableBlock(System.Boolean)
This function updates the block table record the table object references to match any changes made to the table object since the last time the block table record was updated.
If forceUpdate is true, then the block table record will be updated regardless of whether or not the table object has had any changes since the last time the block table record was updated. If forceUpdate is false, then the block table record will only be updated if the table object has been changed since it was opened, is not currently erased, and is not in the middle of an undo operation.
forceUpdate:  Input indicating whether to force an update on the screen

Autodesk.AutoCAD.DatabaseServices.Table.HitTest(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
This function performs a hit test for the specified point and viewing direction.
point:  Input 3D point in WCS specifying the input picking point
viewVector:  Input 3D vector in WCS specifying the view direction for the hit test

Autodesk.AutoCAD.DatabaseServices.Table.ClearSubSelection
Removes the subselection set of cells from the table.

Autodesk.AutoCAD.DatabaseServices.Table.DataType(System.Int32,System.Int32)
Obsolete. Returns the data type and unit type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.UnitType(System.Int32,System.Int32)
Obsolete. Returns the object ID of the unit type of the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetDataType(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.DataTypeParameter)
Obsolete. Sets the data type of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
dataType:  Input data type to set

Autodesk.AutoCAD.DatabaseServices.Table.Format(System.Int32,System.Int32)
Obsolete. Returns the cell format based on the zero-based row and column index.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetFormat(System.Int32,System.Int32,System.String)
Obsolete. For internal use.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
pFormat:  Input format string to set

Autodesk.AutoCAD.DatabaseServices.Table.SetFormat(System.String,System.Int32)
Obsolete. For internal use.
pFormat:  Input System.String object.
rowTypes:  Input System.Int32 object.

Autodesk.AutoCAD.DatabaseServices.Table.Value(System.Int32,System.Int32)
Obsolete. Returns the content type of the content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,System.String,Autodesk.AutoCAD.DatabaseServices.ParseOption)
Obsolete. Sets the value of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
value:  Input value to set
parseOption:  Input Autodesk.AutoCAD.DatabaseServices.ParseOption object; parse option

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,System.Object,Autodesk.AutoCAD.DatabaseServices.ParseOption)
Obsolete. Sets the value of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
value:  Input value to be set
parseOption:  Input Autodesk.AutoCAD.DatabaseServices.ParseOption object; parse option

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,System.Object)
Obsolete. Sets the value of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
value:  Input value to be set

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.String,Autodesk.AutoCAD.DatabaseServices.ParseOption)
Obsolete. Parses the specified text, converts it to a value of appropriate data type and sets it in the cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.
pText:  Input text to convert to value and set
nOption:  Input parse option.

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Object)
Obsolete. Sets the value of the first content of a cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
pValue:  Input value to set

Autodesk.AutoCAD.DatabaseServices.Table.ResetValue(System.Int32,System.Int32)
Obsolete. Resets the value in a particular cell.
row:  Input object specifying the zero-based row index for the cell
col:  Input object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.Select(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean,System.Boolean,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Selects a cell in the table using a specified point, viewing direction, and orientation. If Paths is not null, the cell subentities, including bounding grid lines, MText, and block insert, will be returned by Paths.
pickingPoint:  Input 3D point in WCS specifying the input picking point
hitTestViewDirection:  Input 3D vector in WCS specifying the view direction for the hit test
hitTestViewOrientation:  Input 3D vector in WCS specifying the view orientation for the hit test
allowOutside:  Input indicating whether a pick point outside the table will select a cell
inPickFirst:  Input indicating if the entity is already in the pickfirst set (true) or if the pickfirst logic should attempt to subselect the entity directly (false)
paths:  Output SubentPathArray

Autodesk.AutoCAD.DatabaseServices.Table.SelectSubRegion(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SelectType,System.Boolean,System.Boolean,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
Selects a set of cells in the table using a specified window box, viewing direction, and orientation.
If Paths is not null, the cell subentities, including bounding grid lines, MTexts, and block inserts, will be returned in Paths.
cornerPoint1:  Input 3D point in WCS specifying the first corner point of the window box selection
cornerPoint2:  Input 3D point in WCS specifying the second corner point of the window box selection
selectionViewDirection:  Input 3D vector in WCS specifying the view direction of the selection
hitTestViewDirection:  Input 3D vector in WCS specifying the view orientation of the hit test
selectionType:  Input SelectType enum specifying the selection type
includeCurrentSelection:  Input System.Boolean object indicating whether the selected cells returned will include currently selected cells and newly selected cells or only newly selected cells
inPickFirst:  Input System.Boolean object indicating if the entity is already in the pickfirst set (true) or if the pickfirst logic should attempt to subselect the entity directly (false)
paths:  Output SubentPathArray

Autodesk.AutoCAD.DatabaseServices.Table.ReselectSubRegion(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This function provides the subentities of the current subselection cells.
paths:  Output array of FullSubentPath

Autodesk.AutoCAD.DatabaseServices.Table.SetSize(System.Int32,System.Int32)
Resizes the table.
numRows:  Input number of rows
numCols:  Input number of columns

Autodesk.AutoCAD.DatabaseServices.Table.CanInsertRow(System.Int32)
Checks whether new rows can be inserted at the specified index.
index:  Input System.Int32 object to check if new row can be inserted.

Autodesk.AutoCAD.DatabaseServices.Table.CanInsertColumn(System.Int32)
Obsolete. Checks whether new columns can be inserted at the specified index.
index:  Input System.Int32 object to check if new column can be inserted.

Autodesk.AutoCAD.DatabaseServices.Table.InsertRowsAndInherit(System.Int32,System.Int32,System.Int32)
Inserts the specified number of new rows into the table at the row index.
index:  Input index at which to insert the new rows
inheritFrom:  Input index of the row to inherit the format for the new rows. It can be -1. If it is -1 new rows don't inherit any format and they use default format.
numRows:  Input number of rows to insert

Autodesk.AutoCAD.DatabaseServices.Table.InsertColumnsAndInherit(System.Int32,System.Int32,System.Int32)
Inserts the specified number of new columns into the table at the column index col.
col:  Input index at which to insert the new columns
inheritFrom:  Input index of the column to inherit the format for the new columns. It can be -1. If it is -1 new columns don't inherit any format and they use default format.
numCols:  Input number of columns to insert

Autodesk.AutoCAD.DatabaseServices.Table.CanDeleteRows(System.Int32,System.Int32)
Obsolete. Checks whether the row can be deleted from the specified index.
index:  Input System.Int32 object to check if a row can be deleted.
nCount:  Input number of rows to delete

Autodesk.AutoCAD.DatabaseServices.Table.CanDeleteColumns(System.Int32,System.Int32)
Obsolete. Checks whether the column can be deleted from the specified index.
index:  Input System.Int32 object to check if a column can be deleted.
nCount:  Input number of columns to delete

Autodesk.AutoCAD.DatabaseServices.Table.GetEnumerator(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.TableEnumeratorOption)
Obsolete. Returns the enumerator object within the specified range based on the table enumeration option.
range:  Input range of cells to delete the contents
option:  Input enumerator option

Autodesk.AutoCAD.DatabaseServices.Table.GetEnumerator
Obsolete. Returns the enumerator object.

Autodesk.AutoCAD.DatabaseServices.Table.IsEmpty(System.Int32,System.Int32)
Obsolete. Checks whether the content of the specified cell is empty
Returns true if the cell is empty, false if not.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetMergeRange(System.Int32,System.Int32)
Obsolete. Returns merge range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.IsContentEditable(System.Int32,System.Int32)
Obsolete. This function checks the cell state to determine if a cell content can be modified.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.IsFormatEditable(System.Int32,System.Int32)
Obsolete. This function checks the cell state to determine if a cell format can be modified.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetCellState(System.Int32,System.Int32)
Obsolete. Returns the cell state.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetCellState(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellStates)
Obsolete. Sets the cell state.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
cellState:  Input cell state to set. This will replace all the bits of the current state

Autodesk.AutoCAD.DatabaseServices.Table.CreateContent(System.Int32,System.Int32,System.Int32)
Obsolete. This function is called to create additional contents for a cell; one is created by default.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetNumberOfContents(System.Int32,System.Int32)
Obsolete. Returns the number of contents in the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.MoveContent(System.Int32,System.Int32,System.Int32,System.Int32)
Obsolete. Moves a content in a cell from one position to another position within the cell Note: This method is deprecated and may be removed in a future release..
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
fromIndex:  Input index of the content to move
toIndex:  Input get index to which the content should be moved

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(Autodesk.AutoCAD.DatabaseServices.CellRange)
Obsolete. Deletes all the contents in a range of cells.
range:  Input range of cells to delete the contents

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(System.Int32,System.Int32,System.Int32)
Obsolete. Deletes content from a cell from the specified index.
row:  Input row index. It should be more than or equal to 0 and less than the number of row.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(System.Int32,System.Int32)
Obsolete. Deletes all the contents in a cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetContentTypes(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the content type of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetContentTypes(System.Int32,System.Int32)
Obsolete. Returns the content type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetValue(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.FormatOption)
Obsolete. Returns the value of the first content based on the specified contentIndex.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
formatOption:  Input Autodesk.AutoCAD.DatabaseServices.FormatOption object; format option

Autodesk.AutoCAD.DatabaseServices.Table.GetValue(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the value of the first content based on the specified contentIndex.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataFormat(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the data format of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataFormat(System.Int32,System.Int32)
Obsolete. Returns the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataFormat(System.Int32,System.Int32,System.Int32,System.String)
Obsolete. Sets the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
format:  Input data format to set

Autodesk.AutoCAD.DatabaseServices.Table.SetDataFormat(System.Int32,System.Int32,System.String)
Obsolete. Sets the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
format:  Input data format to set

Autodesk.AutoCAD.DatabaseServices.Table.GetTextString(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.FormatOption)
Obsolete. Returns the text for the first content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents
formatOption:  Input null-terminated text string

Autodesk.AutoCAD.DatabaseServices.Table.GetTextString(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the text for the first content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents

Autodesk.AutoCAD.DatabaseServices.Table.HasFormula(System.Int32,System.Int32,System.Int32)
Obsolete. Returns true if the content at the specified index is a formula.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetFormula(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the formula if the content at the specified content index has a formula, otherwise returns empty string.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetFormula(System.Int32,System.Int32,System.Int32,System.String)
Obsolete. Sets the formula at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
formula:  Input formula to set.

Autodesk.AutoCAD.DatabaseServices.Table.GetFieldId(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the id of the field at the specified index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockTableRecordId(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the id of the block table record for the content at the specified content index.
row:  Input System.Int32 object specifying the zero-based row index for the cell
column:  Input System.Int32 object specifying the zero-based column index for the cell
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetCustomData(System.Int32,System.Int32,System.String)
Obsolete. Gets the custom data value set in cell, row, or column as key-value pairs.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
key:  Input key to store the custom data

Autodesk.AutoCAD.DatabaseServices.Table.GetCustomData(System.Int32,System.Int32)
Obsolete. Returns the custom data value set in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.Table.SetCustomData(System.Int32,System.Int32,System.String,System.Object)
Obsolete. Sets the custom data value set in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
key:  Input key to use for the custom data
value:  Input custom data to set. If this is NULL, it deletes the custom data.

Autodesk.AutoCAD.DatabaseServices.Table.SetCustomData(System.Int32,System.Int32,System.Int32)
Obsolete. Sets the custom data value set in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
data:  Input custom data to set. If this is NULL, it deletes the custom data.

Autodesk.AutoCAD.DatabaseServices.Table.GetCellStyle(System.Int32,System.Int32)
Obsolete. Returns the the cell style of a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.Table.SetCellStyle(System.Int32,System.Int32,System.String)
Obsolete. Sets the the cell style of a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
styleName:  Input cell style to set. The cell style should exist in the table style set in this table.

Autodesk.AutoCAD.DatabaseServices.Table.GetMargin(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellMargins)
Obsolete. Returns the margin of cell, row, or column.
row:  Input row index. Pass the value -1 if you are only concerned with the column.
column:  Input row index. Pass the value -1 if you are only concerned with the row.
margin:  Input margin type to get

Autodesk.AutoCAD.DatabaseServices.Table.SetMargin(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellMargins,System.Double)
Obsolete. Sets the margin of cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
margin:  Input margin type to set. Multiple margin types can be combined using OR
value:  Input margin value to set

Autodesk.AutoCAD.DatabaseServices.Table.GetContentColor(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the color of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataType(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the data type and unit type of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetTextStyleId(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the text style of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyleId(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete. Sets the text style of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
id:  Input text style

Autodesk.AutoCAD.DatabaseServices.Table.GetTextHeight(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the text height of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetRotation(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the rotation angle of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetRotation(System.Int32,System.Int32,System.Int32,System.Double)
Obsolete. Sets the rotation angle of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
angle:  Input angle in radians

Autodesk.AutoCAD.DatabaseServices.Table.GetIsAutoScale(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the status of the mBlockAutoFit flag at the specified cell in the table.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetIsAutoScale(System.Int32,System.Int32,System.Int32,System.Boolean)
Obsolete. Sets the status of the autoFit flag at the specified cell in the table.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
autoFit:  Input status of autofit flag

Autodesk.AutoCAD.DatabaseServices.Table.GetScale(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the scale of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetScale(System.Int32,System.Int32,System.Int32,System.Double)
Obsolete. Sets the scale of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
scale:  Input angle in radians

Autodesk.AutoCAD.DatabaseServices.Table.GetContentLayout(System.Int32,System.Int32)
Obsolete. Returns the content layout of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetContentLayout(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellContentLayout)
Obsolete. Sets the content layout of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
layout:  Input layout to set

Autodesk.AutoCAD.DatabaseServices.Table.GetMergeAllEnabled(System.Int32,System.Int32)
Obsolete. Returns true if the merge-all flag is enabled in a row or column, else false.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetMergeAllEnabled(System.Int32,System.Int32,System.Boolean)
Obsolete. Enables the merge-all flag in a row or column.
row:  Input zero-based row index
column:  Input zero-based column index
enable:  Input status of merge all for the cell

Autodesk.AutoCAD.DatabaseServices.Table.GetOverrides(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Obsolete. Returns the override in specified grid line type in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.Table.GetOverrides(System.Int32,System.Int32,System.Int32)
Obsolete. Returns the override of cell, row, column, or content.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
contentIndex:  Input content index.

Autodesk.AutoCAD.DatabaseServices.Table.SetOverrides(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.CellProperties)
Obsolete. Sets the override in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line type
override:  Input override to set

Autodesk.AutoCAD.DatabaseServices.Table.SetOverrides(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellProperties)
Obsolete. Sets the override in cell, row, column, or content.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
contentIndex:  Input content index. This can be -1.
override:  Input override to set

Autodesk.AutoCAD.DatabaseServices.Table.RemoveAllOverrides(System.Int32,System.Int32)
Obsolete. Removes all the overrides in cell, row, or column.
row:  Input row index. Insert the value -1 if you are only concerned with a column.
column:  Input column index. Insert the value -1 if you are only concerned with a row.

Autodesk.AutoCAD.DatabaseServices.Table.GetGridLineStyle(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Obsolete. Returns the grid line style in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input Autodesk.AutoCAD.DatabaseServices.GridLineType object; grid line type

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLineStyle(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.GridLineStyle)
Obsolete. Sets the grid line style in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line types. Multiple grid line types can be combined using OR.
lineStyle:  Input grid line style to set

Autodesk.AutoCAD.DatabaseServices.Table.GetGridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the grid line weight in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.Table.GetGridLinetype(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Obsolete. Returns the grid line type in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input Autodesk.AutoCAD.DatabaseServices.GridLineType object. To specify cell pass a valid row and column indices; to specify row pass a valid row index and pass -1 as column index; to specify column pass a valid column index and pass -1 as row index

Autodesk.AutoCAD.DatabaseServices.Table.SetGridLinetype(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete. Sets the grid line type in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line types. Multiple grid line types can be combined using OR.
lineStyle:  Input grid line style to set

Autodesk.AutoCAD.DatabaseServices.Table.GetGridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Obsolete. Returns the grid color of cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.Table.GetGridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Obsolete. Returns the grid visibility of cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line type

Autodesk.AutoCAD.DatabaseServices.Table.GetGridDoubleLineSpacing(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Obsolete. Returns the grid double line spacing in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input Autodesk.AutoCAD.DatabaseServices.GridLineType object; grid line type

Autodesk.AutoCAD.DatabaseServices.Table.SetGridDoubleLineSpacing(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,System.Double)
Obsolete. Sets the grid double line spacing in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line types. Multiple grid line types can be combined using OR.
spacing:  Input grid double line spacing to set

Autodesk.AutoCAD.DatabaseServices.Table.GetGridProperty(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType)
Returns the grid line weight in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input Autodesk.AutoCAD.DatabaseServices.GridLineType object; grid line type

Autodesk.AutoCAD.DatabaseServices.Table.SetGridProperty(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.GridPropertyParameter)
Sets the grid line properties of cells, rows, or columns in a range of cells.
rangeIn:  Input cell range, row range, or column range.
gridLineTypes:  Input grid line types. Multiple grid line types can be combined using OR.
gridProp:  Input grid line properties to set.

Autodesk.AutoCAD.DatabaseServices.Table.SetGridProperty(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.GridLineType,Autodesk.AutoCAD.DatabaseServices.GridPropertyParameter)
Sets the grid line weight in a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
gridLineType:  Input grid line types. Multiple grid line types can be combined using OR.
gridProperty:  Input grid line properties to set.

Autodesk.AutoCAD.DatabaseServices.Table.IsLinked(System.Int32,System.Int32)
Obsolete. Checks whether a cell is linked to a data source.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange)
Obsolete. Gets the data links set in the specified range.
range:  Input range to get the data links. If this is NULL it gets all the data links in the table.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLink
Gets the data link if the cell is linked to a data source using data link.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLink(System.Int32,System.Int32)
Obsolete. Returns the id of the data link if the specified cell is linked to a data source using a data link.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Obsolete. Sets the specified data link in a cell.
range:  Input range to get the data links. If this is NULL it gets all the data links in the table.
dataLinkId:  Output reference to an array to receive the data link IDs.
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Obsolete. Sets the specified data link in a cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dataLinkId:  Input the data link object
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLinkRange(System.Int32,System.Int32)
Obsolete. Returns the data link range if the specified cell is part of a linked range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.RemoveDataLink
Removes all the data links in the table.

Autodesk.AutoCAD.DatabaseServices.Table.RemoveDataLink(System.Int32,System.Int32)
Obsolete. Removes the data link in the specified cell.
row:  Input row index. Insert the value -1 if you are only concerned with a column.
column:  Input column index. Insert the value -1 if you are only concerned with a row.

Autodesk.AutoCAD.DatabaseServices.Table.UpdateDataLink(Autodesk.AutoCAD.DatabaseServices.UpdateDirection,Autodesk.AutoCAD.DatabaseServices.UpdateOption)
Updates all the data links in the table.
dir:  Input direction to update
option:  Input options to update

Autodesk.AutoCAD.DatabaseServices.Table.UpdateDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.UpdateDirection,Autodesk.AutoCAD.DatabaseServices.UpdateOption)
Updates the data link at the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dir:  Input direction of update
option:  Input options to update

Autodesk.AutoCAD.DatabaseServices.Table.GetBreakHeight(System.Int32)
Returns the break height of the specified table when table breaking is enabled.
index:  Input table index. It should be more than or equal to 0 and less than the number of multiple tables, when the table breaks.

Autodesk.AutoCAD.DatabaseServices.Table.SetBreakHeight(System.Int32,System.Double)
Sets the break height of the specified table when table breaking is enabled.
index:  Input table index. It should be more than or equal to 0 and less than the number of multiple tables, when the table breaks.
height:  Input break height

Autodesk.AutoCAD.DatabaseServices.Table.GetBreakOffset(System.Int32)
Returns the table break offset of the table.
index:  Input table index. It should be more than or equal to 0 and less than the number of multiple tables, when the table breaks.

Autodesk.AutoCAD.DatabaseServices.Table.SetBreakOffset(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the table break offset of the table.
index:  Input table index. It should be more than or equal to 0 and less than the number of multiple tables, when the table breaks.
offset:  Input offset value

Autodesk.AutoCAD.DatabaseServices.Table.GetBreakSpacing
Returns the table break spacing.

Autodesk.AutoCAD.DatabaseServices.Table.SetBreakSpacing(System.Double)
Sets the table break spacing.
spacing:  Input spacing

Autodesk.AutoCAD.DatabaseServices.Table.CopyFrom(Autodesk.AutoCAD.DatabaseServices.Table,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions,Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange)
Copies content and format from source table.
source:  Input table source
options:  Input table copy options
sourceRange:  Input source cell range
targetRange:  Input target cell range

Autodesk.AutoCAD.DatabaseServices.Table.CopyFrom(Autodesk.AutoCAD.DatabaseServices.LinkedTableData,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions,Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange)
Copies content and format from source table.
source:  Input source table
options:  Input copy option
sourceRange:  Input source cell range
targetRange:  Input target cell range

Autodesk.AutoCAD.DatabaseServices.Table.CopyFrom(Autodesk.AutoCAD.DatabaseServices.LinkedTableData,Autodesk.AutoCAD.DatabaseServices.TableCopyOptions)
Copies content and format from source table.
source:  Input source table
options:  Input copy option

Autodesk.AutoCAD.DatabaseServices.Table.Fill(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.TableFillOptions)
Fills or clears cells in rows or columns by copying or generating series.
fillRange:  Input Autodesk.AutoCAD.DatabaseServices.CellRange object. Range to be filled. This shouldn't overlap the source range except when this range is to be cleared instead of filled in which case this range should be contained fully in source range.
sourceRange:  Input Autodesk.AutoCAD.DatabaseServices.CellRange object. Source range to copy or use as pattern. This can be set to invalid range if the fill range is to be cleared.
options:  Input table copy options

Autodesk.AutoCAD.DatabaseServices.Table.GetColumnName(System.Int32)
Obsolete. Returns the columns name retrieved from the specified index.
index:  Input zero based index of the column

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnName(System.Int32,System.String)
Obsolete. Sets a column's name; it can be left blank.
index:  Input zero based index of the column
name:  Input column name to set. This can be an empty string.

Autodesk.AutoCAD.DatabaseServices.Table.GetToolTip(System.Int32,System.Int32)
Obsolete. Returns the tooltip string for cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.Table.SetToolTip(System.Int32,System.Int32,System.String)
Obsolete. Sets the tooltip string for cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
toolTip:  Input tool tip string to set

Autodesk.AutoCAD.DatabaseServices.Table.SuppressRegenerateTable(System.Boolean)
This method allows the user to temporarily disable the regeneration of the table object during changes in one or more of its properties.
Warning
This method is provided for VBA applications to temporarily disable the regenerating of the table object. It is not intended for use in ObjectARX applications. Calling this function with suppress set to true disables regenerating the table object. The table object is recomputed when this function is called with suppress set to false. Before saving the table object to the drawing file, the user should either call this function with false value or call RecomputeTableBlock(true). Otherwise, the table object will never be displayed.
suppress:  Input boolean value to suppress or enable the regeneration of a table object

Autodesk.AutoCAD.DatabaseServices.Table.Cells
Returns the cells of the table.

Autodesk.AutoCAD.DatabaseServices.Table.Rows
Returns a collection of the rows in the table.

Autodesk.AutoCAD.DatabaseServices.Table.Columns
Returns a collection of the columns in the table.

Autodesk.AutoCAD.DatabaseServices.Table.BreakOptions
Returns the table break option.

Autodesk.AutoCAD.DatabaseServices.Table.BreakFlowDirection
Returns the table break flow direction of the table.

Autodesk.AutoCAD.DatabaseServices.Table.BreakEnabled
Returns true if break feature is enabled in the cell.

Autodesk.AutoCAD.DatabaseServices.Table.HasSubSelection
Returns true if the table has a subselection set.

Autodesk.AutoCAD.DatabaseServices.Table.SubSelection
Returns range of cells in the subselection set.

Autodesk.AutoCAD.DatabaseServices.Table.IsHeaderSuppressed
Obsolete Returns true if the header row of the table is suppressed, or false if it is not.

Autodesk.AutoCAD.DatabaseServices.Table.TableStyleName
Returns the name of the table style.

Autodesk.AutoCAD.DatabaseServices.Table.IsTitleSuppressed
Obsolete Returns true if the title row of the table is suppressed, or false if it is not.

Autodesk.AutoCAD.DatabaseServices.Table.FlowDirection
Returns the direction that the table follows from its start to its finish.

Autodesk.AutoCAD.DatabaseServices.Table.VerticalCellMargin
Obsolete Returns the vertical cell margin for the table.

Autodesk.AutoCAD.DatabaseServices.Table.HorizontalCellMargin
Obsolete Returns the horizontal cell margin for the table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumTableHeight
Returns the minimum total height for the table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumTableWidth
Returns the minimum total width for the table.

Autodesk.AutoCAD.DatabaseServices.Table.Height
Returns the total height of the table.

Autodesk.AutoCAD.DatabaseServices.Table.Width
Returns the total width for the table.

Autodesk.AutoCAD.DatabaseServices.Table.NumColumns
Obsolete Returns a non-negative integer representing the number of columns in the table.

Autodesk.AutoCAD.DatabaseServices.Table.NumRows
Obsolete Returns a non-negative integer representing the number of rows in the table.

Autodesk.AutoCAD.DatabaseServices.Table.Direction
Returns the unit horizontal direction vector for the table in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Table.TableStyle
Returns the object ID of the TableStyle referenced by the table object.