Autodesk.AutoCAD.Geometry.ExternalBoundedSurface
This .NET class wraps the AcGeExternalBoundedSurface ObjectARX class.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.GetContours
Provides access to the curve boundary geometry for the boundaries on the surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.Set(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Resets the definition of an instance of this class.
surfaceDef:  Input definition of the external bounded surface
surfaceKind:  Input information about the system in which the surface definition was created

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.SetToOwnSurface
Forces this instance to own its definition data.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsOwnerOfSurface
Determines whether this instance owns its definition data.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.NumContours
Returns the number of curve boundaries on this surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsExternalSurface
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsNurbs
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsTorus
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsCone
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsCylinder
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsSphere
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsPlane
Determines the type of the unbounded base surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalBaseSurface
Access to the external entity in its native form.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.BaseSurface
Provides access to the unbounded surface geometry (that is, unbounded other than by the parametric bounds, if applicable, of the surface).

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalSurfaceDefinition
Accesses the external surface definition associated with this object.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.IsDefined
Determines whether the instance is empty.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.ExternalSurfaceKind
Provides information concerning the native system in which the external bounded surface definition was created.