Autodesk.AutoCAD.DatabaseServices.ColinearConstraint
This class represents a Colinear (coincident) constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ColinearConstraint.#ctor
Default constructor.