Autodesk.AutoCAD.DatabaseServices.Line
This .NET class wraps the AcDbLine ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Line.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor initializes the line object to use pointer1 as the start point, and pointer2 as the endpoint.
pointer1:  Input line start point (WCS coordinates)
pointer2:  Input line end point (WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Line.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Line.Length
Accesses the length of the line.

Autodesk.AutoCAD.DatabaseServices.Line.Angle
Accesses the angle of the line expressed in radians relative to the world coordinate system.

Autodesk.AutoCAD.DatabaseServices.Line.Delta
Accesses the vector formed by start and end points of the line.

Autodesk.AutoCAD.DatabaseServices.Line.Normal
Accesses the line's unit normal vector in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Line.Thickness
Accesses the line's thickness value.

Autodesk.AutoCAD.DatabaseServices.Line.EndPoint
Accesses the line's endpoint in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Line.StartPoint
Accesses the line's start point in WCS coordinates.