Autodesk.AutoCAD.DatabaseServices.Filters.Index
This .NET class wraps the AcDbIndex ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.RebuildFull(Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData)
Completely rebuilds the index from the entities in the associated block table record.
indexData:  Input IndexUpdateData object for use during the index rebuild

Autodesk.AutoCAD.DatabaseServices.Filters.Index.GetIterator(Autodesk.AutoCAD.DatabaseServices.Filters.Filter)
Creates a new FilteredBlockIterator object.
filter:  Input filter (query) to be applied to the index for the iterator based traversal

Autodesk.AutoCAD.DatabaseServices.Filters.Index.IsUptoDate
Accesses information in addition to TDUPDATE to verify the up-to-date status.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.LastUpdatedAtU
Accesses the Universal time that the index was last updated.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.LastUpdatedAt
Accesses the TDUPDATE value of the Database when the index was last updated.

Autodesk.AutoCAD.DatabaseServices.Filters.Index.ObjectBeingIndexedId
Accesses Index objects are associated with Block Table Records, and indirectly owned by them.