Autodesk.AutoCAD.DatabaseServices.DBText
This .NET class wraps the AcDbText ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DBText.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DBText.CorrectSpelling
Runs the spell checker on the text to correct any spelling errors.

Autodesk.AutoCAD.DatabaseServices.DBText.AdjustAlignment(Autodesk.AutoCAD.DatabaseServices.Database)
Normally when a text entity is closed, the text's position and alignment points are adjusted according to the text's justification settings and the text style.
alternateDatabaseToUse:  Database to be used if the text entity is not in a database (this argument is ignored if the text entity is in a database)

Autodesk.AutoCAD.DatabaseServices.DBText.ConvertFieldToText
If the text contains fields, this function converts them to text and removes the fields.

Autodesk.AutoCAD.DatabaseServices.DBText.Justify
Accesses the justification point(s) of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.VerticalMode
Accesses the vertical mode of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.HorizontalMode
Accesses the horizontal mode of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.IsMirroredInY
Accesses whether the text is mirrored in the Y direction (that is, it appears upside down).

Autodesk.AutoCAD.DatabaseServices.DBText.IsMirroredInX
Accesses whether the text is mirrored in the X direction (that is, it appears backward in the horizontal direction).

Autodesk.AutoCAD.DatabaseServices.DBText.TextStyleId
Accesses the objectId of the textStyle currently referenced by the text object.

Autodesk.AutoCAD.DatabaseServices.DBText.TextStyleName
Accesses the name of the text style used.

Autodesk.AutoCAD.DatabaseServices.DBText.TextString
Accesses the null-terminated text string used by the Text object.

Autodesk.AutoCAD.DatabaseServices.DBText.WidthFactor
Accesses the width factor (also referred to as the relative X-scale factor) for the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Height
Accesses the height of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Rotation
Accesses the rotation angle of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Oblique
Accesses the oblique angle (in radians) of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Thickness
Accesses the thickness of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Normal
Accesses the normal vector of the plane containing the text.

Autodesk.AutoCAD.DatabaseServices.DBText.IsDefaultAlignment
Returns true if the text is in a default alignment.

Autodesk.AutoCAD.DatabaseServices.DBText.AlignmentPoint
Accesses the alignment point of the text.

Autodesk.AutoCAD.DatabaseServices.DBText.Position
Accesses the insertion point of the text in WCS coordinates.