Autodesk.AutoCAD.DatabaseServices.Spline
This class implements the AutoCAD SPLINE entity.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum,System.Int32,System.Double)
This wraps AcDbSpline::AcDbSpline() method.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,System.Boolean,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum,System.Int32,System.Double)
Creates a spline that attempts to fit a curve to the array of points within the tolerance fitTolerance.
fitPoints:  Array of points (in WCS coordinates) through which to fit the curve.
isPeriodic:  Indicate whether or not a periodic spline fitting the array of points is created.
knotParam:  Knot parameterization defining the knot values .
degree:  Degree of the spline to be created (in the range 1 to 11)
fitTolerance:  Tolerance to which the spline should approximate fitPoints.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum,System.Int32,System.Double)
This wraps AcDbSpline::AcDbSpline() method.

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor creates a spline initialized to be an elliptical arc.
center:  Center point (in WCS coordinates) of the elliptical arc
unitNormal:  Vector (in WCS coordinates) representing the normal to the elliptical arc
majorAxis:  Major axis vector (in WCS coordinates) of the elliptical arc, measured from the ellipse center point to the ellipse start point
radiusRatio:  Ratio of minor or major axis length
startAngle:  Angle (in radians) of start point of elliptical arc
endAngle:  Angle (in radians) of end point of elliptical arc

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32,System.Double)
Creates a spline that attempts to fit an order degree curve to the array of points within the tolerance fitTolerance.
point:  Array of points (in WCS coordinates) through which to fit the curve
startTangent:  Specifies the tangent at the start of the curve
endTangent:  Specifies the tangent at the end of the curve
order:  Order of the spline to be created (in the range 2 to 26)
fitTolerance:  Tolerance to which the spline should approximate fitPoints

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,System.Int32,System.Double)
Creates a spline that attempts to fit an order degree curve to the array of points within the tolerance fitTolerance.
point:  Array of points (in WCS coordinates) through which to fit the curve
order:  Order of the spline to be created (in the range 2 to 26)
fitTolerance:  Tolerance to which the spline should approximate fitPoints

Autodesk.AutoCAD.DatabaseServices.Spline.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Spline.ElevateDegree(System.Int32)
Increases the degree (which is the same as the order -1) of the spline to newDegree.
newDegree:  Input new spline degree value (in the range (existing degree) to 25)

Autodesk.AutoCAD.DatabaseServices.Spline.GetControlPointAt(System.Int32)
Returns the value of the control point at position index in the list of control points.
index:  Input index (0 based) of point to get

Autodesk.AutoCAD.DatabaseServices.Spline.SetControlPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets point (in WCS coordinates) to be the control point at the index position in the control points list replacing the point value that was previously at index position.
index:  Input index (0 based) of control point to replace
point:  Input new control point (in WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Spline.GetFitPointAt(System.Int32)
Returns the value of the fit point at position index.
index:  Input index (0 based) value

Autodesk.AutoCAD.DatabaseServices.Spline.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Sets point (in WCS coordinates) to be the fit point at the index position in the fit points list (replacing the point value previously at index) and then refits the spline.
index:  Input index (0 based) of fit point to replace
point:  Input new fit point (in WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Spline.InsertFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Adds point to the list of fit points and refits the spline.
index:  Input index (0 based) where new fit point is to be inserted
point:  Input new fit point (in WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Spline.RemoveFitPointAt(System.Int32)
Removes the fit point at index in the list of fit points of the spline and refits the spline.
index:  Index (0 based) of fit point to be removed

Autodesk.AutoCAD.DatabaseServices.Spline.PurgeFitData
Purges the fit data if the spline is a fitted spline.

Autodesk.AutoCAD.DatabaseServices.Spline.UpdateFitData
Updates the fit data of the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.WeightAt(System.Int32)
Returns the weight of the control point at index.
index:  Input index (0 based) of control point

Autodesk.AutoCAD.DatabaseServices.Spline.SetWeightAt(System.Int32,System.Double)
Changes the weight of the point at the index location in the control points array to weight.
index:  Input index (0 based) of control point at which to change the weight
weight:  Input new weight value

Autodesk.AutoCAD.DatabaseServices.Spline.InsertKnot(System.Double)
Inserts a new knot into the spline at the location on the spline defined by value.
value:  Input parameter where knot is to be added

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline(System.UInt32,System.Boolean,System.Boolean)
Generates a polyline to approximate a spline without using PLINETYPE and PLINECONVERTMODE.
The resulting curve could be an Polyline or an 3dPolyline. If the spline is not planar, then the result will always be an AcDb3dPolyline and will always have line segments. If the spline is planar, then if bConvertAsArcs is truen, the resulting polyline will be arc segments, otherwise it will be line segments. And, if the spline is planar and bToLWPolyline is true, then the result will be an AcDbPolyline, otherwise it will be an AcDb2dPolyline.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline(System.Boolean,System.Boolean)
Generates a polyline to approximate a spline.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline(System.UInt32)
Generates a polyline to approximate a spline.
numOfVertices:  Target number of vertices. The resulting polyline will have vertices no more than this value.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline
Generates a polyline to approximate a spline.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32,System.Boolean,System.Boolean)
Generates a polyline to approximate a spline without using PLINETYPE and PLINECONVERTMODE.
The resulting curve could be an AcDbPolyline, an AcDb2dPolyline, or an AcDb3dPolyline. If the spline is not planar, then the result will always be an AcDb3dPolyline and will always have line segments. If the spline is planar, then if bConvertAsArcs is truen, the resulting polyline will be arc segments, otherwise it will be line segments. And, if the spline is planar and bToLWPolyline is true, then the result will be an AcDbPolyline, otherwise it will be an AcDb2dPolyline.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32)
Generates a polyline to approximate a spline.
precision:  Target precision

Autodesk.AutoCAD.DatabaseServices.Spline.InsertControlPointAt(System.Double,Autodesk.AutoCAD.Geometry.Point3d,System.Double)
This wraps the ObjectARX AcDbSpline::insertControlPointAt() method.

Autodesk.AutoCAD.DatabaseServices.Spline.RemoveControlPointAt(System.Int32)
This wraps the ObjectARX AcDbSpline::removeControlPointAt() method.

Autodesk.AutoCAD.DatabaseServices.Spline.Rebuild(System.Int32,System.Int32)
This wraps the ObjectARX AcDbSpline::rebuild() method.

Autodesk.AutoCAD.DatabaseServices.Spline.ModifyPositionAndTangent(System.Double,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Adjusts the location and tangent of a point on the spline curve with the given parameter.
param:  Parameter
point:  Specify the new location of the point on the spline curve
deriv:  Specify the tangent vector

Autodesk.AutoCAD.DatabaseServices.Spline.Type
This wraps AcDbSpline::type() and AcDbSpline::setType() methods.

Autodesk.AutoCAD.DatabaseServices.Spline.IsPlanar
Returns true if the object lies completely within a plane.

Autodesk.AutoCAD.DatabaseServices.Spline.NurbsData
Replaces any existing spline data with the data passed in via NurbsData parameters.

Autodesk.AutoCAD.DatabaseServices.Spline.FitData
Returns all the fit points (in WCS coordinates), fit tolerance, and, if tangents exist, the start and end tangents of the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.HasFitData
Returns true if and only if the spline has fit data associated with it.

Autodesk.AutoCAD.DatabaseServices.Spline.EndFitTangent
Returns the start point and end point tangent vectors in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Spline.StartFitTangent
Returns the start point of tangent vector in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Spline.FitTolerance
Returns the tolerance value used for curve fitting.

Autodesk.AutoCAD.DatabaseServices.Spline.NumFitPoints
Returns the number of fit points associated with the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.NumControlPoints
Returns the number of control points in the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.Degree
Returns the degree of the spline's polynomial representation.

Autodesk.AutoCAD.DatabaseServices.Spline.IsRational
Returns true if and only if the spline is rational.

Autodesk.AutoCAD.DatabaseServices.Spline.IsNull
Returns true if this Spline object does not have an gelib object within it.