Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.#ctor
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::AcDbAssocEdgeChamferActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.GetBaseDistance(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::baseDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.SetBaseDistance(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::setBaseDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.GetOtherDistance(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::otherDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.SetOtherDistance(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::setOtherDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.OtherDistance
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::otherDistance and AcDbAssocEdgeChamferActionBody::setOtherDistance() methods.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.BaseDistance
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::baseDistance() and AcDbAssocEdgeChamferActionBody::setBaseDistance() methods.