Autodesk.AutoCAD.Geometry.Line3d
This .NET class wraps the AcGeLine3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Line3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructs an unbounded line that passes through point1 and point2.
point1:  Input any 3D point
point2:  Input any 3D point different from point1

Autodesk.AutoCAD.Geometry.Line3d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructs an unbounded line that passes through pnt and has a direction of vec.
point:  Input any 3D point
vector:  Input any 3D vector

Autodesk.AutoCAD.Geometry.Line3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Line3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Changes the definition of the line to pass through point1 and point2.
point1:  Input any 3D point
point2:  Input any 3D point different from point1

Autodesk.AutoCAD.Geometry.Line3d.Set(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Changes the definition of the line to pass through point in the direction of vector.
point:  Input any 3D point
vector:  Input any 3D vector