Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits
This .NET class wraps the AcGiGradientBackgroundTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.Rotation
Returns the angle by which the gradient background will be rotated.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.Height
Gets a value representing a percentage of the second color in a three-color gradient.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.Horizon
Returns the horizon value indicating the percentage of unrotated height.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.ColorBottom
Returns the color of the bottom portion of the background.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.ColorMiddle
Returns the color of the middle portion of the background.

Autodesk.AutoCAD.GraphicsInterface.GradientBackgroundTraits.ColorTop
Returns the color of the top portion of the background.