Autodesk.AutoCAD.DatabaseServices.PathRef
This wraps the ObjectARX AcDbPathRef class.

Autodesk.AutoCAD.DatabaseServices.PathRef.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This wraps the ObjectARX AcDbPathRef::AcDbPathRef () method.

Autodesk.AutoCAD.DatabaseServices.PathRef.#ctor(Autodesk.AutoCAD.DatabaseServices.EdgeRef[])
This wraps the ObjectARX AcDbPathRef::AcDbPathRef() method.

Autodesk.AutoCAD.DatabaseServices.PathRef.#ctor
This wraps the ObjectARX AcDbPathRef::AcDbPathRef() method.

Autodesk.AutoCAD.DatabaseServices.PathRef.GetEntityArray(System.Boolean)
This wraps the ObjectARX AcDbPathRef::getEntityArray() method.

Autodesk.AutoCAD.DatabaseServices.PathRef.IsEqualTo(Autodesk.AutoCAD.Geometry.Curve3d)
This wraps the ObjectARX AcDbPathRef::isEqualTo() method.

Autodesk.AutoCAD.DatabaseServices.PathRef.IsReferencePath
This wraps the ObjectARX AcDbPathRef::isReferencePath() method.

Autodesk.AutoCAD.DatabaseServices.PathRef.EdgeRefs
This wraps the ObjectARX AcDbPathRef::edgeRefs() and AcDbPathRef::setEdgeRefs() methods.