Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits
This .NET class wraps the AcGiDistantLightTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.SkyParameters
Provides access to sky.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.LampColor
Accesses the RGB value for the light's lamp color.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.PhysicalIntensity
Accesses the physical intensity of the light in candela.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.IsSunlight
Returns true if this light represents sunlight.

Autodesk.AutoCAD.GraphicsInterface.DistantLightTraits.LightDirection
Returns the direction of the light as a vector.