Autodesk.AutoCAD.DatabaseServices.Leader
This .NET class wraps the AcDbLeader ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Leader.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Leader.SetPlane(Autodesk.AutoCAD.Geometry.Plane)
Sets the plane that will contain the leader object.
value:  Input desired plane within which the leader will reside

Autodesk.AutoCAD.DatabaseServices.Leader.AppendVertex(Autodesk.AutoCAD.Geometry.Point3d)
Appends vertex to the end of the vertex list for this leader.
pointToAdd:  Input point (in WCS coordinates) to add to the vertex list

Autodesk.AutoCAD.DatabaseServices.Leader.RemoveLastVertex
Removes the last vertex (the vertex at the annotation end) from the vertex list.
Note
This function breaks associativity.

Autodesk.AutoCAD.DatabaseServices.Leader.VertexAt(System.Int32)
Returns the Point3d that is the vertex at the location index (0 based) in this leader's vertex array.
value:  Input index number (0 based) of the vertex desired

Autodesk.AutoCAD.DatabaseServices.Leader.SetVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets the vertex at index to the point point projected (along the plane normal) onto the plane containing the leader.
index:  Input index number (0 based) of the vertex to change
pointValue:  Input new point value (in WCS) to use

Autodesk.AutoCAD.DatabaseServices.Leader.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Sets the leader to use the DimensionStyle (and dim overrides associated with it) specified by style.
style:  Input objectId of the desired DimensionStyle

Autodesk.AutoCAD.DatabaseServices.Leader.GetDimstyleData
Returns the DimStyle information from the DimStyleTableRecord referenced by this object into the DimStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.Leader.EvaluateLeader
Evaluate the relation of the leader to its associated annotation, and update the leader geometry if necessary.

Autodesk.AutoCAD.DatabaseServices.Leader.DimensionStyleName
Accesses the associated dimension style name.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimtxt
Accesses the current DIMTXT value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimtad
Accesses the current DIMTAD value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimscale
Accesses the current DIMSCALE value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimsah
Accesses the current DIMSAH value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimldrblk
Accesses the object ID of the block reference that is the current DIMLDRBLK value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimlwd
Accesses the current DIMLWD value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimgap
Accesses the current DIMGAP value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimclrd
Accesses the current DIMCLRD value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Dimasz
Accesses the current DIMASZ value for the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnoWidth
Accesses the annotation width.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnoHeight
Accesses the annotation height.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnoType
Accesses the leader's annotation type.

Autodesk.AutoCAD.DatabaseServices.Leader.AnnotationOffset
.

Autodesk.AutoCAD.DatabaseServices.Leader.Annotation
Accesses the leader's annotation ID.

Autodesk.AutoCAD.DatabaseServices.Leader.DimensionStyle
Accesses the objectId of the DimensionStyle object referenced by the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.IsSplined
Assesses if this leader is spline-fit.

Autodesk.AutoCAD.DatabaseServices.Leader.HasHookLine
Assesses if this leader has a hookline.

Autodesk.AutoCAD.DatabaseServices.Leader.HasArrowHead
Assesses if arrowhead is currently enabled for this leader.

Autodesk.AutoCAD.DatabaseServices.Leader.LastVertex
Accesses the leader's last vertex in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Leader.FirstVertex
Accesses the leader's start point in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Leader.NumVertices
Accesses the number of vertices in the leader.

Autodesk.AutoCAD.DatabaseServices.Leader.Normal
Accesses the unit normal that contains the leader.