Autodesk.AutoCAD.DatabaseServices.PointCloudEx
The PointCloudEx entity (or "point cloud extension entity") works with the AcDbPointCloudDefEx object (or "point cloud extension definition object") to manage point cloud data inside AutoCAD.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.#ctor
This is PointCloudEx, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.GetColorSchemeForStylization(Autodesk.AutoCAD.DatabaseServices.PointCloudStylizationType)
Returns the color scheme name based on the given stylization mode.
type:  Indicates a stylization type.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.SetColorSchemeForStylization(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudStylizationType)
Sets the current color scheme based on the given stylization mode.
name:  Indicates the name of a color scheme to be set.
type:  Indicates a stylization type

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.HasProperty(Autodesk.AutoCAD.DatabaseServices.PointCloudProperty)
Gets the state if the point cloud contains intensity, classification, elevation, etc.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.findScanItem(System.String)
Gets a scan item by the scan GUID in the point cloud.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.findRegionItem(System.Int32)
Gets the region item by its ID in the point cloud.
regionId:  The region ID to be returned.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.setScanVisibility(System.String,System.Boolean)
Sets whether or not a scan is visible. This method does nothing if the scan GUID does not exist.
scanGuid:  The scan GUID
visible:  Whether or not the scan is visible

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.setRegionVisibility(System.Int32,System.Boolean)
Sets whether or not a specified region is visible. This function can be used to set visibility of any region, or to points that are not assigned to any region. If the given region ID is outside of the range of valid region IDs, there is no change.
regionId:  The region ID
visible:  The region's visibility

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.setAllScansVisibility(System.Boolean)
Sets whether or not all scans are visible.
visible:  The visibility of all scans.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.setAllRegionsVisibility(System.Boolean,System.Boolean)
Sets whether or not all regions are visible.
visible:  The visibility for all regions.
includeUnassigned:  true or false, whether or not set the bVisible to unassigned points

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.getPointCloudDataList
Get the list of PointCloudItem, which includes the scan items and region items.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.getCroppingCount
Returns the number of cropping boundaries that are set on this entity.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.getPointCloudCropping(System.Int32)
Returns a cropping boundary by index, for editing.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.addCroppingBoundary(Autodesk.AutoCAD.DatabaseServices.PointCloudCrop)
Adds a new cropping boundary to this point cloud entity.
cropping:  An AcDbPointCloudCrop object which is to be added.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.clearCropping
Removes all cropping boundaries on this point cloud entity.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.removeLastCropping
Removes most recently added cropping boundary from this point cloud entity.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transform the PointCloudEx with the input matrix.
xform:  The input transform matrix.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.AttachPointCloud(System.String,Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.Database)
Create a PointCloudEx entity.
filename:  Point cloud source file path. This represent the original filepath use to cerate the index. This entry can be blank.
location:  Location of point cloud entity. If entity is inserted at 0,0,0 the points will appear where they are located in the point cloud.
scale:  Scale factor. 1.0 is default scale, and cannot less than 0.0
rotation:  Rotation Angle in degrees. 0 is default rotation
db:  Returns object id of created PointCloudEx

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.NativeExtents
Returns the non-translated native 3D extent of the point cloud in ECS, which is taken from point cloud data file directly.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.GeomExtents
Geometry extents of point cloud.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.PointCloudDefExId
Object Id of PointCloudDefEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ShowCropped
Gets or sets whether or not this entity should show the cropped point cloud.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.CroppingInverted
Gets or sets whether cropping on this entity is currently inverted.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ActiveFileName
Gets the active path name of the externally referenced point cloud file.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.Location
Get or set the location in the drawing where the base point of the point cloud is attached.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.Rotation
Gets or sets the rotation angle of the point cloud in the current UCS.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.Scale
Gets or sets the scale factor of the point cloud.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.LimitBoxBound
Gets the bound of limit box.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ElevationGradient
Gets or sets whether show Elevation in gradient.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.IntensityGradient
Gets or sets whether show Intensity in gradient.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.Stylization
This is Stylization, a member of class PointCloudEx.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ElevationOutOfRangeBehavior
Gets or sets the current display option for any points which are out of elevation range.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.ElevationApplyToFixedRange
Gets or sets whether or not the elevation range update dynamically as the extents of the limit box change.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.MinMaxElevation
Get or sets the range (min/max values) of the elevation colorization range.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.CurrentColorScheme
Gets or sets the current color scheme name that corresponds to the current stylization mode.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.IntensityOutOfRangeBehavior
Gets or sets the current display option for the points which are out of intensity range.

Autodesk.AutoCAD.DatabaseServices.PointCloudEx.MinMaxIntensity
Gets or sets the range (min/max values) of the current intensity colorization range.