Autodesk.AutoCAD.DatabaseServices.PdfDefinition
This .NET class wraps the ObjectARX class AcDbPdfDefinition.

Autodesk.AutoCAD.DatabaseServices.PdfDefinition.#ctor
This is PdfDefinition, a member of class PdfDefinition.