Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters
AssocArrayCommonParameters wraps the ObjectARX AcDbAssocArrayCommonParameters class.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetRowCount(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.SetRowCount(System.Int32,System.String,System.String)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setRowCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetRowSpacing(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.SetRowSpacing(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setRowSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetRowElevation(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowElevation() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.SetRowElevation(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setRowElevation() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetLevelCount(System.String&,System.String&)
This wraps the ObjectARX ObjectARX AcDbAssocArrayCommonParameters::levelCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.SetLevelCount(System.Int32,System.String,System.String)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setLevelCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetLevelSpacing(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::levelSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.SetLevelSpacing(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setLevelSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.BasePoint
Wraps the ObjectARX AcDbAssocArrayCommonParameters::getBasePlane() and AcDbAssocArrayCommonParameters::setBasePlane() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.BaseNormal
Wraps the ObjectARX AcDbAssocArrayCommonParameters::getBasePlane() and AcDbAssocArrayCommonParameters::setBasePlane() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.BasePlane
Wraps the ObjectARX AcDbAssocArrayCommonParameters::getBasePlane() and AcDbAssocArrayCommonParameters::setBasePlane() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.LevelSpacing
Wraps the ObjectARX AcDbAssocArrayCommonParameters::levelSpacing() and AcDbAssocArrayCommonParameters::setLevelSpacing() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.LevelCount
Wraps the ObjectARX AcDbAssocArrayCommonParameters::levelCount() and AcDbAssocArrayCommonParameters::setLevelCount() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.RowElevation
Wraps the ObjectARX AcDbAssocArrayCommonParameters::rowElevation() and AcDbAssocArrayCommonParameters::setRowElevation() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.RowSpacing
Wraps the ObjectARX AcDbAssocArrayCommonParameters::rowSpacing() and AcDbAssocArrayCommonParameters::setRowSpacing() methods.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.RowCount
Wraps the ObjectARX the ObjectARX AcDbAssocArrayCommonParameters::rowCount() and AcDbAssocArrayCommonParameters::setRowCount() methodS.