Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension
This .NET class wraps the AcDb3PointAngularDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.CenterPoint
Accesses the dimension definition point (in WCS coordinates) that is located at the vertex of the angle being dimensioned.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.XLine2Point
Accesses the dimension definition point (in WCS coordinates) that is used for the start point of the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.XLine1Point
Accesses the.

Autodesk.AutoCAD.DatabaseServices.Point3AngularDimension.ArcPoint
Accesses This function returns the dimension definition point (in WCS coordinates) that is used to determine the location of the arc of the dimension.