Autodesk.AutoCAD.DatabaseServices.Solid
This .Net class wraps AcDbSolid ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1-pointer3 as the first three points for the solid and then uses pointer2 as the fourth point as well.
pointer1:  Input first point (in WCS) for solid
pointer2:  Input second point (in WCS) for solid
pointer3:  Input third point (in WCS) for solid

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
This constructor uses pointer1-pointer4 as the four points for the solid.
pointer1:  Input first point (in WCS) for solid
pointer2:  Input second point (in WCS) for solid
pointer3:  Input third point (in WCS) for solid
pointer4:  Input fourth point (in WCS) for solid

Autodesk.AutoCAD.DatabaseServices.Solid.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Solid.GetPointAt(System.Int16)
Fills the output value of the desired point with the value of the point in the solid whose index is index.
index:  Input index (1-4) of the desired point in the solid

Autodesk.AutoCAD.DatabaseServices.Solid.SetPointAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
Sets the index'th point in the solid to the pointValue.
index:  Input index (1-4) of the point to set in the solid
pointValue:  Input point value

Autodesk.AutoCAD.DatabaseServices.Solid.Normal
Returns the unit normal vector of the plane containing the solid.

Autodesk.AutoCAD.DatabaseServices.Solid.Thickness
Returns the thickness of the solid.