Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge
This .NET class wraps the AcDbRadialDimensionLarge ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.OverrideCenter
Accesses the overridden center point used by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.JogPoint
Accesses the jog point used by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.ChordPoint
Accesses the chord point on the arc dimensioned by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.Center
Accesses the center point of the arc dimensioned by the jogged radius dimension.

Autodesk.AutoCAD.DatabaseServices.RadialDimensionLarge.JogAngle
Accesses the jog angle used by the jogged radius dimension.