Autodesk.AutoCAD.GraphicsInterface.VisualStyle
This .NET class wraps the AcGiVisualStyle ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.#ctor
Default constructor.
type:  Input the type of visual style to configure

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets the operation associated with a property.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty for which the operation is being set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use for the property.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a color property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceMonoColorEdgeIntersectionColorEdgeObscuredColorEdgeColorEdgeSilhouetteColor
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.
pColor:  Input AcCmColor property value to set.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Double,System.Double,System.Double,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a color property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceMonoColorEdgeIntersectionColorEdgeObscuredColorEdgeColorEdgeSilhouetteColor
red:  Input red color value to set. Valid value is from 0.0 to 1.0.
green:  Input green color value to set. Valid value is from 0.0 to 1.0.
blue:  Input blue color value to set. Valid value is from 0.0 to 1.0.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Double,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a double property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceOpacityFaceSpecularEdgeCreaseAngleEdgeOpacityDisplayBrightness
dVal:  Input double property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Boolean,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a boolean property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:EdgeHidePrecision
bVal:  Input boolean property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Int32,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets an integer property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set. Valid Property values for this method are:FaceLightingModelFaceLightingQualityFaceColorModeFaceModifierEdgeModelEdgeStyleEdgeObscuredLinePatternEdgeIntersectionLinePatternEdgeModifierEdgeWidthEdgeOverhangEdgeJitterAmountEdgeSilhouetteWidthEdgeHaloGapEdgeIsolinesDisplayStyleDisplayShadowType
nVal:  Input integer property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.SetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty,System.Object,Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation)
Sets a property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to set.
val:  Input Autodesk.AutoCAD.GraphicsInterface.Variant property value to set.
op:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleOperation to use when setting the property.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.GetTrait(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty)
Gets a property of the visual style.
prop:  Input Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty to get from the visual style.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.Operation(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty)
Gets the operation associated with a property.
prop:  The property whose operation is to be queried.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.GetPropertyType(Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty)
Gets data type of the specified visual style property.
prop:  Input enum Autodesk.AutoCAD.GraphicsInterface.VisualStyleProperty.

Autodesk.AutoCAD.GraphicsInterface.VisualStyle.Type
Accesses the visual style type.