Autodesk.AutoCAD.DatabaseServices.XrefComandeeredEventArgs
This class provides data for the XrefComandeered event of the database.

Autodesk.AutoCAD.DatabaseServices.XrefComandeeredEventArgs.From
Gets the database being xrefed.

Autodesk.AutoCAD.DatabaseServices.XrefComandeeredEventArgs.Id
Gets the object ID of the object being commandeered.