Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder
This class is required to build instances of Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo, which is an immutable value type.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo)
Copy constructor.
value:  Input Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfo object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.ToDatabaseSummaryInfo
This method returns a DatabaseSummaryInfo object that contains the values specified in this object.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.CustomPropertyTable
Accesses the custom properties table collection.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.CustomProperties
Accesses the custom properties property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.HyperlinkBase
Accesses the hyperlink base property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.RevisionNumber
Accesses the revision number.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.LastSavedBy
Accesses the last saved by property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Comments
Accesses the comments property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Keywords
Accesses the keywords property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Author
Accesses the author property value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Subject
Accesses the subject value.

Autodesk.AutoCAD.DatabaseServices.DatabaseSummaryInfoBuilder.Title
Accesses the title.