Autodesk.AutoCAD.DatabaseServices.TypedValue
This value type may contain objects of various types.

Autodesk.AutoCAD.DatabaseServices.TypedValue.#ctor(System.Int32,System.Object)
Constructs an object given a type code and a value.
typeCode:  Input the type code.
value:  Input the value.

Autodesk.AutoCAD.DatabaseServices.TypedValue.#ctor(System.Int32)
Constructs an object given a type code.
typeCode:  Input the type code.

Autodesk.AutoCAD.DatabaseServices.TypedValue.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare with.

Autodesk.AutoCAD.DatabaseServices.TypedValue.op_Inequality(Autodesk.AutoCAD.DatabaseServices.TypedValue,Autodesk.AutoCAD.DatabaseServices.TypedValue)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.TypedValue.op_Equality(Autodesk.AutoCAD.DatabaseServices.TypedValue,Autodesk.AutoCAD.DatabaseServices.TypedValue)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.TypedValue.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format.
format:  Input format to display
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input System.IFormatProvider object.

Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.TypedValue.Value
Returns the Value property value.

Autodesk.AutoCAD.DatabaseServices.TypedValue.TypeCode
Returns the TypeCode property value.