Autodesk.AutoCAD.DatabaseServices.GeomRef
This wraps the ObjectARX AcDbGeomRef class.

Autodesk.AutoCAD.DatabaseServices.GeomRef.Reset
This wraps the ObjectARX AcDbGeomRef::reset() method.

Autodesk.AutoCAD.DatabaseServices.GeomRef.IsEmpty
This wraps the ObjectARX AcDbGeomRef::isEmpty() method.

Autodesk.AutoCAD.DatabaseServices.GeomRef.IsValid
This wraps the ObjectARX AcDbGeomRef::isValid() method.