Autodesk.AutoCAD.DatabaseServices.Face
This .NET class wraps the AcDbFace ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Face.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
This constructor initializes the Face to use the points pointer1 through pointer3 as the four corner points of the face with pointer2 being used for both the third and fourth corner points.
pointer1:  Input first corner point (in WCS coordinates)
pointer2:  Input second corner point (in WCS coordinates)
pointer3:  Input third corner point (in WCS coordinates)
value1:  Input Boolean indicating whether or not first edge will be visible
value2:  Input Boolean indicating whether or not second edge will be visible
value3:  Input Boolean indicating whether or not third edge will be visible
value4:  Input Boolean indicating whether or not fourth edge will be visible

Autodesk.AutoCAD.DatabaseServices.Face.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Face.GetVertexAt(System.Int16)
This function uses the value argument to return the WCS value of the vertex.
value:  Input vertex index number (must be 1 through 4)

Autodesk.AutoCAD.DatabaseServices.Face.SetVertexAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
This function sets the vertex specified by vertexIndex to use the position value vertexPosition, which must be in WCS coordinates.
vertexIndex:  Input vertex index number (must be 1 through 4)
vertexPosition:  Input vertex position (in WCS coordinates)

Autodesk.AutoCAD.DatabaseServices.Face.IsEdgeVisibleAt(System.Int16)
Returns true if the edge of the vertex specified is visible.
vertexIndex:  Input vertex index number (must be 1 through 4)

Autodesk.AutoCAD.DatabaseServices.Face.MakeEdgeVisibleAt(System.Int16)
This function sets the edge that starts at the vertex specified by vertexIndex to be visible.
vertexIndex:  Input vertex index number of starting vertex for edge

Autodesk.AutoCAD.DatabaseServices.Face.MakeEdgeInvisibleAt(System.Int16)
This function sets the edge that starts at the vertex specified by vertexIndex to be invisible.
vertexIndex:  Input vertex index number of starting vertex for edge