Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits
This .NET class wraps the AcGiSolidBackgroundTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.SolidBackgroundTraits.ColorSolid
Accesses the solid color of the background.