Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter
This .NET class wraps the AcDbSpatialFilter ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
Used to get the boundary area of this SpatialFilter object.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetQueryBounds(Autodesk.AutoCAD.DatabaseServices.BlockReference)
This function has been deprecated and will be removed in a future release.
blockReference:  Deprecated

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetVolume
Transforms the SpatialFilter object's clip boundary definition into the coordinate space of the associated block or xref.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.SetPerspectiveCamera(Autodesk.AutoCAD.Geometry.Point3d)
Sets the perspective camera position to the location specified by fromPoint.
fromPoint:  Input new base point for the camera

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.ClipVolumeIntersectsExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Used to determine whether an object with extents ext intersects this SpatialFilter object's clipping volume.
ext:  Input extents

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.Inverted
Controls whether or not the SpatialFilter filters out the contents outside of the clip boundary (not inverted) or inside the clip boundary (inverted).

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.OriginalInverseBlockTransform
Accesses the inverse of the block transform for the associated BlockReference when the Filter was last set.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.ClipSpaceToWorldCoordinateSystemTransform
Transforms the clip boundary points from their coordinate system (whatever it may be) to WCS.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.HasPerspectiveCamera
Assesses if a perspective camera is currently defined for this SpatialFilter object.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.Definition
Accesses the definition of the SpatialFilter object.