Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties
This class encapsulates the data returned by the AcDbRegion::getAreaProp()ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.Extents
Returns the extents of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.RadiiOfGyration
Returns the radii of gyration of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.PrincipalMoments
Returns the principal moments of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.ProductOfInertia
Returns the product of inertia of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.MomentsOfInertia
Returns the moments of inertia of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.Centroid
Returns the centroid point of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.Area
Returns the area of the Region.

Autodesk.AutoCAD.DatabaseServices.RegionAreaProperties.Perimeter
Returns the perimeter of the Region.