Autodesk.AutoCAD.DatabaseServices.LineWeightConverter
This class is used to convert lineweights.

Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Returns true if sourceType can be converted to this type.
context:  Input context with which to handle source
sourceType:  Input source type

Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Returns the converted object.
context:  Input context to convert within
culture:  Input culture to convert within
value:  Input object to convert from

Autodesk.AutoCAD.DatabaseServices.LineWeightConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
This method is used to convert a string to a LineWeight value.
context:  Input context within which to handle value
culture:  Input culture within which to handle value
value:  Input value to process