Autodesk.AutoCAD.Geometry.CompositeCurve3d
This .NET class wraps the AcGeCompositeCurve3d ObjectARX class.

Autodesk.AutoCAD.Geometry.CompositeCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d[])
Constructs a composite curve from the list of input curves.
curveList:  Input list of curves in the composite curve

Autodesk.AutoCAD.Geometry.CompositeCurve3d.GetCurves
Returns the list of pointers to the component curves which make up the composite.

Autodesk.AutoCAD.Geometry.CompositeCurve3d.GlobalToLocalParameter(System.Double)
Takes a parameter value of a point on the composite and returns the parameter value of that same point on the component curve on which it lies.
value:  Input global parameter value

Autodesk.AutoCAD.Geometry.CompositeCurve3d.LocalToGlobalParameter(Autodesk.AutoCAD.Geometry.CompositeParameter)
Takes a parameter value of a point on the component curve specified by value and returns the parameter value of that point on the composite curve.
value:  Input local parameter