Autodesk.AutoCAD.DatabaseServices.EqualRadiusConstraint
This class represents a EqualRadius constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.EqualRadiusConstraint.#ctor
Default constructor.