Autodesk.AutoCAD.DatabaseServices.EqualCurvatureConstraint
This class represents a EqualCurvature constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.EqualCurvatureConstraint.#ctor
Default constructor.