Autodesk.AutoCAD.Geometry.NurbCurve2d
This .NET class wraps AcGeNurbCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(Autodesk.AutoCAD.Geometry.LineSegment2d)
Constructs spline representing a line segment.
linSegment:  Input line segment

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(Autodesk.AutoCAD.Geometry.EllipticalArc2d)
Constructs spline geometrically identical to an elliptic arc.
ellipse:  Input elliptic arc

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Constructs a 2D polynomial spline interpolating a given array if 2D points within a global tolerance.
fitPoints:  Input points interpolating the spline curve

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs a 2D polynomial spline interpolating a given array if 2D points within given tolerance.
fitPoints:  Input points interpolating the spline curve
fitTolerance:  Input maximal deviation of the curve from the fitPoints

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean,System.Boolean,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum)
This wraps AcGeNurbCurve2d::AcGeNurbCurve2d (const AcGePoint2dArray& fitPoints, const AcGeVector2d& startTangent, const AcGeVector2d& endTangent, Adesk::Boolean startTangentDefined = Adesk::kTrue, Adesk::Boolean endTangentDefined = Adesk::kTrue, const AcGeTol& fitTolerance = AcGeContext::gTol) method.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean,System.Boolean,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum,Autodesk.AutoCAD.Geometry.Tolerance)
This wraps AcGeNurbCurve2d::AcGeNurbCurve2d (const AcGePoint2dArray& fitPoints, const AcGeVector2d& startTangent, const AcGeVector2d& endTangent, Adesk::Boolean startTangentDefined = Adesk::kTrue, Adesk::Boolean endTangentDefined = Adesk::kTrue, const AcGeTol& fitTolerance = AcGeContext::gTol) method.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,System.Boolean)
Constructs a 2D rational spline by a knot vector, control points, and weights.
degree:  Input the degree of the spline.
knots:  Input an array of knot values, partitioning the spline's domain into rational pieces.
controlPoints:  Input an array of 2D control points.
weights:  Input an array of weight values.
periodic:  Input a flag indicating whether the spline is a periodic.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor(System.Int32,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,System.Boolean)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.Geometry.NurbCurve2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetFitTangents
Returns the fit tangents of spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetFitPointAt(System.Int32)
Returns the fit point corresponding to the specified index.
index:  Input index of fit point

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetWeightAt(System.Int32)
Resets the weight of the specified control point.
index:  Input index to weights

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetParametersOfC1Discontinuity
This method calls NurbCurve2d.GetParametersOfC1Discontinuity(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetParametersOfC1Discontinuity(Autodesk.AutoCAD.Geometry.Tolerance)
Returns parameter values of all points on the spline where the tangent vector is not continuous.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetParametersOfG1Discontinuity
This method calls NurbCurve2d.GetParametersOfG1Discontinuity(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.NurbCurve2d.GetParametersOfG1Discontinuity(Autodesk.AutoCAD.Geometry.Tolerance)
Returns parameter values of all points on the spline where the tangent vector is not continuous.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
If spline was not created with fit data, this function returns false.
index:  Input index of fit point that is to be modified
point:  Input new fit point

Autodesk.AutoCAD.Geometry.NurbCurve2d.AddFitPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
If spline was not created with fit data, this function returns false.
index:  Input index of fit point that is to be added
point:  Input new fit point

Autodesk.AutoCAD.Geometry.NurbCurve2d.DeleteFitPointAt(System.Int32)
If spline was not created with fit data, this function returns false.
index:  Input index of fit point that is to be deleted

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitTangents(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
If spline was not created with fit data, this function returns false.
startTangent:  Input new start tangent vector
endTangent:  Input new end tangent vector

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(System.Int32,Autodesk.AutoCAD.Geometry.Point2dCollection)
This method calls NurbCurve2d.SetFitData(Int32 degree, Point2dCollection fitPoints, Tolerance fitTolerance) with tolerance set to Global.
degree:  Input new degree of spline
fitPoints:  Input new fit points

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(System.Int32,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Recomputes the spline from the input fit points and makes it of the specified degree.
degree:  Input new degree of spline
fitPoints:  Input new fit points
fitTolerance:  Input tolerance to which spline will fit the interpolation points

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,System.Boolean)
This method calls NurbCurve2d.SetFitData(KnotCollection fitKnots, Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance, Boolean periodic) with tolerance set to Global.
fitKnots:  Input new knot values
fitPoints:  Input new fit points
startTangent:  Input new start tangent vector
endTangent:  Input new end tangent vector
periodic:  Input indicating whether spline should be made

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance,System.Boolean)
Recomputes the spline from the input fit points, start and end tangents, and fit tolerance.
The first parameter specifies the knot vector for the new spline. If fitTolerance is not 0, then the constructed spline may not pass through the fit points, but the maximum distance from any fit point to the constructed spline will be no greater than fitTolerance.
Parameter periodic ensures that the first and the last fitPoints from fitPolyLine must be identical.
fitKnots:  Input new knot values
fitPoints:  Input new fit points
startTangent:  Input new start tangent vector
endTangent:  Input new end tangent vector
fitTolerance:  Input tolerance to which spline will fit the interpolation points
periodic:  Input indicating whether spline should be made periodic

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.KnotParameterizationEnum,Autodesk.AutoCAD.Geometry.Tolerance)
This wraps the AcGeNurbCurve2d::setFitData(const AcGePoint2dArray& fitPoints, const AcGeVector2d& startTangent, const AcGeVector2d& endTangent, KnotParameterization knotParam, const AcGeTol& fitTol=AcGeContext::gTol) method.

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
This method calls NurbCurve2d.SetFitData(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance) with tolerance set to Global.
fitPoints:  Input new fit points
startTangent:  Input new start tangent vector
endTangent:  Input new end tangent vector

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetFitData(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Recomputes the spline from the input fit points, start and end tangents, and fit tolerance.
fitPoints:  Input new fit points
startTangent:  Input new start tangent
endTangent:  Input new end tangent
fitTolerance:  Input tolerance to which spline will fit the interpolation points

Autodesk.AutoCAD.Geometry.NurbCurve2d.PurgeFitData
Deletes all fit data used to construct the spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.AddKnot(System.Double)
Adds new knot to the spline knot sequence.
newKnot:  Input new knot value to be inserted into the knot vector of the spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.InsertKnot(System.Double)
Adds new knot to the spline knot sequence.
newKnot:  Input new knot value to be inserted into the knot vector of the spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetWeightAt(System.Int32,System.Double)
Resets the weight of the specified control point.
index:  Input index of control point
value:  Input new weight to be assigned to control point

Autodesk.AutoCAD.Geometry.NurbCurve2d.SetEvaluateMode(System.Boolean)
Resets the state of the evaluation mode in order turn the internal optimization on or off.
evaluateMode:  Input state of the evaluation mode

Autodesk.AutoCAD.Geometry.NurbCurve2d.JoinWith(Autodesk.AutoCAD.Geometry.NurbCurve2d)
Recomputes spline by joining input spline to this spline.
curve:  Input spline to be joined with this spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.HardTrimByParams(System.Double,System.Double)
Trims the spline to the new start and end parameters.
newStartParameter:  Input new start parameter of spline
newEndParameter:  Input new end parameter of spline

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeRational(System.Double)
If the spline is not already rational, then it is made rational and each control point is assigned the specified weight.
weight:  Input weight to be assigned to each control point

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeClosed
If the spline is not already closed, it is made closed by creating a periodic spline defined by the current fit points or control points.

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakePeriodic
Make a spline into a periodic spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeNonPeriodic
Make a periodic spline non-periodic.

Autodesk.AutoCAD.Geometry.NurbCurve2d.MakeOpen
If the spline is closed and if,
1) the spline is created by fit points, it is made open by removing the last fit points.

Autodesk.AutoCAD.Geometry.NurbCurve2d.ElevateDegree(System.Int32)
The degree of the spline is increased by the specified amount.
plusDegree:  Input amount by which degree is to be increased

Autodesk.AutoCAD.Geometry.NurbCurve2d.AddControlPointAt(System.Double,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
This wraps AcGeNurbCurve2d::addControlPointAt(double newKnot, const AcGePoint2d& point, double weight = 1.0) method.

Autodesk.AutoCAD.Geometry.NurbCurve2d.DeleteControlPointAt(System.Int32)
This wraps AcGeNurbCurve2d::deleteControlPointAt(int index) method.

Autodesk.AutoCAD.Geometry.NurbCurve2d.DefinitionData
Returns all data that defines the spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.FitData
Returns all fit data used to construct the spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.EvalMode
Returns state of the current evaluation mode.

Autodesk.AutoCAD.Geometry.NurbCurve2d.FitKnotParameterization
This wraps AcGeNurbCurve2d::getFitKnotParameterization and AcGeNurbCurve2d::setFitKnotParameterizationmethods.

Autodesk.AutoCAD.Geometry.NurbCurve2d.NumWeights
Returns number of weights for the spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.FitTolerance
Returns the fit tolerance used to construct the spline.

Autodesk.AutoCAD.Geometry.NurbCurve2d.NumFitPoints
Returns the number of fit points used to construct the spline.