Autodesk.AutoCAD.DatabaseServices.DataCellCollection
This .NET class is a wrapper for the typedef AcArray ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Index to remove from

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Clear
Clears the collection of its contents.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Add(Autodesk.AutoCAD.DatabaseServices.DataCell)
Adds the object represented by value to this collection.
value:  Input Autodesk.AutoCAD.DatabaseServices.DataCell object

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.DataCell)
Returns the 0-based index of the collection item that matches value.
value:  Input Autodesk.AutoCAD.DatabaseServices.DataCell object

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
Inserts value at position index in the collection.
index:  Input index to insert at
value:  Input the data to be inserted

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Remove(Autodesk.AutoCAD.DatabaseServices.DataCell)
Removes the object represented by value from this collection.
value:  Input value to be removed.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Contains(Autodesk.AutoCAD.DatabaseServices.DataCell)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input Autodesk.AutoCAD.DatabaseServices.DataCell object.

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.DataCell[],System.Int32)
Copies objects in array to this collection, starting from index.
array:  Input Autodesk.AutoCAD.DatabaseServices.DataCell[] object
index:  Input

Autodesk.AutoCAD.DatabaseServices.DataCellCollection.Count
Accesses the number of objects in this collection.