Autodesk.AutoCAD.DatabaseServices.EqualDistanceConstraint
This class represents a EqualDistance constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.EqualDistanceConstraint.#ctor
Default constructor.