Autodesk.AutoCAD.DatabaseServices.SolidBackground
This .NET class wraps the AcDbSolidBackground ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SolidBackground.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.SolidBackground.Color
Access the solid.