Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties
This class encapsulates the data returned by the 3dSolid.getMassProp()ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.#ctor(System.Int32)
Constructor.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.Extents
Returns  the extents (bounding box) of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.RadiiOfGyration
Returns the  X, Y, and Z radii of gyration of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.PrincipalMoments
Returns the  X, Y, and Z principal moments of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.ProductsOfIntertia
Returns the X,  Y, and Z products of inertia of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.MomentsOfIntertia
Returns the X,  Y, and Z moments of inertia of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.Centroid
Returns the centroid of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3dMassProperties.Volume
Returns the volume of the solid.