Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData
This .NET class wraps the AcDbDimData ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.ApplicationData
Accesses application-specific data associated with the object.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.HideIfValueIsZero
Returns true if the object is always invisible when its value is zero.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Visible
Returns true if the object is invisible; it returns false it is visible.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Editable
Assesses if the object is editable.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Focal
Accesses the current focus dynamic dimension; it returns false if this object is not the current focus.

Autodesk.AutoCAD.DatabaseServices.DynamicDimensionData.Dimension
Accesses the dynamic dimension object.