Autodesk.AutoCAD.DatabaseServices.DBPoint
This .NET class wraps the AcDbPoint ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DBPoint.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a point that uses position for its position value.
position:  Input position (in WCS coordinates) for the point

Autodesk.AutoCAD.DatabaseServices.DBPoint.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DBPoint.EcsRotation
Accesses the angle (in radians) between the OCS (formerly ECS) X axis for the point (based on the point's normal vector) and the X axis that will be used when displaying the point.

Autodesk.AutoCAD.DatabaseServices.DBPoint.Normal
Accesses unit normal vector for the point in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.DBPoint.Thickness
Accesses the point's thickness value.

Autodesk.AutoCAD.DatabaseServices.DBPoint.Position
Accesses the points position value in WCS coordinates.