Autodesk.AutoCAD.DatabaseServices.MidPointConstraint
This class represents a MidPoint constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.MidPointConstraint.#ctor
Default constructor.