Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
This class represents a constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.GetConnectedHelpParameterFor(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry)
Returns reference to HelpParameter which this constraint and the specified constrained geometry both are connected to.
consGeom:  The reference to ConstrainedGeometry object.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.Deactivate
Leaves the GeometricalConstraint node in the Assoc2dConstraintGroup but removes it from the DCM dimension system.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.Reactivate
Takes an inactive GeometricalConstraint and adds it to the DCM dimension system.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.IsEnabled
Indicates whether the constraint is enabled.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.IsInternal
Indicates whether the constraint is implied or is part of a composite constraint.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.IsImplied
Indicates whether the GeometricalConstraint is implied.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.IsActive
Indicates whether the GeometricalConstraint is in DCM dimension system.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.OwningCompositeConstraint
Gets the reference to the owning CompositeConstraint object if this constraint is owned by a composite constraint.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.ConnectedHelpParameters
Gets the array of references to HelpParameter objects which this constraint is connected to.

Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint.ConnectedGeometries
Gets the array of references to ConstrainedGeometry objects which this constraint is connected to.