Autodesk.AutoCAD.DatabaseServices.SubentityGeometry
A simple class that just keeps geometry of a vertex or edge subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityGeometry.#ctor(Autodesk.AutoCAD.Geometry.Curve3d)
Constructor initializing with an edge subnetity.
curve:  The curve is not owned by this SubentityGeometry.

Autodesk.AutoCAD.DatabaseServices.SubentityGeometry.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructor initializing with a vertex subentity.
pnt:  The coordinates of the point subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityGeometry.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SubentityGeometry.Curve
Gets a reference to the curve of the edge subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityGeometry.Point
Gets the coordinates of the vertex subentity.

Autodesk.AutoCAD.DatabaseServices.SubentityGeometry.Type
Gets the SubentityType of the subentity.