Autodesk.AutoCAD.DatabaseServices.DataAdapterProvider
This .NET class wraps the AcDbDataAdapterProvider ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataAdapterProvider.GetDataAdapter(System.String)
Returns the data adapter based on its ID.
adapterId:  Input ID to check for