Autodesk.AutoCAD.DatabaseServices.CustomScale
This class encapsulates the numerator and denominator values that define a custom print scale.

Autodesk.AutoCAD.DatabaseServices.CustomScale.#ctor(System.Double,System.Double)
Constructor.
numerator:  Input numerator value
denominator:  Input denominator value

Autodesk.AutoCAD.DatabaseServices.CustomScale.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input System.IFormatProvider object definition.

Autodesk.AutoCAD.DatabaseServices.CustomScale.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare

Autodesk.AutoCAD.DatabaseServices.CustomScale.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.CustomScale)
This method calls the IsEqualTo(CustomScale a, Tolerance tolerance) overload, with tolerance set to Global.
a:  Input scale to compare

Autodesk.AutoCAD.DatabaseServices.CustomScale.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.Geometry.Tolerance)
This method compares this CustomScale object to a.
a:  Input custom scale to compare
tolerance:  Input tolerance range

Autodesk.AutoCAD.DatabaseServices.CustomScale.op_Inequality(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.DatabaseServices.CustomScale)
Returns true if a does not equal b.
a:  Input left operand
b:  Input right operand

Autodesk.AutoCAD.DatabaseServices.CustomScale.op_Equality(Autodesk.AutoCAD.DatabaseServices.CustomScale,Autodesk.AutoCAD.DatabaseServices.CustomScale)
Returns true if a equals b.
a:  Input left operand
b:  Input right operand

Autodesk.AutoCAD.DatabaseServices.CustomScale.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.CustomScale.Denominator
Returns the Denominator property value.

Autodesk.AutoCAD.DatabaseServices.CustomScale.Numerator
Returns the Numerator property value.