Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId
The concrete derived AssocPersSubentId class that identifies an edge subentity if the entity has only a single edge subentity (such as in the case of curve entities).

Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId.#ctor
Default Constructor.

Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId.TransientSubentCount(Autodesk.AutoCAD.DatabaseServices.Entity)
Always returns number 1.
entity:  Not used.

Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId.SubentType(Autodesk.AutoCAD.DatabaseServices.Entity)
Always returns SubentityType.Edge.
entity:  Not used.

Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId)
Returns true if this and the other AssocSingleEdgePersSubentId reference exactly the same subentity of the same entity.
entity:  The entity owning the subentities of this and the other AssocSingleEdgePersSubentId.
other:  The other AssocSingleEdgePersSubentId.

Autodesk.AutoCAD.DatabaseServices.AssocSingleEdgePersSubentId.IsNull
Is always false because AssocSingleEdgePersSubentId always identities the single edge of an entity.