Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits
This .NET class wraps the AcGiStandardLightTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.Shadow
Assesses the shadow parameters for this light.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.LightColor
Accesses the color of emitted light.

Autodesk.AutoCAD.GraphicsInterface.StandardLightTraits.Intensity
Accesses the physical intensity of the light in candela.