Autodesk.AutoCAD.DatabaseServices.VerticalConstraint
This class represents a Vertical constraint node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.VerticalConstraint.#ctor
Default constructor.