Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties
Defines further properties of the layer viewports in LayerTableRecord.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.RemoveOverrides
Removes all overrides associated with this layer and this viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.IsPlotStyleOverridden
Accesses whether or not the plot style is overridden for the associated layer and viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.PlotStyleNameId
Accesses the plot style name ID.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.PlotStyleName
Accesses the plot style name.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.IsTransparencyOverridden
Indicates whether the transparency is overridden for the associated layer and viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.Transparency
Gets and sets the transparency or this layer, in this viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.IsLineWeightOverridden
Accesses whether or not the line weight is overridden for the associated layer and viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.LineWeight
Accesses the line weight of this layer, in this viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.IsLinetypeOverridden
Accesses whether or not the linetype is overridden for the associated layer and viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.LinetypeObjectId
Accesses the linetype object id of this layer, in this viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.IsColorOverridden
Assesses whether or not the color is overridden for the associated layer and viewport.

Autodesk.AutoCAD.DatabaseServices.LayerViewportProperties.Color
Accesses the color of this layer.