Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder
This class is used to edit the properties of the RevolveOptions class, which is an immutable value type.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.#ctor(Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Copy constructor.
value:  Input constructor to copy.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.ToRevolveOptions
Accesses the starting angle.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.CloseToAxis
Accesses the close to axis option.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.TwistAngle
Accesses the angle by which the profile will be twisted as it revolves around the axis.

Autodesk.AutoCAD.DatabaseServices.RevolveOptionsBuilder.DraftAngle
Accesses the draft angle in radians.