Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData
This .NET class wraps the AcDbIndexUpdateData ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.AddId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method does not check to see if the ObjectId corresponds to the same database as the one whose indexes are being updated.
id:  Object ID for which mapping data or flag data will be added later

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.SetIdFlags(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Byte)
Sets the ID flags.
id:  Object ID that flags is associated with
flags:  8-bit flag value associated with id

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.SetIdData(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.IntPtr)
Sets the ID data.
id:  Object ID that data is associated with
data:  32-bit data value associated with id

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.SetIdData(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Sets the ID data.
id:  Object ID that data is associated with
data:  32-bit data value associated with id

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.GetIdData(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete - Use the GetIdDataPtr property instead.
Returns the 32-bit data associated with id..
id:  Object ID that data is associated with

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.GetIdDataPtr(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns the 32-bit data value associated with id.
id:  Object ID that data is associated with

Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.GetIdFlags(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns the 8-bit flag value associated with id.
id:  Object ID that flags is associated with