Autodesk.AutoCAD.DatabaseServices.DgnDefinition
This .NET class wraps the AcDbDgnDefinition ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.SetShowRasterRef
Sets a boolean indicating whether raster images should be displayed in referenced DGN files.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.ShowRasterRef
Gets a boolean indicating whether raster images should be displayed in referenced (xref) DGN files.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.XrefDepth
Accesses the xref depth value (if any) that the underlay uses.

Autodesk.AutoCAD.DatabaseServices.DgnDefinition.UseMasterUnits
Assesses whether the underlay uses master units in the DGN file when the DGN file is being translated to DWG for the underlay to use.