Autodesk.AutoCAD.DatabaseServices.MeshFaceterData
Faceter settings to be used with the SubDMesh.GetObjectMesh Method.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.#ctor(System.Double,System.Double,System.Double,System.Double,System.UInt16,System.UInt16,System.UInt16,System.Int16)
Constructor.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterMeshType
Accesses the value for the faceter mesh type:
0: for new quad type,
1: for hybrid type(triangle & quad),
2: for triangle type.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterMinVGrid
Accesses the value for the minimum number of V parameter grid lines.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterMinUGrid
Accesses the value for the minimum number of U parameter grid lines.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterMaxGrid
Accesses the value for the maximum number of grid lines that may be used.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterMaxEdgeLength
Accesses the value for the maximum number of grid lines that may be used.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterGridRatio
Accesses the value for the maximum aspect ratio for the (quads in the) grid.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterDevNormal
Accesses the faceter devNormal setting.

Autodesk.AutoCAD.DatabaseServices.MeshFaceterData.FaceterDevSurface
Accesses the devSurface setting.