Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency
This class represents a dependency on a subentity (face/edge/vertex) of a geometric entity.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.DependentOnObjectMirrored
Called by the client code to inform the AssocGeomDependency that the object, whose subentity it depends on, has been mirrored.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.RedirectToAnotherSubentity(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets all AssocGeomDependencies on the old object that reference the given oldSubentId of that object and redirects them to reference the newSubentId of the new object.
oldObjectId:  The DBObject whose AssocGeomDependencies are to be redirected. It will be opened for write.
oldSubentId:  The SubentityId of the AssocGeomDependencies that is to be redirected.
newObjectId:  The object to redirect the dependencies to. It will be opened for write.
newSubentId:  The new SubentityId in the new object.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.FaceSubentityGeometry
Gets and sets surfaces of face subentities corresponding to the internally held AssocPersSubentityId, which must identify a face subentity type.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.EdgeSubentityGeometry
Gets and sets curves of edge subentities corresponding to the internally held AssocPersSubentityId, which must identify an edge subentity type.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.VertexSubentityGeometry
Gets and sets coordinates of vertex subentities corresponding to the internally held AssocPersSubentityId, which must identify a vertex subentity type.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.IsCachingSubentityGeometry
Indicates whether the dependency keeps a cache of the referenced subentity geometry (even if the cache may currently be empty).

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.TransientSubentCount
Gets the number of transient SubentityIds corresponding to the internally held AssocPersSubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.SubentityType
This is SubentityType, a member of class AssocGeomDependency.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.Subentity
Sets the internally held AssocPersSubentityId to persistently identify the given subentity.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.TransientSubentIds
Gets the transient SubentityIds of the dependent-on entity corresponding to the internally held AssocPersSubentityId.

Autodesk.AutoCAD.DatabaseServices.AssocGeomDependency.PersistentSubentId
Gets the reference to the internally held AssocPersSubentityId that identifies a subentity of the dependent-on entity.