Autodesk.AutoCAD.DatabaseServices.RevolveOptions
This .NET class wraps the AcDbRevolveOptions ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.#ctor(Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Copy constructor.
opts:  Input object to be copied.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.Clone
Clones the object.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.CheckRevolveCurve(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Boolean)
Checks whether the entity is valid for revolve operation. This function is called by CreateRevolvedSurface() and CreateRevolvedSolid(), so it is not necessary for an application to call this function.
axisPnt:  Input point on axis of revolution
axisDir:  Input direction of axis of revolution
displayErrorMessages:  Input Boolean value indicating whether to display error messages
unnamed:  Input the curve or region to be revolved

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.CloseToAxis
Accesses the close to axis option.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.TwistAngle
Accesses the angle by which the profile will be twisted as it revolves around the axis in radians.

Autodesk.AutoCAD.DatabaseServices.RevolveOptions.DraftAngle
Accesses the draft angle in radians.