Autodesk.AutoCAD.DatabaseServices.SectionManager
This .NET class wraps the AcDbSectionManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.SectionManager.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SectionManager.GetSection(System.String)
Gets the section plane in the database by name.
pszName:  Input name of the section plane to get

Autodesk.AutoCAD.DatabaseServices.SectionManager.GetEnumerator
Returns an enumerator for this collection.

Autodesk.AutoCAD.DatabaseServices.SectionManager.GetUniqueSectionName(System.String)
Gets a unique section plane name.
pszBaseName:  Input System.String object.

Autodesk.AutoCAD.DatabaseServices.SectionManager.NumSections
Returns the number of section planes  in the database.

Autodesk.AutoCAD.DatabaseServices.SectionManager.LiveSection
Gets the currently enabled  live section plane in the database.