Autodesk.AutoCAD.DatabaseServices.DetailSymbol
The DetailSymbol class represents the detail view symbol entity used by model documentation views in association with a Viewport entity.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.#ctor
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.IsOverriddenProperty(Autodesk.AutoCAD.DatabaseServices.DetailSymbolOverriddenProperty)
Tests the given flag to see if the property is overridden.
flag:  Input: the NAMESPACE_ACDB::DetailViewModelEdge value to test if it is overridden

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.IdentifierPosition
Returns the detail symbol's identifier position.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.ModelEdgeDirection
Returns the direction of the detail symbol's model edge (full boundary around detail view).

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.ModelEdgeOrigin
Returns the origin of the detail symbol's model edge (full boundary around detail view).

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.BoundarySize
Returns the detail symbol's boundary size vector.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Direction
Returns the detail symbol's direction vector.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Origin
Returns the detail symbol's origin.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.DetailViewScale
Returns the associated detail view's scale.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.OwningViewScale
Returns the parent view's scale.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.DisplayIdentifier
Returns flag indicating whether the detail symbol's identifier is to be displayed.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.ModelEdgeType
The type of the detail symbol Model Edge.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.BoundaryType
The type of the detail symbol boundary.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Identifier
The identifier of the detail symbol.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.Scale
The scale of the detail symbol entity.

Autodesk.AutoCAD.DatabaseServices.DetailSymbol.SymbolStyleId
The object ID of the DetailViewStyle object associated with this entity.