Autodesk.AutoCAD.DatabaseServices.ObjectErasedEventArgs
This class provides data for the ObjectErased event of the Database class.

Autodesk.AutoCAD.DatabaseServices.ObjectErasedEventArgs.Erased
Accesses a value indicating whether the object was erased or unerased.

Autodesk.AutoCAD.DatabaseServices.ObjectErasedEventArgs.DBObject
Accesses the object that is changed.