Autodesk.AutoCAD.Runtime.RXClass
This .NET class wraps the AcRxClass ObjectARX class.

Autodesk.AutoCAD.Runtime.RXClass.AddX(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Runtime.RXObject)
Adds the class protocol extension object protocolObject into the protocol extension object dictionary of Class object.
runtimeClass:  Input object for the protocol extension class.
protocolExtension:  Input protocol extension object.

Autodesk.AutoCAD.Runtime.RXClass.GetX(Autodesk.AutoCAD.Runtime.RXClass)
Returns the protocol extension object stored with the key protocolClass.
runtimeClass:  Input object for the protocol extension class.

Autodesk.AutoCAD.Runtime.RXClass.DelX(Autodesk.AutoCAD.Runtime.RXClass)
Searches the Class object's protocol extension dictionary for an entry with the key protocolClass, and if found, removes the entry.
runtimeClass:  Input object for the protocol extension class.

Autodesk.AutoCAD.Runtime.RXClass.QueryX(Autodesk.AutoCAD.Runtime.RXClass)
Returns the protocol extension object stored with the key protocolClass.
runtimeClass:  Input Autodesk.AutoCAD.Runtime.RXClass object for the protocol extension class.

Autodesk.AutoCAD.Runtime.RXClass.IsDerivedFrom(Autodesk.AutoCAD.Runtime.RXClass)
When an object's isKindOf() method is called, its associated Class object's isDerivedFrom() is called to make the determination.
runtimeClass:  Input object for the desired base class.

Autodesk.AutoCAD.Runtime.RXClass.EntityAlignment
Automatically aligns block instances to adjacent objects.

Autodesk.AutoCAD.Runtime.RXClass.Create
Creates a new instance of the C++ class that this RxClass object represents.

Autodesk.AutoCAD.Runtime.RXClass.GetRuntimeType
Gets the type declaration of the class.

Autodesk.AutoCAD.Runtime.RXClass.MyParent
Returns the Class object associated with the base class of the class that is represented by the Class object on which this method is called.

Autodesk.AutoCAD.Runtime.RXClass.ProxyFlags
Returns the value which was set as the third parameter to either the global newClass() pseudo-constructor or the ACRX_DXF_DEFINE_MEMBERS macro.

Autodesk.AutoCAD.Runtime.RXClass.ClassVersion
Returns DWG_VERSION and MAINTENANCE_VERSION, which must be specified when the class is registered.

Autodesk.AutoCAD.Runtime.RXClass.Name
Returns a string that is the name of the C++ class represented by this Class object.

Autodesk.AutoCAD.Runtime.RXClass.DxfName
Returns the DXF name for the class.

Autodesk.AutoCAD.Runtime.RXClass.AppName
Returns the application name string which is the last parameter in the ACRX_DXF_DEFINE_MEMBERS macro and is also the last parameter to the global newClass() pseudo-constructor.