Autodesk.AutoCAD.DatabaseServices.AssocDraggingState
While in the middle of evaluation, the action may inquire the client code whether the evaluation is happening from inside of the dragging loop and at which stage the dragging is.