Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor
This class encapsulates a PlotStyleNameType ObjectARX enum value, and the object ID of the associated plot style name dictionary entry.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PlotStyleNameType)
Creates a new object.
id:  Object ID of plot to create from
type:  New type of plot style name

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.Equals(System.Object)
Returns true if this object is identical to the argument object.
unmanagedObjPtr:  Object to compare with

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.op_Equality(Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor,Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.op_Inequality(Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor,Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Culture-specific format

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.Type
Accesses the type of plot style name.

Autodesk.AutoCAD.DatabaseServices.PlotStyleDescriptor.Id
Accesses the plot ID.