Autodesk.AutoCAD.DatabaseServices.XrefPreXrefLockFileEventArgs
This class provides data for the XrefPreXrefLockFile event.

Autodesk.AutoCAD.DatabaseServices.XrefPreXrefLockFileEventArgs.btrId
Returns the btrId property value.