Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2
This .NET class wraps the AcDb2LineAngularDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine2End
Accesses the dimension definition point (in WCS coordinates) that is used for the end point of the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine2Start
Accesses the dimension definition point (in WCS coordinates) that is used for the start point of the second extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine1End
Accesses the dimension definition point (in WCS coordinates) that is used for the end point of the first extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.XLine1Start
Accesses the dimension definition point (in WCS coordinates) that is used for the start point of the first extension line of the dimension.

Autodesk.AutoCAD.DatabaseServices.LineAngularDimension2.ArcPoint
Accesses the dimension definition point (in WCS coordinates) that is used to determine the location of the arc of the dimension.