Autodesk.AutoCAD.DatabaseServices.DBObject
This .NET class wraps the AcDbObject ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DBObject.DeepClone(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
This function gives control of deep clone operations to the object. In the default implementation, the object is cloned and appended to the owner object (ownerPointer). The cloning is performed by an DeepCloneFiler. A record is also added to the idMap. Then, using the filer, any owned objects are deep cloned, with isPrimary set to false.
ownerPointer:  Object to which the clones should be appended
idMap:  Current object ID map
isPrimary:  Boolean indicating whether this object is primary or owned

Autodesk.AutoCAD.DatabaseServices.DBObject.WblockClone(Autodesk.AutoCAD.Runtime.RXObject,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
This function is almost identical to DBObject.DeepClone, except that a WblockCloneFiler is used and ownership is not carried across database boundaries. Subcloning is based on hard owner and hard pointer connections.
ownerPointer:  Input object to which the clones should be appended. If the owner has not been cloned, then the Database must be passed in.
idMap:  Input current object ID map
isPrimary:  Input Boolean indicating whether this object is primary or owned

Autodesk.AutoCAD.DatabaseServices.DBObject.DecomposeForSave(Autodesk.AutoCAD.DatabaseServices.DwgVersion)
This member function is used to control behavior for custom objects and entities when saving to previous formats.
version:  DWG version being saved to

Autodesk.AutoCAD.DatabaseServices.DBObject.CreateExtensionDictionary
Creates a DBDictionary object and sets it up as the extension dictionary for the DBObject.

Autodesk.AutoCAD.DatabaseServices.DBObject.ReleaseExtensionDictionary
Removes the object's extension dictionary (that is, removes the object as the owner of the dictionary object) if it exists and is empty.

Autodesk.AutoCAD.DatabaseServices.DBObject.UpgradeOpen
If the object is currently open OpenMode.ForRead with only one reader, then this function upgrades the object to open OpenMode.ForWrite.

Autodesk.AutoCAD.DatabaseServices.DBObject.UpgradeFromNotify
Upgrades the object from being at least open OpenMode.ForNotify to being open both OpenMode.ForNotify and OpenMode.ForWrite.

Autodesk.AutoCAD.DatabaseServices.DBObject.DowngradeOpen
Downgrades the object from being open OpenMode.ForWrite, to being OpenMode.ForRead.

Autodesk.AutoCAD.DatabaseServices.DBObject.DowngradeToNotify(System.Boolean)
Restores an object from being open both OpenMode.ForNotify and OpenMode.ForWrite, to being open just OpenMode.ForNotify. The wasWritable value that was returned from the matching DBObject.upgradeFromNotify() call should be passed into this function to restore the proper open status.
This function must have been preceded by a call to upgradeFromNotify().
wasWritable:  Input indicating if object was open for write when upgradeFromNotify was called

Autodesk.AutoCAD.DatabaseServices.DBObject.Cancel
Terminates the current open operation.

Autodesk.AutoCAD.DatabaseServices.DBObject.Close
Closes the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.CloseAndPage(System.Boolean)
Closes the object and pages it if the object pager is turned on. All changes made to the object since it was opened are committed to the database, and a "closed" notification (as well as any other appropriate notification such as "modified", "erased", and so on) is sent.
onlyWhenClean:  Boolean indicating to turn off or on undo recording

Autodesk.AutoCAD.DatabaseServices.DBObject.Erase
Sets the erase bit of the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.Erase(System.Boolean)
Sets the erase bit of the object.
erasing:  Boolean indicating if object is to be erased or unerased

Autodesk.AutoCAD.DatabaseServices.DBObject.SwapReferences(Autodesk.AutoCAD.DatabaseServices.IdMapping)
The purpose of this method is similar to the object ID reference translations done at the end of deep cloning.
idMap:  Input refedit ID map

Autodesk.AutoCAD.DatabaseServices.DBObject.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
This function is called by AutoCAD when the AUDIT command is executed.
auditInfo:  An AuditInfo object

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgIn(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's DBObject.dwgInFields() function, and then reads in any xdata attached to the object.
filer:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.DwgOut(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's DBObject.dwgOutFields() function, and then writes out any xdata attached to the object.
filer:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.DxfIn(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
This function does some internal book keeping by reading in any xdata that comes before the main entity data.
filer:  DXF filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.DxfOut(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
This function does some internal bookkeeping, calls the object's DBObject.dxfOutFields() function, and then writes out any xdata attached to the object.
filer:  Filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.XDataTransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
This method applies the xform transformation matrix to any XData data types 1011, 1021, 1031, 1012, 1022, 1032, 1013, 1023, 1033, 1041, and 1042 in the object's XData.
transform:  Transformation matrix to be applied to the XData

Autodesk.AutoCAD.DatabaseServices.DBObject.GetXDataForApplication(System.String)
Gets the xdatafrom the identified application.
applicationName:  Name of the registered application to use when retrieving the xdata

Autodesk.AutoCAD.DatabaseServices.DBObject.GetBinaryDataForKey(System.String)
This function reads a chunk of binary data from this object's extension dictionary.
key:  Input extension dictionary key under which the data is stored

Autodesk.AutoCAD.DatabaseServices.DBObject.SetBinaryDataForKey(System.String,System.Byte[])
This function copies the binary data in the chunk array into this object's extension dictionary.
key:  Input extension dictionary key to be used
chunk:  Input a flat array of bytes that are the binary data to save

Autodesk.AutoCAD.DatabaseServices.DBObject.DisableUndoRecording(System.Boolean)
Turns off or on the Undo recording for the object. If disable is set to true, then Undo recording is turned off.
disable:  Boolean indicating to turn off or on Undo recording

Autodesk.AutoCAD.DatabaseServices.DBObject.ApplyPartialUndo(Autodesk.AutoCAD.DatabaseServices.DwgFiler,Autodesk.AutoCAD.Runtime.RXClass)
This function is called by AutoCAD whenever an Undo operation is performed on the DBObject object and the object has consistently set the autoUndo Boolean in all assertWriteEnabled() calls to false, thus indicating that it's using the partial undo mechanism.
undoFiler:  The undo filer containing the partial undo information to be re-instated
classObj:  The RXClass object for the class that is expected to be handling this Undo information

Autodesk.AutoCAD.DatabaseServices.DBObject.GetReactors
This function is obsolete.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetTransientReactors
Retrieves the transient reactors.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetPersistentReactorIds
Returns the persistent reactor collection list.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetObjectIdsInFlux
This function must be called on any newly created objects in DBObject.DeepClone or DBObject.WblockClone.

Autodesk.AutoCAD.DatabaseServices.DBObject.GetObjectSaveVersion(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
Override this function to specify which version the object data needs to be stored in.
filer:  DXF filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.GetObjectSaveVersion(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
Override this function to specify which version the object data needs to be stored in.
filer:  Filer to be used for this filing operation

Autodesk.AutoCAD.DatabaseServices.DBObject.GetField(System.String)
This function provides access to Field objects associated with a database object and the supplied property name by returning the object ID.
propertyName:  Input a property name for the field you want to retrieve

Autodesk.AutoCAD.DatabaseServices.DBObject.GetField
This function provides access to Field objects associated with a database object by returning the object ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField(System.String)
Removes the specified field.
propertyName:  Property name whose field is to be removed

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveField
Removes the text field.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetFromStyle
Sets the annotative property of an object from its (optionally) associated style.

Autodesk.AutoCAD.DatabaseServices.DBObject.ResetScaleDependentProperties
Resets any scale dependent object properties to the default values.

Autodesk.AutoCAD.DatabaseServices.DBObject.SetPaperOrientation(System.Boolean)
Sets the current value of the paper orientation property on an annotative object.
bPaperOrientation:  The new value for the paper orientation property.

Autodesk.AutoCAD.DatabaseServices.DBObject.ApplyPaperOrientationTransform(Autodesk.AutoCAD.DatabaseServices.Viewport)
Transforms the object to align it to the paper-space viewport if the object supports the paper orientation property.
viewport:  The viewport in which the object is to be displayed.

Autodesk.AutoCAD.DatabaseServices.DBObject.SupportsCollection(System.String)
Determines if a particular context type is supported by the object.
collectionName:  The name of the collection (context type) to test for support.

Autodesk.AutoCAD.DatabaseServices.DBObject.HasContext(Autodesk.AutoCAD.DatabaseServices.ObjectContext)
Determines whether a context with the specified name exists in the collection.
context:  The context to check for.

Autodesk.AutoCAD.DatabaseServices.DBObject.AddContext(Autodesk.AutoCAD.DatabaseServices.ObjectContext)
Adds a copy of a context to the object.
context:  The context to add.

Autodesk.AutoCAD.DatabaseServices.DBObject.RemoveContext(Autodesk.AutoCAD.DatabaseServices.ObjectContext)
Removes a context from the collection.
context:  The context to remove from the collection.

Autodesk.AutoCAD.DatabaseServices.DBObject.PaperOrientation
Accesses the current value of the paper orientation property on an annotative object.

Autodesk.AutoCAD.DatabaseServices.DBObject.Annotative
Accesses the annotative status.

Autodesk.AutoCAD.DatabaseServices.DBObject.HasFields
Returns true if the object has one or more fields.

Autodesk.AutoCAD.DatabaseServices.DBObject.ClassID
Accesses the class ID for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.ObjectBirthVersion
Accesses the birth version of an object.

Autodesk.AutoCAD.DatabaseServices.DBObject.HasSaveVersionOverride
Accesses if the object has the bit set to override the filer version.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsObjectIdsInFlux
This refers to a condition that occurs during deep clone operations.

Autodesk.AutoCAD.DatabaseServices.DBObject.UndoFiler
Accesses the undo filer for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsAProxy
Returns true if the object is a proxy.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsTransactionResident
Returns true if the object is currently part of a transaction.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsReallyClosing
Returns true if calling Close() at this time would really close the object completely.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsCancelling
Returns true if the object is currently in the middle of a Cancel() call (that is, an open is being canceled and all changes made are being rolled back).

Autodesk.AutoCAD.DatabaseServices.DBObject.IsUndoing
Returns true if the object is involved in an Undo operation at this time.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsNotifying
Returns true if the object is in the process of sending notification.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsNewObject
Returns true if the object has not yet been closed since it was first created.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsModifiedGraphics
Returns true if the object is derived from Entity nabled() called since it was opened (which would indicate that a member function that can change its data was called), or its RecordGraphicsModified() function called with an true argument value.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsModifiedXData
Returns true if the object has had an AssertWriteEnabled() called since it was opened (which would indicate that a member function that can change its data was called) and has then had its SetXData() method called.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsModified
Returns true if the object has had an AssertWriteEnabled() called since it was opened (which would indicate that a member function that can change its data was called).

Autodesk.AutoCAD.DatabaseServices.DBObject.IsNotifyEnabled
Returns true if the object is currently open OpenMode.ForNotify.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsWriteEnabled
Returns true if the object is currently /c> and is not currently sending notification.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsReadEnabled
Returns true if the object is currently open OpenMode.ForRead.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsErased
Returns true if the object associated with this object ID is erased.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsEraseStatusToggled
Returns true if the object's erase bit has been toggled since it was opened.

Autodesk.AutoCAD.DatabaseServices.DBObject.XData
Accesses the xdata on the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.MergeStyle
Accesses the merge style of the dictionary.

Autodesk.AutoCAD.DatabaseServices.DBObject.ExtensionDictionary
Accesses the extension dictionary for the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.Drawable
Accesses the Drawable object.

Autodesk.AutoCAD.DatabaseServices.DBObject.Database
Accesses the database used by the object.

Autodesk.AutoCAD.DatabaseServices.DBObject.Handle
Accesses the associated handle object.

Autodesk.AutoCAD.DatabaseServices.DBObject.OwnerId
Accesses the owner ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.ObjectId
Accesses the object ID.

Autodesk.AutoCAD.DatabaseServices.DBObject.Id
Returns the Id property value.

Autodesk.AutoCAD.DatabaseServices.DBObject.IsPersistent
Returns true if the Drawable object is database resident (belongs to an Model that requires the use of open and close functions).