Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE
When implemented and registered as a protocol extension to an Autodesk.AutoCAD.DatabaseServices.Entity-derived class, this protocol extension interface specifies the communication with the grip editing complex for information on what alternatives can be provided to stretching grip points.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.GetGripModes(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripData,Autodesk.AutoCAD.DatabaseServices.GripModeCollection,System.UInt32&)
Queries an object, on a given grip point, for the available modes it provides.
entity:  The Entity whose modes are requested. The object needs to be open at least for read.
gripData:  The grip whose modes are requested.
modes:  The returned collection of available modes.
curMode:  The returned identifier of current mode.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.CurrentModeId(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripData)
Gets the current mode identifier.
entity:  The Entity whose current mode id is requested.
gripData:  The grip whose mode id is requested.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.CurrentMode(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripData)
Gets the current mode.
entity:  The Entity whose current mode is requested.
gripData:  The grip whose mode is requested.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.SetCurrentMode(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripData,System.UInt32)
Sets the current mode.
entity:  The Entity whose current mode is to be set current.
gripData:  The grip whose current mode is to be set current.
curMode:  The numerical identifier for the new current mode.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.GetGripType(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripData)
Gets the grip type of a given grip.
entity:  The Entity whose grip type is requested.
gripData:  The grip whose grip type is requested.

Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.Reset(Autodesk.AutoCAD.DatabaseServices.Entity)
Resets the current mode to default (up to each concrete class to establish what the default is).
entity:  The Entity whose current mode is reset to default.