Autodesk.AutoCAD.DatabaseServices.MlineStyle
This .NET class wraps the AcDbMlineStyle ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.#ctor
No initialization done in this constructor.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Reset
Resets the MlineStyle information.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Set(Autodesk.AutoCAD.DatabaseServices.MlineStyle,System.Boolean)
Copies the information from source into the MlineStyle.
If checkIfReferenced is true and the mline style object is referenced, then the set operation will be aborted. This indicates that it is not safe to change this mline style object.
source:  Input MlineStyle to copy from
checkIfReferenced:  Input Boolean indicating whether to check if the style is referenced

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Elements
Accesses the elements in use.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndAngle
Accesses the angle (in radians) to which the end of mlines using this MlineStyle will be "cut." The default value for the end angle is pi/2 radians.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartAngle
Accesses the angle (in radians) to which the start of Mlines using this MlineStyle will be "cut." An angle of pi/2 radians is perpendicular to the mline's direction.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Filled
Accesses if the MlineStyle has fill set to "on" (that is, mlines referencing the MlineStyle will be filled).

Autodesk.AutoCAD.DatabaseServices.MlineStyle.FillColor
Accesses a Color object representing the fill color for the MlineStyle.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndInnerArcs
Accesses if the MlineStyle is set to show inner arcs at the mline ends.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndRoundCap
Accesses if the MlineStyle is set to use round endcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.EndSquareCap
Accesses if the MlineStyle is set to use square endcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartInnerArcs
Accesses if the MlineStyle is set to show inner arcs at the mline starts.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartRoundCap
Accesses if the MlineStyle is set to use round startcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.StartSquareCap
Accesses if the MlineStyle is set to use square startcaps.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.ShowMiters
Accesses if the MlineStyle is set to show miterlines in the mline joints.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Name
Accesses the name string in the MlineStyle.

Autodesk.AutoCAD.DatabaseServices.MlineStyle.Description
Accesses the description string for the MlineStyle object.