Autodesk.AutoCAD.Geometry.Matrix2dBuilder
This class is required to build instances of Autodesk.AutoCAD.Geometry.Matrix2d , which is an immutable value type.

Autodesk.AutoCAD.Geometry.Matrix2dBuilder.#ctor(Autodesk.AutoCAD.Geometry.Matrix2d)
Constructs a new builder based on an existing matrix.
value:  Input matrix

Autodesk.AutoCAD.Geometry.Matrix2dBuilder.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Matrix2dBuilder.ToMatrix2d
Returns the Matrix2d object built using this object.