Autodesk.AutoCAD.DatabaseServices.AssocEvaluationMode
At the beginning of AssocActionBody.EvaluateOverride() implementation, the custom code needs to query the mode in which it should evaluate itself.