Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule
This .NET class wraps the ObjectARX class AcGiDrawableOverrule.

Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule.SetAttributes(Autodesk.AutoCAD.GraphicsInterface.Drawable,Autodesk.AutoCAD.GraphicsInterface.DrawableTraits)
This .NET method wraps the ObjectARX method AcGiDrawableOverrule::setAttributes().

Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule.SetXDataFilter(System.String)
Enables the use of xdata in determining whether overrules apply.
registeredApplicationName:  Input the name of the registered application.

Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule.SetExtensionDictionaryEntryFilter(System.String)
Enables the use of extension dictionary lookups to determine whether overrules apply.
entryName:  Input the name of the entry.

Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule.SetCustomFilter
Enables the use of the IsApplicable method in determining whether an overrule applies.

Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule.SetIdFilter(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Enables the use of id lookups to determine whether overrules apply.
ids:  Input an array of ObjectId.

Autodesk.AutoCAD.GraphicsInterface.DrawableOverrule.SetNoFilter
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.