Autodesk.AutoCAD.Geometry.Point3d
This class wraps AcGePoint3d ObjectARX class.

Autodesk.AutoCAD.Geometry.Point3d.#ctor(Autodesk.AutoCAD.Geometry.PlanarEntity,Autodesk.AutoCAD.Geometry.Point2d)
Constructs 3D point by the formula  p + uAxis * point.x + vAxis * point.y,
where 3D point p and 3D vectors uAxis and vAxis form the coordinate system in planar entity plane and can found by function call plane.get(p, uAxis, vAxis).
plane:  Input plane
point:  Input 2D point

Autodesk.AutoCAD.Geometry.Point3d.#ctor(System.Double[])
Constructs 3D point with coordinates taken from the first three array elements.
xyz:  Input array of coordinates

Autodesk.AutoCAD.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Constructs a 3D point with coordinates x, y, and z.

Autodesk.AutoCAD.Geometry.Point3d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms this pre-multiplying it by the matrix leftSide.
leftSide:  Input transform matrix

Autodesk.AutoCAD.Geometry.Point3d.RotateBy(System.Double,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Point3d)
Rotates the entity by the input angle about the line defined by the input point and vector.
angle:  Input angle of rotation
vector:  Input vector about which entity is to be rotated
centerPoint:  Input point about which to rotate

Autodesk.AutoCAD.Geometry.Point3d.ScaleBy(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Returns 3d point that is the result of scaling this point with respect to the input point by the scale factor.
scaleFactor:  Input scale factor
centerPoint:  Input center of scaling

Autodesk.AutoCAD.Geometry.Point3d.MultiplyBy(System.Double)
Returns 3D point which is the result of multiplying this point with value.
value:  Input object to be multiplied with the 3D point

Autodesk.AutoCAD.Geometry.Point3d.DivideBy(System.Double)
Returns the 3D point which is the result of diving this point by value.
value:  Input for dividing the 3D point.

Autodesk.AutoCAD.Geometry.Point3d.Add(Autodesk.AutoCAD.Geometry.Vector3d)
Returns the 3D point which is the result of adding this point to 3D vector value.
value:  Input object to be added.

Autodesk.AutoCAD.Geometry.Point3d.Subtract(Autodesk.AutoCAD.Geometry.Vector3d)
Returns 3D point which is the result of subtracting value from this point.
value:  Input object to be subtracted from the 3D point.

Autodesk.AutoCAD.Geometry.Point3d.GetAsVector
Converts 3D point into 3D vector with the same set of coordinates.

Autodesk.AutoCAD.Geometry.Point3d.DistanceTo(Autodesk.AutoCAD.Geometry.Point3d)
Evaluates and returns distance from this point to the point point.
point:  Input point to measure to

Autodesk.AutoCAD.Geometry.Point3d.GetVectorTo(Autodesk.AutoCAD.Geometry.Point3d)
Evaluates and returns the vector with respect to the point point.
point:  Input point to measure to

Autodesk.AutoCAD.Geometry.Point3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point3d)
This method calls Point3d.IsEqualTo(Point3d a, Tolerance tolerance) with tolerance set to Global.
point:  Input object to check against

Autodesk.AutoCAD.Geometry.Point3d.IsEqualTo(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this point is within the distance tolerance.equalPoint() from the point a.
point:  Input object to check against
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Point3d.Convert2d(Autodesk.AutoCAD.Geometry.PlanarEntity)
Returns 2D point with the coordinates corresponding to the decomposition of the vector *this - p in the basis uAxis, vAxis in the planar entity, where p, uAxis, and vAxis can found by function call pln.get(p, uAxis, vAxis).
plane:  Input plane

Autodesk.AutoCAD.Geometry.Point3d.OrthoProject(Autodesk.AutoCAD.Geometry.Plane)
Projects the 3D point with respect to the plane without direction vector.
plane:  Input plane

Autodesk.AutoCAD.Geometry.Point3d.Project(Autodesk.AutoCAD.Geometry.Plane,Autodesk.AutoCAD.Geometry.Vector3d)
Projects the 3D point with respect to the plane and direction vector vector.
plane:  Input plane
vector:  Input vector Input axis of rotation
angle:  Input rotation angle
centerPoint:  Input center of rotation

Autodesk.AutoCAD.Geometry.Point3d.Mirror(Autodesk.AutoCAD.Geometry.Plane)
Returns the 3D point which is the result of mirroring of this point with respect to 3D line line in the same plane.
plane:  Input line of symmetry

Autodesk.AutoCAD.Geometry.Point3d.Equals(System.Object)
Returns true if this object is equal to obj.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Point3d.op_Inequality(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Point3d.op_Equality(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Point3d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix3d,Autodesk.AutoCAD.Geometry.Point3d)
Multiplies mat and b.
mat:  Left operand
a:  Right operand

Autodesk.AutoCAD.Geometry.Point3d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Point3d)
Multiplies value and a.
value:  Left operand
a:  Right operand

Autodesk.AutoCAD.Geometry.Point3d.op_Multiply(Autodesk.AutoCAD.Geometry.Point3d,System.Double)
Multiplies a and value.
a:  Left operand
value:  Right operand

Autodesk.AutoCAD.Geometry.Point3d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Point3d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
format:  Input format
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Point3d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Point3d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Point3d.ToArray
This method returns an array containing the X, Y, and Z coordinate values for this point.

Autodesk.AutoCAD.Geometry.Point3d.Origin
Returns the origin of point 3D space.

Autodesk.AutoCAD.Geometry.Point3d.Z
Returns the Z coordinate axis.

Autodesk.AutoCAD.Geometry.Point3d.Y
Returns the Y coordinate axis.

Autodesk.AutoCAD.Geometry.Point3d.X
Returns the X coordinate axis.