Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection
This class contains a collection of graph nodes.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Index to remove from

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Add(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Adds an item to the collection.
value:  Item to add.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Returns the zero-based index of the collection item that matches value.
value:  Item to seek

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.GraphNode)
Inserts value at position index in the collection.
index:  Location to insert
value:  Item to insert

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Remove(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Removes the object represented by value from this collection.
value:  Item to remove.

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Contains(Autodesk.AutoCAD.DatabaseServices.GraphNode)
Returns a value indicating whether the collection contains an object that matches value.
value:  Object to check for

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.GraphNode[],System.Int32)
Copies objects in array to this collection, starting from index.
array:  Array to copy from
index:  Zero-based index to start from

Autodesk.AutoCAD.DatabaseServices.GraphNodeCollection.Count
Accesses the number of items in the collection.