Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex
This .NET class wraps the AcDbPolygonMeshVertex ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d)
Constructs a PolygonMeshVertex that uses position as the position point.
point:  Input WCS position point for the vertex

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.Position
Accesses the WCS point value of this vertex.

Autodesk.AutoCAD.DatabaseServices.PolygonMeshVertex.VertexType
Accesses the Vertex3dType of this vertex.