Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d
This .NET class wraps the AcGeAugPolyline3d ObjectARX class.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,System.Double,System.Double,System.Double)
Constructs polyline which approximates the input curve.
curve:  Input any 3D curve
fromParameter:  Input parameter value on curve
toParameter:  Input parameter value on curve (must be larger than fromParam)
eps:  Input approximation distance

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection)
Constructs object representing a 3D polyline with attached vectors at each control point.
controlPoints:  Input control point array
vectorBundle:  Input vector array

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor(Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Vector3dCollection)
Constructor.
knots:  Input knot vector
controlPoints:  Input control point collection
vectorBundle:  Input vector bundle collection

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.GetPointAt(System.Int32)
Returns the point at the specified index.
index:  Input index of a point

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.SetPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Resets point at the specified index to the input point.
index:  Input index of a vector
point:  Input 3d point

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.GetVectorAt(System.Int32)
Returns a vector at the specified index.
index:  Input index of a vector

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.SetVectorAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Resets vector at the specified index to the input vector.
index:  Input index of a vector
point:  Input vector point

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.GetD2VectorAt(System.Int32)
Returns second derivative vector at the specified index.
index:  Input index of a vector

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.SetD2VectorAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
Resets second derivative vector at the specified index to the input vector.
index:  Input index of a vector
point:  Input vector point

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.ApproximateTolerance
Returns tolerance that was used to construct polyline if polyline was constructed to approximate a 3D curve.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.D2Vectors
Returns list of second derivative vectors at each point of the polyline.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.D1Vectors
Returns list of tangent vectors at each point of the polyline.

Autodesk.AutoCAD.Geometry.AugmentedPolylineCurve3d.Points
Returns list of points that define the polyline.