Autodesk.AutoCAD.DatabaseServices.DataCell
This .NET class wraps the AcDbDataCell ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DataCell.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DataCell.Init
This function re-initializes the cell by clearing its value.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetBool(System.Boolean)
Sets a boolean value for this cell.
value:  Input System.Boolean object.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetInteger(System.Int32)
Sets an integer value for this cell.
value:  Input System.Int32 object.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetDouble(System.Double)
Sets a double value for this cell.
value:  Input System.Double object.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetString(System.String)
Sets a string value for this cell.
value:  Input System.String object

Autodesk.AutoCAD.DatabaseServices.DataCell.SetPoint(Autodesk.AutoCAD.Geometry.Point3d)
Sets a 3D point ID value for this cell.
value:  Input Autodesk.AutoCAD.Geometry.Point3d object

Autodesk.AutoCAD.DatabaseServices.DataCell.SetVector(Autodesk.AutoCAD.Geometry.Vector3d)
Sets a 3D vector value for this cell.
value:  Input Autodesk.AutoCAD.Geometry.Vector3d object.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetObjectId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets an object ID value for this cell.
value:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object

Autodesk.AutoCAD.DatabaseServices.DataCell.SetHardOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the hard ownership id for this cell.
value:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object.

Autodesk.AutoCAD.DatabaseServices.DataCell.SetSoftOwnershipId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets a soft ownership ID value for this cell.
value:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object

Autodesk.AutoCAD.DatabaseServices.DataCell.SetHardPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the hard pointer ID for this cell.
value:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object

Autodesk.AutoCAD.DatabaseServices.DataCell.SetSoftPointerId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets a soft pointer ID value for this cell.
value:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object

Autodesk.AutoCAD.DatabaseServices.DataCell.CellType
Accesses the type associated with this cell.

Autodesk.AutoCAD.DatabaseServices.DataCell.Value
Accesses the value of this cell.