Autodesk.AutoCAD.DatabaseServices.DrawOrderTable
This .NET class wraps the AcDbSortentsTable ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetSortHandle(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Given an input object ID, this function returns the Handle that indicates the draw order.
id:  Input object ID

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveToBottom(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Places all the entities specified in the input object ID array at the beginning of the draw order.
collection:  Collection of object IDs

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveToTop(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Places all the entities specified in the input object ID array at the ending of the draw order.
collection:  Collection of object IDs

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveBelow(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Places all the entities specified in the input object ID array below the specified target entity.
collection:  Collection of object IDs
target:  Target entity

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.MoveAbove(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Places all the entities specified in the input object ID array above the specified target entity.
collection:  Collection of object IDs
target:  Target entity

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.SwapOrder(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Swaps the draw order positions of the entities.
id1:  Object ID of first entity
id2:  Object ID of second entity

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.FirstEntityIsDrawnBeforeSecond(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if first is drawn before second.
first:  Input first object ID
second:  Input second object ID

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetFullDrawOrder(System.Byte)
SYstem
Returns an collection of the entity object IDs of the block in the order in which they would be drawn in SORTENTS-enabled contexts.
honorSortEntitiesMask:  Input indicating whether to test the host database's $SORTENTS variable

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.GetRelativeDrawOrder(System.Byte)
Rearranges the object IDs in the input array into their current relative draw order.
honorSortEntitiesMask:  Input indicating whether to test the host database's $SORTENTS variable

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.SetRelativeDrawOrder(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Takes the object IDs in the input collection and moves them in their current associated draw order slots so that they are drawn in the specified order.
collection:  Collection of object IDs

Autodesk.AutoCAD.DatabaseServices.DrawOrderTable.BlockId
Accesses the object ID for the associated block table record.