Autodesk.AutoCAD.DatabaseServices.ConstrainedCircle
This class represents a constrained circle node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedCircle.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained circle is holding on.

Autodesk.AutoCAD.DatabaseServices.ConstrainedCircle.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedCircle.CenterPoint
Gets the center point of the constrained circle, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedCircle.Radius
Gets the radius of the constrained circle.