Autodesk.AutoCAD.DatabaseServices.PlotSettings
This .NET class wraps the AcDbPlotSettings ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.#ctor(System.Boolean)
This constructor allows you to set whether the new plot setup is a model space type (modelType == true) or a paperspace (layout) type (modelType == false).
modelType:  Input Boolean that determines the plot setup type

Autodesk.AutoCAD.DatabaseServices.PlotSettings.AddToPlotSettingsDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Adds plot settings to the dictionary.
toWhichDatabase:  Input database to which to add plot settings object

Autodesk.AutoCAD.DatabaseServices.PlotSettings.SetShadePlot(Autodesk.AutoCAD.DatabaseServices.PlotSettingsShadePlotType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the plot settings for shaded or rendered plotting.
type:  Input type of the shade plot object
shadePlotId:  Input object ID of the VisualStyle or RenderSettings object to be used as the shade plot object

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotAsRaster
Assesses whether or not the viewport will plot as a raster based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotWireframe
Assesses whether or not the viewport will plot as vector output based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotId
Accesses the ObjectId of the VisualStyle or RenderSettings object referenced by this object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ModelType
Assesses whether a named plot setup is a model space type or a paperspace (layout) type.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.DrawViewportsFirst
Assesses whether the plotting system will plot the objects in paperspace first (if it returns false), or last (if it returns true).

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PrintLineweights
Assesses whether lineweights will get plotted.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ScaleLineweights
Assesses whether lineweights will be scaled proportionately with the plot scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.StdScale
Accesses the standard scale value as a floating point scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.StdScaleType
Accesses the standard scale as a value of the enumerated type StdScaleType.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CurrentStyleSheet
Accesses the name of the configured plot style table.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CustomPrintScale
Accesses the custom scale, a ratio of paperspace units to media units.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.UseStandardScale
Assesses whether the layout is currently using the StdScaleType property to calculate the current plot scale.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotViewName
Accesses a named view that in turn specifies what portion of the layout to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotWindowArea
Accesses the portion of the layout to plot.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotType
Accesses the portion of paperspace to output to the media.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotCustomDpi
Accesses the shade plot custom dpi of the current PlotSettings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotResLevel
Accesses the shade plot resolution level of the current PlotSettings object.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlot
Accesses the type of shade plot specified in the plot settings.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotHidden
Assesses whether or not the objects in paperspace are processed through the hidden line algorithm.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotCentered
Assesses whether the plot will be centered.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotRotation
Accesses the rotation of the plot on the paper.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShowPlotStyles
Assesses whether the object style is displayed during layout mode.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPlotStyles
Indicates whether plot styles are plotted (as opposed to just displayed).

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotTransparency
Indicates whether object transparency is plotted.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotViewportBorders
Accesses the floating model space viewport borders are plotted.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperUnits
Accesses the units used for plotting in the enumeration PlotPaperUnits.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotOrigin
Accesses the plot origin offset that is applied inside of the paper margins.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.CanonicalMediaName
Accesses the locale-independent name of the currently configured paper.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperSize
Accesses the width and height of the configured paper.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotPaperMargins
Accesses the printable area of the configured paper.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotConfigurationName
Accesses a PC3 file containing the "how to plot" information.

Autodesk.AutoCAD.DatabaseServices.PlotSettings.PlotSettingsName
Accesses the current name of your plot settings.