Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters
This .NET class wraps the AcGiToneOperatorParameters ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.op_Equality(Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters,Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters,Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.ExteriorDaylight
Accesses the exterior daylight mode for the tone operator.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.WhiteColor
Accesses the WhiteColor property value.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.MidTones
Accesses the midtones for the tone operator.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.Contrast
Accesses the contrast for the tone operator.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.Brightness
Accesses the brightness for the tone operator.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.ProcessBackground
Returns ProcessBackground property value.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.ColorDifferentiation
Returns ColorDifferentiation property value.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.ChromaticAdaptation
Returns ChromaticAdaptation property value.

Autodesk.AutoCAD.GraphicsInterface.ToneOperatorParameters.IsActive
Returns true if the tone operator is active.