Autodesk.AutoCAD.Colors.EntityColor
This .NET class wraps the AcCmEntityColor ObjectARX class.

Autodesk.AutoCAD.Colors.EntityColor.#ctor(System.Byte,System.Byte,System.Byte)
Initializes the color using the supplied RGB values.
red:  Input red value from 0 to 255
green:  Input green value from 0 to 255
blue:  Input blue value from 0 to 255

Autodesk.AutoCAD.Colors.EntityColor.#ctor(Autodesk.AutoCAD.Colors.ColorMethod,System.Int32)
Initializes the color method and color index.
value:  Input color method
index:  Input color index

Autodesk.AutoCAD.Colors.EntityColor.#ctor(Autodesk.AutoCAD.Colors.ColorMethod)
Initializes the color value to 0 and sets the color method to value.
value:  Input color method

Autodesk.AutoCAD.Colors.EntityColor.#ctor(System.Int32)
Constructs the object through an integer color index.
trueColor:  Input.

Autodesk.AutoCAD.Colors.EntityColor.LookUpRgb(System.Byte)
Looks up the RGB value.
colorIndex:  Input color value and color method

Autodesk.AutoCAD.Colors.EntityColor.LookUpAci(System.Byte,System.Byte,System.Byte)
This method maps the RGB values given to an ACI value, and returns the closest match.
red:  Input red value from 0 to 255
green:  Input green value from 0 to 255
blue:  Input blue value from 0 to 255

Autodesk.AutoCAD.Colors.EntityColor.IsLayerFrozenOrOff
For internal use only.

Autodesk.AutoCAD.Colors.EntityColor.IsNone
Assesses if there is no color.

Autodesk.AutoCAD.Colors.EntityColor.IsLayerFrozen
Assesses if the layer is frozen.

Autodesk.AutoCAD.Colors.EntityColor.IsLayerOff
Assesses if the layer is off.

Autodesk.AutoCAD.Colors.EntityColor.IsForeground
Assesses if the color is from the foreground.

Autodesk.AutoCAD.Colors.EntityColor.IsByPen
Assesses if the color is by a pen.

Autodesk.AutoCAD.Colors.EntityColor.IsByAci
Assesses if the color is defined by ACI.

Autodesk.AutoCAD.Colors.EntityColor.IsByBlock
Assesses if the color is by a block.

Autodesk.AutoCAD.Colors.EntityColor.IsByLayer
Wrap the ObjectARX function Color.isByLayer().

Autodesk.AutoCAD.Colors.EntityColor.IsByColor
Assesses if the color is by another color.

Autodesk.AutoCAD.Colors.EntityColor.Blue
Accesses the color value's blue component.

Autodesk.AutoCAD.Colors.EntityColor.Green
Accesses the color value's green component.

Autodesk.AutoCAD.Colors.EntityColor.Red
Accesses the color value's red component.

Autodesk.AutoCAD.Colors.EntityColor.PenIndex
Assesses the pen index.

Autodesk.AutoCAD.Colors.EntityColor.LayerIndex
Assesses the layer index.

Autodesk.AutoCAD.Colors.EntityColor.ColorIndex
Accesses the AutoCAD color index (ACI) value.

Autodesk.AutoCAD.Colors.EntityColor.TrueColor
Accesses the color through an EntityColor object.

Autodesk.AutoCAD.Colors.EntityColor.ColorMethod
Accesses the color method.