Autodesk.AutoCAD.GraphicsInterface.ViewportDraw
This .NET class wraps the AcGiViewportDraw ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.IsValidId(System.IntPtr)
Returns true if the viewport specified by id still exists.
id:  Input viewport ID value

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.ViewportObjectId
Accesses the objectId of the Viewport being drawn to.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.SequenceNumber
Accesses the number of viewports deleted so far during the AutoCAD edit session for the current drawing.

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.Geometry
Accesses the user geometry (polylines, arcs, meshes, etc.).

Autodesk.AutoCAD.GraphicsInterface.ViewportDraw.Viewport
Accesses the Viewport object in use by the ViewportDraw object.