Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs
This class provides data for the XrefSubCommand event.

Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.paths
Returns the path of block table  records.

Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.btrNames
Returns the block table record  names.

Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.btrIds
Returns the block table record id collection.

Autodesk.AutoCAD.DatabaseServices.XrefSubCommandEventArgs.xrefOp
Returns the xrefOp property value.