Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings
Container for all properties relating to the rapid RT renderer.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.CopyFrom(Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings)
Copy all the render settings from an AcDbRapidRTRenderSettings object.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.FilterHeight
Returns the filter height.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.FilterWidth
Returns the filter width.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.FilterType
Returns the filter type.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.LightingModel
Returns the lighting model.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.RenderTime
Get the render time of the RapidRT render settings.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.RenderLevel
Returns the render level.

Autodesk.AutoCAD.DatabaseServices.RapidRTRenderSettings.RenderTarget
Return the render target.