Autodesk.AutoCAD.DatabaseServices.Constrained2PointsConstructionLine
This class represents a constrained unbounded construction line node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.Constrained2PointsConstructionLine.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Constructor.
point1:  Input first 3D point. Relative to the work plane of the owning Assoc2dConstraintGroup object.
point2:  Input second 3D point. Relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.Constrained2PointsConstructionLine.#ctor
Default constructor.