Autodesk.AutoCAD.DatabaseServices.SubentRef
This wraps the ObjectARX AcDbSubentRef class.

Autodesk.AutoCAD.DatabaseServices.SubentRef.CopyFrom(Autodesk.AutoCAD.DatabaseServices.SubentRef)
This wraps the ObjectARX AcDbSubentRef::operator =(const AcDbSubentRef&) method.

Autodesk.AutoCAD.DatabaseServices.SubentRef.CreateEntity
This wraps the ObjectARX AcDbSubentRef::createEntity() method.

Autodesk.AutoCAD.DatabaseServices.SubentRef.SubentId
This wraps the ObjectARX AcDbSubentRef::subentId() method.

Autodesk.AutoCAD.DatabaseServices.SubentRef.Entity
This wraps the ObjectARXAcDbSubentRef::entity() method.