Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::AcDbAssocRevolvedSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody.GetRevolveAngle(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::revolveAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody.SetRevolveAngle(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::setRevolveAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PathRef,Autodesk.AutoCAD.DatabaseServices.PathRef,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions,System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody.RevolveAngle
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::revolveAngle() and AcDbAssocRevolvedSurfaceActionBody::setRevolveAngle() methods.