Autodesk.AutoCAD.GraphicsInterface.WorldGeometry
This .NET class wraps the AcGiWorldGeometry ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.SetExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
Sets the extents of the current entity to extents.
extents:  Input an array of two points.

Autodesk.AutoCAD.GraphicsInterface.WorldGeometry.StartAttributesSegment
If this drawable is a block and has Attributes, it must call this method exactly once before sending the attributes to Draw().