Autodesk.AutoCAD.DatabaseServices.DwfDefinition
This .NET class wraps the AcDbDwfDefinition ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DwfDefinition.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.DwfDefinition.isDWFx
Assesses if this is a DWFx file.