Autodesk.AutoCAD.Geometry.Point3dCollection
This .NET class wraps the AcGePoint3dArray ObjectARX class.

Autodesk.AutoCAD.Geometry.Point3dCollection.#ctor(Autodesk.AutoCAD.Geometry.Point3d[])
Constructs a collection from an array.
values:  Input array

Autodesk.AutoCAD.Geometry.Point3dCollection.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.Point3dCollection.CopyTo(Autodesk.AutoCAD.Geometry.Point3d[],System.Int32)
Copies objects in array to this collection from theindex point.
array:  Input array to copy into
index:  Input index to begin copying

Autodesk.AutoCAD.Geometry.Point3dCollection.Add(Autodesk.AutoCAD.Geometry.Point3d)
Adds the object represented by value to this collection.
value:  Input object to add

Autodesk.AutoCAD.Geometry.Point3dCollection.Contains(Autodesk.AutoCAD.Geometry.Point3d)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input object to check for

Autodesk.AutoCAD.Geometry.Point3dCollection.IndexOf(Autodesk.AutoCAD.Geometry.Point3d)
Returns the 0-based index of the collection item that matches value.
value:  Input index of object

Autodesk.AutoCAD.Geometry.Point3dCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
Inserts value at position index in the collection.
index:  Input index to insert at
value:  Input object to insert

Autodesk.AutoCAD.Geometry.Point3dCollection.Remove(Autodesk.AutoCAD.Geometry.Point3d)
Removes the object represented by value from this collection.
value:  Input object to remove

Autodesk.AutoCAD.Geometry.Point3dCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Input index of object to remove at

Autodesk.AutoCAD.Geometry.Point3dCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Geometry.Point3dCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.Geometry.Point3dCollection.Count
Returns the number of objects in this collection.