Autodesk.AutoCAD.Colors.ColorConverter
This class performs conversions between Autodesk.AutoCAD.Colors.Color objects and ACI, RGB, and AutoCAD Color Book names.

Autodesk.AutoCAD.Colors.ColorConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Returns true if sourceType can be converted to this type.
context:  Input an object for the context
sourceType:  Input object to change to

Autodesk.AutoCAD.Colors.ColorConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Returns the converted object.
context:  Input context to convert within
culture:  Input culture to convert within
value:  Input object to convert from

Autodesk.AutoCAD.Colors.ColorConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
This method converts value to type destinationType.
context:  Input context to convert within
culture:  Input culture to convert within
value:  Input object to convert from
destinationType:  Input System.Type to convert to