Autodesk.AutoCAD.DatabaseServices.IBLBackground
Image based lighting background.

Autodesk.AutoCAD.DatabaseServices.IBLBackground.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.IBLBackground.SecondaryBackground
Gets the background to display when DisplayImage is set to false.

Autodesk.AutoCAD.DatabaseServices.IBLBackground.DisplayImage
Gets whether to display the IBL image as the background.

Autodesk.AutoCAD.DatabaseServices.IBLBackground.Rotation
Gets the rotation value for the IBL image.

Autodesk.AutoCAD.DatabaseServices.IBLBackground.IBLImageName
Gets the image used for IBL.

Autodesk.AutoCAD.DatabaseServices.IBLBackground.Enable
Sets whether IBL is currently active.