Autodesk.AutoCAD.GraphicsInterface.ColorRGBA
This .NET class wraps the AcGiColorRGBA ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.#ctor(System.Double,System.Double,System.Double,System.Double)
Creates an RGB color with color components red, green, blue, and alpha-shading component alpha correspondingly.
red:  Input color red component
green:  Input color green component
blue:  Input color blue component
alpha:  Input alpha-shading component

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.#ctor(System.Double,System.Double,System.Double)
Creates an RGB color with color components red, green, and blue components correspondingly.
red:  Input color red component
green:  Input color green component
blue:  Input color blue component

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.Alpha
Accesses the alpha-shading value.

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.Blue
Accesses the blue value.

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.Green
Accesses the green value.

Autodesk.AutoCAD.GraphicsInterface.ColorRGBA.Red
Accesses the red value.