Autodesk.AutoCAD.DatabaseServices.Wipeout
This .NET class wraps the AcDbWipeout ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Wipeout.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Wipeout.SetFrom(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector3d)
Sets a new wipeout from existing coordinates.
points:  Data points for initialization
normal:  Normal vector for initialization

Autodesk.AutoCAD.DatabaseServices.Wipeout.HasFrame
Assesses if the wipeout has a frame.