Autodesk.AutoCAD.Geometry.NurbCurve2dData
This class contains data that defines a NurbCurve2d object.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.NurbCurve2dData.IsEqualTo(Autodesk.AutoCAD.Geometry.NurbCurve2dData)
Compares this object to a and returns true if they are equal.
a:  Input object to check with

Autodesk.AutoCAD.Geometry.NurbCurve2dData.op_Inequality(Autodesk.AutoCAD.Geometry.NurbCurve2dData,Autodesk.AutoCAD.Geometry.NurbCurve2dData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve2dData.op_Equality(Autodesk.AutoCAD.Geometry.NurbCurve2dData,Autodesk.AutoCAD.Geometry.NurbCurve2dData)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.NurbCurve2dData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.Weights
Returns the Weights property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.Knots
Returns the Knots property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.ControlPoints
Returns the ControlPoints property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.Periodic
Returns the Periodic property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.Rational
Returns the Rational property value.

Autodesk.AutoCAD.Geometry.NurbCurve2dData.Degree
Returns the Degree property value.