Autodesk.AutoCAD.Geometry.Vector2d
This .NET class wraps the AcGeVector2d ObjectARX class.

Autodesk.AutoCAD.Geometry.Vector2d.#ctor(System.Double[])
Creates a vector at the origin.
unnamed:  Input coordinate array

Autodesk.AutoCAD.Geometry.Vector2d.#ctor(System.Double,System.Double)
Constructs a 2D vector with coordinates x and y correspondingly.

Autodesk.AutoCAD.Geometry.Vector2d.TransformBy(Autodesk.AutoCAD.Geometry.Matrix2d)
Transform this pre-multiplying it the matrix leftSide.
leftSide:  Input 2D matrix

Autodesk.AutoCAD.Geometry.Vector2d.RotateBy(System.Double)
Returns 2D vector which is the result of rotation of this vector.
angle:  Input rotation angle

Autodesk.AutoCAD.Geometry.Vector2d.Mirror(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the 2D vector which is the result of mirroring of this vector with respect to 2D line line in the same plane.
line:  Input any 2D line

Autodesk.AutoCAD.Geometry.Vector2d.Add(Autodesk.AutoCAD.Geometry.Vector2d)
Adds this vector with v.
v:  Input vector to add

Autodesk.AutoCAD.Geometry.Vector2d.Subtract(Autodesk.AutoCAD.Geometry.Vector2d)
Subtracts object v from this vector.
v:  Input value to subtract by

Autodesk.AutoCAD.Geometry.Vector2d.DivideBy(System.Double)
Divides value by this vector.
value:  Input value to divide by

Autodesk.AutoCAD.Geometry.Vector2d.MultiplyBy(System.Double)
Overloads for the Vector2d.MultiplyBy method.
value:  Input value to multiply by

Autodesk.AutoCAD.Geometry.Vector2d.Negate
Negates this vector, namely sets it to be equal to the vector (-x, -y).

Autodesk.AutoCAD.Geometry.Vector2d.GetPerpendicularVector
Returns a vector orthogonal to this vector, namely the vector ( -y, x).

Autodesk.AutoCAD.Geometry.Vector2d.GetAngleTo(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the angle between this vector and the vector vector in the range [0, Pi].
vector:  Input vector to get angle to

Autodesk.AutoCAD.Geometry.Vector2d.GetNormal
This method calls Vector2d.GetNormal(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Vector2d.GetNormal(Autodesk.AutoCAD.Geometry.Tolerance)
Returns the unit vector codirectional to this vector.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsUnitLength
This method calls Vector2d.IsUnitLength(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Vector2d.IsUnitLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to its normalization.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsZeroLength
This method calls Vector2d.IsZeroLength(Tolerance tolerance) with tolerance set to Global.

Autodesk.AutoCAD.Geometry.Vector2d.IsZeroLength(Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if this vector is equal to zero vector.
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector2d)
This method calls Vector2d.IsParallelTo(Vector2d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.IsParallelTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is parallel to the vector vector.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector2d)
This method calls Vector2d.IsCodirectionalTo(Vector2d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.IsCodirectionalTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
This function checks if this vector is codirectional to the vectorv vec.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector2d)
This method calls Vector2d.IsPerpendicularTo(Vector2d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.IsPerpendicularTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is perpendicular to the vector vector.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector2d)
This method calls Vector2d.IsEqualTo(Vector2d vector, Tolerance tolerance) with tolerance set to Global.
vector:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.IsEqualTo(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Tolerance)
Checks if this vector is within the distance tolerance.equalVector() from the vector vector.
vector:  Input vector
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Vector2d.DotProduct(Autodesk.AutoCAD.Geometry.Vector2d)
Returns the dot product of this vector and the vector v.
v:  Input vector to perform the dot product with

Autodesk.AutoCAD.Geometry.Vector2d.Equals(System.Object)
Returns true if this object is equal to the argument object.
obj:  Input object to check against

Autodesk.AutoCAD.Geometry.Vector2d.op_Inequality(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Vector2d.op_Equality(Autodesk.AutoCAD.Geometry.Vector2d,Autodesk.AutoCAD.Geometry.Vector2d)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(Autodesk.AutoCAD.Geometry.Matrix2d,Autodesk.AutoCAD.Geometry.Vector2d)
Transformation Function
Returns the vector equal to the product of matrix a and vector b.
a:  Input matrix
b:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(System.Double,Autodesk.AutoCAD.Geometry.Vector2d)
Returns the vector equal to a multiplied by scale factor factor.
factor:  Input scale factor
a:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.op_Multiply(Autodesk.AutoCAD.Geometry.Vector2d,System.Double)
Returns the vector equal to vector a multiplied by scale factor factor.
a:  Input scale factor
factor:  Input vector

Autodesk.AutoCAD.Geometry.Vector2d.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Geometry.Vector2d.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
format:  Input format
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Vector2d.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Geometry.Vector2d.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Geometry.Vector2d.ToArray
Returns an array of type System.Double containing the X and Y coordinate values for this vector.

Autodesk.AutoCAD.Geometry.Vector2d.LengthSqrd
Returns the square of the Euclidian length of this vector.

Autodesk.AutoCAD.Geometry.Vector2d.Length
Returns the Euclidian length of this vector.

Autodesk.AutoCAD.Geometry.Vector2d.Angle
Returns the angle between this vector and X axis in the range [0, 2 * Pi].

Autodesk.AutoCAD.Geometry.Vector2d.Y
Returns the Y property value.

Autodesk.AutoCAD.Geometry.Vector2d.X
Returns the X property value.

Autodesk.AutoCAD.Geometry.Vector2d.YAxis
Returns the YAxis property value.

Autodesk.AutoCAD.Geometry.Vector2d.XAxis
Returns the XAxis property value.