Autodesk.AutoCAD.DatabaseServices.ProxyObject
This .NET class wraps the AcDbProxyObject ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.GetReferences
This function appends to the ids collection all reference objectIds in the data of the custom object contained in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.ResurrectMeNow(Autodesk.AutoCAD.DatabaseServices.ObjectId)
If id represents a proxy object, and the application that defines the class of the object within the proxy is currently loaded, then this function resurrects the proxy by replacing it with the object it contains.
id:  Input object ID of object to be resurrected

Autodesk.AutoCAD.DatabaseServices.ProxyObject.ApplicationDescription
Accesses the string that represents the application description of the class stored within the proxy object.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.OriginalDxfName
Accesses the DXF name of the custom object stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.OriginalClassName
Accesses the class name of the custom object stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyObject.ProxyFlags
Accesses the proxy edit flags bit settings for the class of the custom object contained in the proxy.