Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo
This class encapsulates the data returned in the output parameters of the Table.hitTest() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture format

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.Type
Returns the type of table hit test performed.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.Column
Returns column index of the selected cell.

Autodesk.AutoCAD.DatabaseServices.TableHitTestInfo.Row
Returns column index of the selected cell.