Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody
Abstract base class for deriving custom dependency body classes that implement functionality of custom dependencies.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.SetStatus(Autodesk.AutoCAD.DatabaseServices.AssocStatus,System.Boolean)
Just a shortcut, calls the method on the parent AssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.currentEvaluationCallback
Just a shortcut, calls the method on the parent AcDbAssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.DwgInFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.DwgOutFields(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.DxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data from.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.DxfOutFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler)
The standard filing protocol.
filer:  The filer to read the object data to.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.EvaluateOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.UpdateDependentOnObjectOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsDependentOnTheSameThingAsOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsEqualToOverride(Autodesk.AutoCAD.DatabaseServices.AssocDependency)
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ErasedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
Called from the corresponding persistent reactor callback method of the parent AssocDependency class that owns this dependency body object. It does not need to be overridden.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ModifiedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the modified() persistent reactor callback method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ClonedOverride(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.DBObject)
Called from the copied() persistent reactor callback method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsRelevantChangeOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.HasCachedValueOverride
Called from the corresponding method of the parent AssocDependency class that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsActionEvaluationInProgress
Just a shortcut, calls the method on the parent AssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.IsAttachedToObject
Just a shortcut, calls the method on the parent AssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.DependentOnObject
Just a shortcut, calls the method on the parent AssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.OwningAction
Just a shortcut, calls the method on the parent AssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.Status
Just a shortcut, calls the method on the parent AssocDependency that owns this dependency body object.

Autodesk.AutoCAD.DatabaseServices.AssocDependencyBody.ParentDependency
Returns ObjectId of the parent AssocDependency that owns this dependency body object.