Autodesk.AutoCAD.DatabaseServices.AssocEdgeActionParam
This wraps the ObjectARX AcDbAssocEdgeActionParam class.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeActionParam.#ctor
This wraps the ObjectARX AcDbAssocEdgeActionParam::AcDbAssocEdgeActionParam() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeActionParam.GetEdgeRef
This wraps the ObjectARX AcDbAssocEdgeActionParam::getEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeActionParam.SetEdgeRef(Autodesk.AutoCAD.DatabaseServices.EdgeRef,System.Boolean,System.Boolean)
This wraps the ObjectARX AcDbAssocEdgeActionParam::setEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeActionParam.SetEdgeRef(Autodesk.AutoCAD.DatabaseServices.EdgeRef)
This wraps the ObjectARX AcDbAssocEdgeActionParam::setEdgeRef() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeActionParam.DependentOnCompoundObject
This wraps the ObjectARXAcDbAssocEdgeActionParam::getDependentOnCompoundObject() method.