Autodesk.AutoCAD.DatabaseServices.Ray
This .NET class wraps the AcDbRay ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Ray.#ctor
The default constructor.

Autodesk.AutoCAD.DatabaseServices.Ray.SecondPoint
Accesses the second alignment point.

Autodesk.AutoCAD.DatabaseServices.Ray.UnitDir
Accesses the unit direction vector of the ray.

Autodesk.AutoCAD.DatabaseServices.Ray.BasePoint
Accesses the base point of the ray.