Autodesk.AutoCAD.Runtime.Interop
This class provides interoperability capabilities for managed classes.

Autodesk.AutoCAD.Runtime.Interop.Check(System.Int32)
Checks returnValue and throws an exception if it does not equal to the reference object.
returnValue:  Input System.Int32 object.

Autodesk.AutoCAD.Runtime.Interop.CheckAdsForCancel(System.Int32)
This method returns true if returnValue is RTNORM or RTNONE, or false if it is RTCAN.
returnValue:  Input System.Int32 object.

Autodesk.AutoCAD.Runtime.Interop.CheckAds(System.Int32)
This method throws an InvalidInput exception if returnValue is anything other than RTNORM.
returnValue:  Input System.Int32 object.

Autodesk.AutoCAD.Runtime.Interop.CheckBool(System.Boolean)
This method throws System.InvalidOperationException if returnValue is false.
returnValue:  Input System.Boolean object.

Autodesk.AutoCAD.Runtime.Interop.CheckBoolean(System.Int32)
This method throws System.InvalidOperationException if returnValue evaluates to false.
returnValue:  Input System.Int32 object.

Autodesk.AutoCAD.Runtime.Interop.CheckNull(System.IntPtr)
If returnValue is null (or System.IntPtr.Zero), this method throws System.NullReferenceException.

Autodesk.AutoCAD.Runtime.Interop.ThrowExceptionForErrorStatus(System.Int32)
This method throws a new Autodesk.AutoCAD.Runtime.Exception> exception.
errorStatus:  Input System.Int32 object.

Autodesk.AutoCAD.Runtime.Interop.SetAutoDelete(Autodesk.AutoCAD.Runtime.DisposableWrapper,System.Boolean)
Sets a Boolean indicating whether the given wrapper object owns the underlying unmanaged resource. When the wrapper owns the resource the Dispose method will delete the resource.
obj:  Input Autodesk.AutoCAD.Runtime.DisposableWrapper object. The wrapper.
value:  Input System.Boolean object. Boolean that is true if the wrapper is to own the object; otherwise, false.

Autodesk.AutoCAD.Runtime.Interop.AttachUnmanagedObject(Autodesk.AutoCAD.Runtime.DisposableWrapper,System.IntPtr,System.Boolean)
Attaches the wrapper to an unmanaged resource. The wrapper must be compatible with the unmanaged resource.
obj:  Input Autodesk.AutoCAD.Runtime.DisposableWrapper object. The wrapper.
unmanagedPointer:  Input System.IntPtr object. The unmanaged resource.
autoDelete:  Input System.Boolean object. Boolean indicating whether the given wrapper object owns the underlying unmanaged resource. When the wrapper owns the resource the Dispose method will delete the resource.

Autodesk.AutoCAD.Runtime.Interop.DetachUnmanagedObject(Autodesk.AutoCAD.Runtime.DisposableWrapper)
Detaches the wrapper from the underlying unmanaged resource.
obj:  Input Autodesk.AutoCAD.Runtime.DisposableWrapper object. The wrapper.