Autodesk.AutoCAD.DatabaseServices.NurbsData
Replaces any existing spline data with the data passed in via NurbsData parameters.

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetControlPoints
Returns a collection of the Spline object's control points.

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetKnots
Returns a collection of the Spline object's knot values.

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetWeights
Returns a collection of the Spline object's control point weights.

Autodesk.AutoCAD.DatabaseServices.NurbsData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.NurbsData)
Compares this object to other and returns true if they are equal.
other:  Object to check against.

Autodesk.AutoCAD.DatabaseServices.NurbsData.IsEqualTo(Autodesk.AutoCAD.DatabaseServices.NurbsData,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests other against this object for equivalency within the tolerance range specified by tolerance.
other:  Object to check against.
tolerance:  Tolerance range

Autodesk.AutoCAD.DatabaseServices.NurbsData.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Object to check against.

Autodesk.AutoCAD.DatabaseServices.NurbsData.op_Inequality(Autodesk.AutoCAD.DatabaseServices.NurbsData,Autodesk.AutoCAD.DatabaseServices.NurbsData)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.NurbsData.op_Equality(Autodesk.AutoCAD.DatabaseServices.NurbsData,Autodesk.AutoCAD.DatabaseServices.NurbsData)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.DatabaseServices.NurbsData.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.NurbsData.KnotTolerance
Accesses the knot value tolerance of spline.

Autodesk.AutoCAD.DatabaseServices.NurbsData.ControlPointTolerance
Accesses the control points (in WCS coordinates) of the spline.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Periodic
Assesses if the spline is periodic.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Closed
Assesses if the spline is closed.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Rational
Assesses if the spline is rational.

Autodesk.AutoCAD.DatabaseServices.NurbsData.Degree
Accesses the degree of spline.