Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter
This .NET class wraps the AcDbLayerFilter ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Add(System.String)
Adds the input layer to the set of layers within the filter object that define those entities that pass the filter test.
layer:  Input layer name to add

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Remove(System.String)
Removes the input layer from the filter.
layer:  Input layer name to remove

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.GetAt(System.Int32,System.String)
Finds the layer whose index is index and sets name to point to that layer's name.
index:  Input index of layer to get
name:  Input name of layer at index index

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.LayerCount
Assesses the number of layers in the filter.

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.IsValid
Assesses whether all the layers exist in the layer table of the database the object is associated with.