Autodesk.AutoCAD.GraphicsInterface.ClipBoundary
This .NET class wraps the AcGiClipBoundary ObjectARX struct.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.#ctor
Default constructor.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.GetAptPoints
Returns the m_aptPoints member of the underlying ClipBoundary struct.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.SetAptPoints(Autodesk.AutoCAD.Geometry.Point2dCollection)
Sets the m_aptPoints member of the underlying ClipBoundary struct.
point:  Input point

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.DrawBoundary
If true, then the clipping boundary will be drawn to the display.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.BackClipZ
Accesses the Z depth for the back clipping plane, if active.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.FrontClipZ
Specifies the Z depth for the front clipping plane, if active.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.ClippingBack
If true, then a front clipping plane is active and BackClipZ should contain a valid Z depth.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.ClippingFront
If true, then a front clipping plane is active and FrontClipZ should contain a valid Z depth.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.TransformInverseBlockRefXForm
This is the inverse of the transform that the compound object uses to transform its contents.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.TransformToClipSpace
Sets the TransformToClipSpace property to value.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.Point
This is the origin of the clip space expressed in the compound object's coordinate system.

Autodesk.AutoCAD.GraphicsInterface.ClipBoundary.NormalVector
This is Z-Axis of the clip space expressed in the compound object's coordinate system.