Autodesk.AutoCAD.DatabaseServices.RadialDimension
This .NET class wraps the AcDbRadialDimension ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.ChordPoint
Accesses the point (in WCS coordinates) where the dimension line intersects the curve being dimensioned.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.Center
Accesses the center point (in WCS coordinates) of the curve being dimensioned.

Autodesk.AutoCAD.DatabaseServices.RadialDimension.LeaderLength
Accesses the leader length.