Autodesk.AutoCAD.Geometry.CompositeCurve2d
This .NET class wraps the AcGeCompositeCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d[])
Constructs a composite curve from the list of input curves.
curveList:  Input list of curves forming a composite curve

Autodesk.AutoCAD.Geometry.CompositeCurve2d.GetCurves
Returns the list of pointers to the component curves that make up the composite.

Autodesk.AutoCAD.Geometry.CompositeCurve2d.SetCurves(Autodesk.AutoCAD.Geometry.Curve2d[])
Resets the list of curves that make up the composite.
curves:  Input Autodesk.AutoCAD.Geometry.Curve2d[] object; array of curves in the composite curve

Autodesk.AutoCAD.Geometry.CompositeCurve2d.GlobalToLocalParameter(System.Double)
Takes a parameter value of a point on the composite and returns the parameter value of that same point on the component curve on which it lies.
value:  Input global parameter value

Autodesk.AutoCAD.Geometry.CompositeCurve2d.LocalToGlobalParameter(Autodesk.AutoCAD.Geometry.CompositeParameter)
Takes a parameter value of a point on the component curve and returns the parameter value of that point on the composite curve.
value:  Input local parameter value