Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody
This wraps AcDbAssocPatchSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::AcDbAssocPatchSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.GetContinuity(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::continuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.SetContinuity(System.Int32,System.String,System.String)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.GetBulge(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::bulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.SetBulge(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.SetConstraintPoints(Autodesk.AutoCAD.DatabaseServices.VertexRef[])
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setConstraintPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.SetConstraintCurves(Autodesk.AutoCAD.DatabaseServices.EdgeRef[])
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setConstraintCurves() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.EdgeRef[],Autodesk.AutoCAD.DatabaseServices.EdgeRef[],Autodesk.AutoCAD.DatabaseServices.VertexRef[],System.Boolean)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.EdgeRef[],Autodesk.AutoCAD.DatabaseServices.EdgeRef[],Autodesk.AutoCAD.DatabaseServices.VertexRef[],System.Int32,System.Double,System.Boolean)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.ContinuityGripPoint
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::getContinuityGripPoint() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.Bulge
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::bulge() and AcDbAssocPatchSurfaceActionBody::setBulge() methods.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.Continuity
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::continuity() and AcDbAssocPatchSurfaceActionBody::setContinuity ()methods.