Autodesk.AutoCAD.DatabaseServices.RenderGlobal
This .NET class wraps the AcDbRenderGlobal ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.HighInfoLevel
Assesses whether settings/statistics are shown in higher level of detail in the user interface.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.PredefinedPresetsFirst
Assesses whether predefined (factory) presets appear before the user-defined presets in the user interface.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.Dimensions
Accesses the dimensions of the rendered image.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.SaveFileName
Accesses the full path and file name of the value returned by SaveEnabled.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.SaveEnabled
Assesses whether to save an image to disk after rendering.

Autodesk.AutoCAD.DatabaseServices.RenderGlobal.ProcedureAndDestination
Accesses the type of view content to render (the procedure) and the desired output target for rendering.