Autodesk.AutoCAD.DatabaseServices.FieldEvaluationResult
This is class Autodesk.AutoCAD.DatabaseServices.FieldEvaluationResult.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationResult.Evaluated
This is Evaluated, a member of class FieldEvaluationResult.

Autodesk.AutoCAD.DatabaseServices.FieldEvaluationResult.Found
This is Found, a member of class FieldEvaluationResult.