Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits
This .NET class wraps the AcGiImageBackgroundTraits ObjectARX class.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.YScale
Returns the scale of the Y axis.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.XScale
Returns the scale of the X axis.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.YOffset
Returns the Y axis offset value.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.XOffset
Returns the X axis offset value.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.UseTiling
Returns the value of the image tiling property.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.MaintainAspectRatio
Returns true if the image files aspect ratio will be maintained when the background is drawn.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.FitToScreen
Returns the FitToScreen property--a value indicating if the image background needs to be fit to the screen or not.

Autodesk.AutoCAD.GraphicsInterface.ImageBackgroundTraits.ImageFilename
Returns the full path to the image file name associated with this background.