Autodesk.AutoCAD.DatabaseServices.ConstrainedRigidSet
This class represents a constrained rigid set node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedRigidSet.#ctor(System.Boolean,Autodesk.AutoCAD.Geometry.Matrix3d)
Constructor.
bScalable:  Input boolean indicating whether this rigid set can be uniformly scaled or not.
trans:  Input Matrix3d indicating the initial transform of this rigid set Relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedRigidSet.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedRigidSet.GetConstrainedGeomAt(System.Int32)
Returns the reference to the constrained geometry.
index:  Input the index.

Autodesk.AutoCAD.DatabaseServices.ConstrainedRigidSet.Transform
Gets the transform of this rigid set, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedRigidSet.NumOfConstrainedGeoms
Gets the number of contained constrained geometries.