Autodesk.AutoCAD.DatabaseServices.HyperLink
This .NET class wraps the AcDbHyperlink ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.HyperLink.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.HyperLink.Equals(System.Object)
Returns true if this object is identical to the argument object.
other:  Object to compare

Autodesk.AutoCAD.DatabaseServices.HyperLink.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.DatabaseServices.HyperLink.NestedLevel
Accesses the nesting level of the associated entity.

Autodesk.AutoCAD.DatabaseServices.HyperLink.IsOutermostContainer
Accesses the hyperlink is associated with the outermost container, and false otherwise.

Autodesk.AutoCAD.DatabaseServices.HyperLink.DisplayString
Accesses the hyperlink display string.

Autodesk.AutoCAD.DatabaseServices.HyperLink.SubLocation
Accesses the hyperlink sublocation.

Autodesk.AutoCAD.DatabaseServices.HyperLink.Description
Accesses the hyperlink description (or friendly name).

Autodesk.AutoCAD.DatabaseServices.HyperLink.Name
Accesses the hyperlink name.