Autodesk.AutoCAD.DatabaseServices.SectionSymbol
The SectionSymbol class represents the section view symbol entity used by model documentation views in association with a Viewport entity.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.#ctor
Constructor for the SectionSymbol class.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetSectionPointAt(System.Int32)
Gets the section point at the specified index (zero-based).
index:  Input: zero-based index into the section symbol point collection.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetBulgeAt(System.Int32)
Gets the section point bulge factor at the specified index (zero-based).
index:  Input: zero-based index into the section symbol point bulge collection.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetSectionPoints
Gets a collection of all the section points.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.AddSectionPoint(Autodesk.AutoCAD.Geometry.Point3d,System.Double)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.RemoveSectionPointAt(System.Int32)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetSectionPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d,System.Double)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetLabelNameAt(System.Int32)
Gets the label at the point identified by the specified index.
index:  Input: zero-based index into the section symbol point collection.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetLabelNameAt(System.Int32,System.String)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetLabelOffsetAt(System.Int32)
Gets the offset vector for the section symbol point at the specified index.
index:  Input: zero-based index into the section symbol point collection.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetLabelOffsetAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector3d)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.GetLabelOffsets
Gets all of the label offset vectors for the section symbol.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SetLabelOffsets(Autodesk.AutoCAD.Geometry.Vector3dCollection)
This .NET method wraps the ObjectARX method.For internal use only.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SectionPointsCount
The number of points in the section symbol.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.IsHalfSection
A flag indicating whether the section symbol annotates is associated to a half section view.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.IsViewDirectionLeft
A flag indicating whether the view direction is to the left.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.Identifier
The identifier of the section symbol.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.Scale
The scale of the section symbol entity.

Autodesk.AutoCAD.DatabaseServices.SectionSymbol.SymbolStyleId
The object ID of the SectionViewStyle object associated with this entity.