Autodesk.AutoCAD.DatabaseServices.FaceRef
This wraps the ObjectARX AcDbFaceRef class.

Autodesk.AutoCAD.DatabaseServices.FaceRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARXAcDbFaceRef::AcDbFaceRef(const AcDbCompoundObjectId&, const AcDbSubentId&, const AcGeCurve3d*) method.

Autodesk.AutoCAD.DatabaseServices.FaceRef.#ctor(Autodesk.AutoCAD.DatabaseServices.CompoundObjectId)
This wraps the ObjectARXAcDbFaceRef::AcDbFaceRef(const AcDbCompoundObjectId&, const AcDbSubentId&, const AcGeCurve3d*) method.

Autodesk.AutoCAD.DatabaseServices.FaceRef.#ctor
This wraps the ObjectARX AcDbFaceRef::AcDbFaceRef() method.