Autodesk.AutoCAD.Geometry.CurveBoundary
This .NET class wraps the AcGeCurveBoundary ObjectARX class.

Autodesk.AutoCAD.Geometry.CurveBoundary.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.CurveBoundary.Clone
Returns a copy of this object.

Autodesk.AutoCAD.Geometry.CurveBoundary.Set(System.Int32,Autodesk.AutoCAD.Geometry.Entity3d[],Autodesk.AutoCAD.Geometry.Curve2d[],System.Boolean,System.Boolean)
Resets the definition of an instance of this class. If the current instance is not empty, and it owns its definition data, then prior to resetting the definition data, it would delete the existing definition.
If any entry in the curve3ds array is NULL, then the corresponding entry in orientation3d is not applicable.
If any entry in the curve2ds array is NULL, then the corresponding entry in orientation2d is not applicable.
numElements:  Input number of elements in curve boundary
curve3ds:  Input array of 3D space geometry of each element of curve boundary
curve2ds:  Input array of parameter space geometry of each element of curve boundary
orientation3d:  Input logical orientation applicable to each element of 3dGeometry
orientation2d:  Input logical orientation applied to each element of paramGeometry

Autodesk.AutoCAD.Geometry.CurveBoundary.SetToOwnCurves
Forces this instance to own its definition data.

Autodesk.AutoCAD.Geometry.CurveBoundary.IsOwnerOfCurves
Returns true if the curve boundary representation data is owned by this instance, else false.

Autodesk.AutoCAD.Geometry.CurveBoundary.Contour
This property yields the representation information concerning the curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.NumElements
Returns the number of elements of the curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.DegenerateCurve
Determines whether the curve boundary is degenerate to a single 3D space point.

Autodesk.AutoCAD.Geometry.CurveBoundary.DegeneratePosition
Returns 3D space point for a degenerate curve boundary.

Autodesk.AutoCAD.Geometry.CurveBoundary.IsDegenerate
Returns true if the curve boundary consists of a single element and it is degenerate to a single 3D space point.