Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord
This .NET class wraps the AcDbLinetypeTableRecord ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.DashLengthAt(System.Int32)
This function returns the length (in AutoCAD drawing units--the dash will appear this length when the linetype scale is 1.0) of the index'th dash in the LinetypeTableRecord.
index:  Input index (0-based) of dash to get length of

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetDashLengthAt(System.Int32,System.Double)
This function sets value to be the length (in AutoCAD drawing units--the dash will appear this length when the linetype scale is 1.0) of the index'th dash in the LinetypeTableRecord.
index:  Input index (0-based) of dash to set
value:  Input length value for the dash

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeStyleAt(System.Int32)
This function returns the ObjectId of the TextStyleTableRecord of the shape (or textStyle if it's a text string instead of a shape) at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeStyleAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the LinetypeTableRecord to use value as the ObjectId of the TextStyleTableRecord for the shape (or textStyle if it's a text string instead of a shape) at position index.
index:  Input index at which to set the shape (or text string) scale
id:  Input scale factor to be applied to the shape (or text string)

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeNumberAt(System.Int32)
This function returns the shape number of the shape at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeNumberAt(System.Int32,System.Int32)
This function sets the index'th dash to embed the shape identified by shapeNumber (the shape's shapeNumber from its shape file).
index:  Input index at which to set the shape
shapeNumber:  Input shape identification number of the shape to use

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeOffsetAt(System.Int32)
This function returns an Vector2d object whose X and Y coordinates represent the X and Y offsets of the shape (or text string) at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeOffsetAt(System.Int32,Autodesk.AutoCAD.Geometry.Vector2d)
This function sets the LinetypeTableRecord to use the X and Y coordinates of offset as the X and Y offsets for the shape (or text string) at position index.
index:  Input index at which to set the shape (or text string) offset
offset:  Input vector whose X and Y values are the WCS X and Y offsets for the shape

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeScaleAt(System.Int32)
This functions return the scale factor of the shape (or text string) at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeScaleAt(System.Int32,System.Double)
This function sets the LinetypeTableRecord to use scale as the scale of the shape at position index.
index:  Input index at which to set the shape (or text string) scale
scale:  Input scale factor to be applied to the shape

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeIsUcsOrientedAt(System.Int32)
This function returns true if the shape (or text string) at position index in the LinetypeTableRecord has the UcsOriented bit (bit 1) set in its shape flags otherwise it returns false.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeIsUcsOrientedAt(System.Int32,System.Boolean)
This function sets the UcsOriented bit (bit 1) for the shape (or text string) at position index in the LinetypeTableRecord. If IsUcsOriented is true, then the bit is set and the shape will orient itself relative to the current UCS when displayed. If IsUcsOriented is false, then the shape will orient itself relative to the line it's embedded within.
index must be greater than or equal to zero, but less than the value returned from NumDashes. index is a zero-based index (shapes and text strings have the same index as the dash that precedes them in the linetype definition) with the first dash in the linetype being index 0.
For more information on linetype definitions and embedded shapes, see the "Linetypes" section of the AutoCAD Customization Guide.
index:  Input index (0-based) of shape (or text string) to get
isOriented:  Input Boolean indicating whether or not the shape is to be oriented relative to the current UCS

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeIsUprightAt(System.Int32)
Gets the value of the UprightAt bit for the shape (or text string) set at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeIsUprightAt(System.Int32,System.Boolean)
Sets the UprightAt bit for the shape (or text string) at position index in the LinetypeTableRecord. If isUprightAt is True, then the bit is set and the shape will orient itself relative to the line it's embedded within. If isUprightAt is False, then the shape will orient itself relative to the current UCS if isUcsOriented is True. index must be greater than or equal to zero, but less than the value returned from NumDashes. index is a zero-based index (shapes and text strings have the same index as the dash that precedes them in the linetype definition) with the first dash in the linetype being index 0.
For more information on linetype definitions and embedded shapes, see the "Linetypes" section of the AutoCAD Customization Guide.
index:  Input index (0-based) of shape (or text string) to get
isUpright:  Input bool to control how the shape is to orient itself

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeRotationAt(System.Int32)
This function returns of the rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeRotationAt(System.Int32,System.Double)
This function sets the rotation angle (in radians) of the shape (or text string) at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get
rotation:  Input rotation angle for the shape (or text string)

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.TextAt(System.Int32)
This function returns with text pointing to the text string at position index in the LinetypeTableRecord.
index:  Input index (0-based) of shape (or text string) to get

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetTextAt(System.Int32,System.String)
This function sets the LinetypeTableRecord to use a copy of the string pointed to by text as the text string at position index.
index:  Input index at which to set the text string
value:  Input pointer to the text to use at index

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.IsScaledToFit
Accesses the alignment type for the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.NumDashes
Accesses the number of dashes in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.PatternLength
Accesses the length (in AutoCAD drawing units--the pattern will appear this length when the linetype scale is 1.0) of the pattern in the LinetypeTableRecord.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.AsciiDescription
This function is obsolete and will be eliminated in a future release of ObjectARX.

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.Comments
Accesses the string used by the LinetypeTableRecord to describe the linetype in the same simple ASCII form as you would find in the linetype definition file (in a description field).