Autodesk.AutoCAD.Runtime.ExtensionApplicationAttribute
This class defines a custom attribute that marks an assembly as an ObjectDBX/AutoCAD extension.

Autodesk.AutoCAD.Runtime.ExtensionApplicationAttribute.Type
Returns the Type property value.