Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection
This class provides a collection for UnderlayItem objects.

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.UnderlayItem[],System.Int32)
Copies the underlay items to the collection from the specified index.
array:  Input array to copy to
index:  Input index to begin copying from

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.DatabaseServices.UnderlayItemCollection.Count
Returns the number of items in the collection.