Autodesk.AutoCAD.DatabaseServices.XrefGraph
This .NET class wraps the AcDbXrefGraph ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(System.Int32)
Searches for the node that corresponds to its passed in parameter, and returns NULL if no nodes match the parameter.
idx:  Input System.Int32 object; Index into the graph

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(Autodesk.AutoCAD.DatabaseServices.Database)
Returns a pointer to the host drawing's database.
db:  Input Autodesk.AutoCAD.DatabaseServices.Database object; node database to search for

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns a pointer to the Terminator Block, if there is one.
btrId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object; Block table record ID to search for

Autodesk.AutoCAD.DatabaseServices.XrefGraph.GetXrefNode(System.String)
Searches for the node that corresponds to its passed in parameter, and returns NULL if no nodes match the parameter.
name:  Input System.String object; Node name to search for

Autodesk.AutoCAD.DatabaseServices.XrefGraph.MarkUnresolvedTrees
This method marks all unresolved xrefs and their nested xrefs with the GraphNode.UnresTree flag.

Autodesk.AutoCAD.DatabaseServices.XrefGraph.HostDrawing
Returns the node associated with the host drawing.