Autodesk.AutoCAD.DatabaseServices.UnderlayItem
This .NET class wraps the AcDbUnderlayItem ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.UsingPartialContent
Returns whether or not the item is using only some of the content of the sheet/model represented by the item.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Thumbnail
Returns the preview bitmap for the item.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Units
Returns the units used by the item.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Extents
Returns the item's extents in item-model coordinates.

Autodesk.AutoCAD.DatabaseServices.UnderlayItem.Name
Returns the name for the item.