Autodesk.AutoCAD.DatabaseServices.Viewport
This .NET class wraps the AcDbViewport ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.Viewport.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.Viewport.ThawAllLayersInViewport
Thaws, in this viewport only, all the layers currently frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetFrozenLayers
Returns a collection of the objectIds of all LayerTableRecords currently frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.IsLayerFrozenInViewport(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Returns true if the LayerTableRecord with objectId layerId is frozen in the viewport.
layerId:  Input id of the LayerTableRecord in question

Autodesk.AutoCAD.DatabaseServices.Viewport.UpdateDisplay
Updates the onscreen display to reflect any changes made to the viewport's view parameters.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetUcs(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
Returns the origin, x-axis, and y-axis of the ucs for this viewport.
origin:  Input origin
: Input x-axis
y:  Input y-axis

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the UCS for this viewport.
userCoordinateSystemId:  Input reference to a valid UcsTableRecord object

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the UCS for this viewport to the orthographic UCS defined by view (relative to UCSBASE).
view:  Input orthographic UCS

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
Sets the UCS for this viewport as defined by origin, x, and y.
origin:  Input origin
: Input X axis
y:  Input Y axis

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcsToWorld
Sets the ucs for this viewport to the world ucs.

Autodesk.AutoCAD.DatabaseServices.Viewport.SetViewDirection(Autodesk.AutoCAD.DatabaseServices.OrthographicView)
Sets the view direction of this viewport to the specified orthographic view (relative to UCSBASE).
view:  Input orthographic view

Autodesk.AutoCAD.DatabaseServices.Viewport.SetShadePlot(Autodesk.AutoCAD.DatabaseServices.ShadePlotType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the shade plot mode and shade plot object associated with this viewport.
type:  Input type of shade plot
shadePlotId:  Input object id for VisualStyle or RenderSettings object to be used as the new shade plot object

Autodesk.AutoCAD.DatabaseServices.Viewport.GetPreviousBackground(Autodesk.AutoCAD.GraphicsInterface.DrawableType)
Returns the viewport's previously set background of the specified type.
type:  Input type of the preferred previous background object

Autodesk.AutoCAD.DatabaseServices.Viewport.SetPreviousBackground(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.GraphicsInterface.DrawableType)
Sets the the previous background for the viewport.
value:  Input object ID of the new background
type:  Input the drawable type

Autodesk.AutoCAD.DatabaseServices.Viewport.Thumbnail
Accesses the packed BITMAPINFO structure of the thumbnail, with the thumbnail data following it immediately in memory.

Autodesk.AutoCAD.DatabaseServices.Viewport.AnnotationScale
Accesses the AnnotationScale associated with the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ToneOperatorParameters
Accesses the tone parameters for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.LinkedToSheetView
Assesses if the viewport is linked to a sheet view.

Autodesk.AutoCAD.DatabaseServices.Viewport.PlotAsRaster
Assesses whether or not the viewport will plot as a raster based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.Viewport.PlotWireframe
Assesses whether or not the viewport will plot as a vector output based on the viewport's current shade plot settings.

Autodesk.AutoCAD.DatabaseServices.Viewport.ShadePlotId
Accesses the shade object associated with this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Background
Accesses the object ID for the background of the current viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ShadePlot
Accesses the shade plot mode of the current viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsPerViewport
Assesses the value of UCSVP for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewOrthographic
Accesses the orthographic view.

Autodesk.AutoCAD.DatabaseServices.Viewport.Ucs
Accesses the CoordinateSystem3d value that represents the UCS assigned to the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Elevation
Accesses the elevation of the ucs plane for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsName
Accesses the object id of an UcsTableRecord if this viewport's ucs is a named ucs, otherwise it returns a null id.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsOrthographic
Retrieves the orthographic UCS.

Autodesk.AutoCAD.DatabaseServices.Viewport.NonRectClipEntityId
Accesses the single clipping entity for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.NonRectClipOn
Assesses if non-rectangular clipping is currently turned on for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.EffectivePlotStyleSheet
Accesses the layout's plot style table name.

Autodesk.AutoCAD.DatabaseServices.Viewport.PlotStyleSheet
Accesses the style sheet applied to objects in this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.StandardScale
This function returns the scale of a viewport by using a standard scale defined by the StdScaleType enumeration.

Autodesk.AutoCAD.DatabaseServices.Viewport.CustomScale
Accesses the custom scale for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Transparent
Not implemented.

Autodesk.AutoCAD.DatabaseServices.Viewport.Locked
Assesses if a viewport's scale is locked.

Autodesk.AutoCAD.DatabaseServices.Viewport.VisualStyleId
Accesses the object ID of the visual style in effect for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SunId
Accesses the Sun object associated with this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.AmbientLightColor
Accesses the ambient light color for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Contrast
Accesses the contrast factor for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.Brightness
Accesses the brightness factor for this viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.DefaultLightingType
Accesses the type of default lighting being used in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.DefaultLightingOn
Assesses if any kind of default light is on.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridMajor
Accesses the number of minor grid lines between each major grid line in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridFollow
Assesses if the grid will follow a dynamic UCS change in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridSubdivisionRestricted
Assesses if subdivisions are allowed below the minor grid spacing in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridAdaptive
Assesses if the grid adapts to display fewer lines in the viewport than the GRIDUNIT setting.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridBoundToLimits
Assesses if the grid is drawn beyond limits for the WCS and user-defined UCS in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.HiddenLinesRemoved
Accesses the viewport is set to remove hidden lines during plotting, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridIncrement
Accesses the Vector2d in which the X value represents the X spacing (in drawing units) of the grid and the Y value represents the Y spacing of the grid.

Autodesk.AutoCAD.DatabaseServices.Viewport.GridOn
Assesses if the grid is currently turned on in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapIsoPair
Accesses the snap IsoPair setting for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapIncrement
Accesses the snap basepoint (in UCS coordinates) for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapBasePoint
Accesses the snap basepoint (in UCS coordinates) for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapAngle
Accesses the snap angle setting (in radians) for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapIsometric
Assesses if snap mode is currently set to isometric in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.SnapOn
Assesses if snap mode is currently turned on in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.CircleSides
Accesses the circle zoom percent for the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.FastZoomOn
This property always returns true and is obsolete and will be removed in a future release.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsIconAtOrigin
Assesses if the viewport is currently set to have the UCS icon follow the current UCS origin, as long as the origin is far enough within the viewport to allow the icon to display properly.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsIconVisible
Assesses if the viewport is currently set to have the UCS icon display, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.UcsFollowModeOn
Assesses if the viewport is set to generate and display a plan view whenever the UCS changes in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.PerspectiveOn
Assesses if the perspective mode is currently turned on in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.BackClipDistance
Accesses the distance (along the camera-target line) from the target to the back clipping plane.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipDistance
Accesses the distance (along the camera-target line) from the target to the front clipping plane.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipAtEyeOn
Assesses if the front clipping plane is currently located at the camera, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.BackClipOn
Assesses if the back clipping plane is currently turned on in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.FrontClipOn
Assesses the front clipping plane is currently turned on in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.LensLength
Accesses the lens length used when perspective mode is on in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.TwistAngle
Accesses the twist angle (in radians) of the view in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewCenter
Accesses the view center (in display coordinate system coordinates) of the view in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewHeight
Accesses the height (in display coordinate system coordinates) of the Model Space view within the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewDirection
Accesses the vector (in Model Space WCS coordinates) from the view's target to the view's camera.

Autodesk.AutoCAD.DatabaseServices.Viewport.ViewTarget
Accesses the location (in Model Space WCS coordinates) of the view's target.

Autodesk.AutoCAD.DatabaseServices.Viewport.On
Assesses if the grid is currently turned on in the viewport, otherwise false is returned.

Autodesk.AutoCAD.DatabaseServices.Viewport.Number
Accesses the viewport ID number.

Autodesk.AutoCAD.DatabaseServices.Viewport.CenterPoint
Accesses the center point of the viewport entity in WCS coordinates (within Paper Space).

Autodesk.AutoCAD.DatabaseServices.Viewport.Width
Accesses the width of the viewport entity's window in drawing units.

Autodesk.AutoCAD.DatabaseServices.Viewport.Height
Accesses the height of the viewport entity's window in drawing units.