Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition
This class encapsulates the data required to define a spatial filter.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean)
Constructor for the SpatialFilterDefinition object.
pts:  Input boundary definition. If the number of points is 2, they are diagonal points of a rectangle. Otherwise, they are vertices of a polygon. The polygon should be non self intersecting.
normal:  Input positive extrusion direction vector
elevation:  Input elevation; along with the normal, this will define an ECS in which the polygon points are defined
frontClip:  Input front clip distance in the positive extrusion direction
backClip:  Input back clip distance in the negative extrusion direction
enabled:  Input Boolean to make the clip volume effective, or alternatively, be all of 3D space

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.GetPoints
Returns the points that define the boundary.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.Enabled
Assesses if to make the clip volume effective, or alternatively, be all of 3D space.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.BackClip
Accesses the back clip distance in the negative extrusion direction.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.FrontClip
Accesses the front clip distance in the positive extrusion direction.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.Elevation
Accesses the elevation; along with the normal, this will define an ECS in which the polygon points are defined.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilterDefinition.Normal
Accesses the positive extrusion direction vector.