Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.#ctor
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::AcDbAssocNetworkSurfaceActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.GetContinuity(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.String&,System.String&)
This wraps the ObjectARXAcDbAssocNetworkSurfaceActionBody::getContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.GetContinuity(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType)
This wraps the ObjectARXAcDbAssocNetworkSurfaceActionBody::getContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.SetContinuity(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.Int32,System.String,System.String)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.SetContinuity(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.Int32)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.GetBulge(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.String&,System.String&)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::getBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.GetBulge(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::getBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.SetBulge(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.SetBulge(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.Double)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PathRef[],Autodesk.AutoCAD.DatabaseServices.PathRef[],System.Int32[],System.Double[],System.Boolean)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::createInstance() method.