Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent
This class gives the specular component of the material.

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.#ctor(Autodesk.AutoCAD.GraphicsInterface.MaterialColor,Autodesk.AutoCAD.GraphicsInterface.MaterialMap,System.Double)
This constructor initializes the material specular component.
color:  Input material color
map:  Input material map
gloss:  Input gloss value

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.op_Inequality(Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.op_Equality(Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent,Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Gloss
Returns the Gloss factor.

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Map
Returns the specular map.

Autodesk.AutoCAD.GraphicsInterface.MaterialSpecularComponent.Color
Returns the specular color.