Autodesk.AutoCAD.DatabaseServices.VisibilityOverrule
Wraps the ObjectARX AcDbVisibilityOverrule class.

Autodesk.AutoCAD.DatabaseServices.VisibilityOverrule.Visibility(Autodesk.AutoCAD.DatabaseServices.Entity)
Wraps the ObjectARX AcDbVisibilityOverrule::visibility() method.
entity:  An Autodesk.AutoCAD.DatabaseServices.Entity that this overrule is applied against.