Autodesk.AutoCAD.DatabaseServices.GripData
This .NET class wraps the ObjectARX class GripData class.

Autodesk.AutoCAD.DatabaseServices.GripData.OnRightClick(Autodesk.AutoCAD.DatabaseServices.GripDataCollection,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This is OnRightClick, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.GetTooltip
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.GripData.GetHoverDimensionData(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Double)
This is GetHoverDimensionData, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.GetHotGripDimensionData(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Double)
This is GetHotGripDimensionData, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.IsPerViewport
This is IsPerViewport, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.GizmosEnabled
This is GizmosEnabled, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.HotGripInvokesRightClick
This is HotGripInvokesRightClick, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.ForcedPickOn
This is ForcedPickOn, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.TriggerGrip
This is TriggerGrip, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.DrawAtDragImageGripPoint
This is DrawAtDragImageGripPoint, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.ModeKeywordsDisabled
This is ModeKeywordsDisabled, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.RubberBandLineDisabled
This is RubberBandLineDisabled, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.SkipWhenShared
This is SkipWhenShared, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.AlternateBasePoint
This is AlternateBasePoint, a member of class GripData.

Autodesk.AutoCAD.DatabaseServices.GripData.GripPoint
This is GripPoint, a member of class GripData.