Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord
This class encapsulates the three output parameters used by the Object.decomposeForSave() ObjectARX function.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.#ctor(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Boolean)
Constructor which sets the replacement as a DBObject, and whether Xdata should be exchanged.
replacement:  Input Autodesk.AutoCAD.DatabaseServices.DBObject object
exchangeXData:  Input System.Boolean object

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.ExchangeXData
Accessesthe exchange xdata property value.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementId
Accesses the replacement id property value.

Autodesk.AutoCAD.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementObject
Accesses the replacement object property value.