Autodesk.AutoCAD.Geometry.OffsetCurve3d
This .NET class wraps the AcGeOffsetCurve3d ObjectARX class.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.#ctor(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
Constructs an offset curve that is an exact offset of the specified base curve.
baseCurve:  Input base curve
planeNormal:  Input plane normal
offsetDistance:  Input offset distance

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Transformation
Returns transformation matrix that was applied to this curve by calling transformBy().

Autodesk.AutoCAD.Geometry.OffsetCurve3d.ParameterDirection
Returns 1 if this curve has the same parameter direction as the base curve, 0 if this curve has an opposite parameter direction as the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.OffsetDistance
Returns the signed distance that this curve is offset from the base curve.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Normal
Returns Normal property value.

Autodesk.AutoCAD.Geometry.OffsetCurve3d.Curve
Returns the base curve of which this curve is an offset.