Autodesk.AutoCAD.DatabaseServices.AssocManager
This wraps the ObjectARX AcDbAssocManager class.

Autodesk.AutoCAD.DatabaseServices.AssocManager.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.AssocManager.EvaluateTopLevelNetwork(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback,System.Int32)
Evaluates the top-level AssocNetwork of the given database, using the global evaluation callback.
callback:  Optional AssocEvaluationCallback that is added to the global callback before the evaluation and removed after the evaluation is completed.
callbackOrder:  Order of the optional AssocEvaluationCallback.
patabase:  Database whose top-level network is to be evaluated.

Autodesk.AutoCAD.DatabaseServices.AssocManager.GlobalEvaluationMultiCallback
Returns the global AssocEvaluationCallback that is used while dragging, when evaluating the top-level associative network on document lock mode change, or anytime AssocManager.EvaluateTopLevelNetwork() is explicitly called by the client code.

Autodesk.AutoCAD.DatabaseServices.AssocManager.AddGlobalEvaluationCallback(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback,System.Int32)
Adds the given user-provided AssocEvaluationCallback to the global AssocEvaluationMultiCallback.
order:  Specifies the ordering of the user-provided callbacks in the global AssocEvaluationMultiCallback. The lower-order callbacks are called before the higher-order callbacks. The drag callback is inserted with order 0, i.e. callbacks with negative order will be called before it and callbacks with positive order will be called after it.
pCallback:  The user-provided evaluation callback. The callback does not become owned by the global AssocEvaluationMultiCallback, it is just referenced by it.

Autodesk.AutoCAD.DatabaseServices.AssocManager.RemoveGlobalEvaluationCallback(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationCallback)
Removes the given user-provided evaluation callback from the global AssocEvaluationMultiCallback.
pCallback:  The user-provided evaluation callback to be removed.

Autodesk.AutoCAD.DatabaseServices.AssocManager.HasAssocNetwork(Autodesk.AutoCAD.DatabaseServices.Database)
Returns true if the given database has some associative data; in particular, if there is a global AssocNetwork for the whole database.

Autodesk.AutoCAD.DatabaseServices.AssocManager.AuditAssociativeData(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Audits the associative data in the database and tries to fix the errors that might have happened during round-trip, due to lazy-erase, etc.
database:  Database whose associative data is to be audited.
traverseWholeDatabase:  If true, all objects in the database are visited and checked, and therefore loaded into memory.

Autodesk.AutoCAD.DatabaseServices.AssocManager.Initialize
This is an internal method that initializes the Associative Framework subsystem.