Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody class.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody.#ctor
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::AcDbAssocEdgeFilletActionBody() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody.GetRadius(System.String&,System.String&)
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::radius() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody.SetRadius(System.Double,System.String,System.String)
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::setRadius() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody.CreateInstance(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],System.Double,System.Boolean)
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::createInstance() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody.Radius
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::radius() and AcDbAssocEdgeFilletActionBody::setRadius() methods.