Autodesk.AutoCAD.Runtime.DeferredAssemblyLoadEventArgs
This is class Autodesk.AutoCAD.Runtime.DeferredAssemblyLoadEventArgs.

Autodesk.AutoCAD.Runtime.DeferredAssemblyLoadEventArgs.MayHaveCommands
This is MayHaveCommands, a member of class DeferredAssemblyLoadEventArgs.

Autodesk.AutoCAD.Runtime.DeferredAssemblyLoadEventArgs.MayHaveExtensionApplication
This is MayHaveExtensionApplication, a member of class DeferredAssemblyLoadEventArgs.

Autodesk.AutoCAD.Runtime.DeferredAssemblyLoadEventArgs.LoadedAssembly
This is LoadedAssembly, a member of class DeferredAssemblyLoadEventArgs.