Autodesk.AutoCAD.DatabaseServices.DxfFiler
This .NET class wraps the AcDbDxfFiler ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.RewindFiler
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.FilerStatus
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ResetFilerStatus
The implementation of this function should follow that of the ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ReadResultBuffer
This method is the only actual "read" input function provided to read data.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteResultBuffer(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
The implementation of this function should follow that of the ObjectARX internal filers.
buffer:  Resbuf structure to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteObjectId(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.DatabaseServices.ObjectId)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input object ID value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteString(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.String)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input System.String value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBytes(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Byte[])
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  Input DXF group code to be written out
chunk:  Input byte array to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteHandle(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.DatabaseServices.Handle)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input Handle value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt64(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int64)
This .Net method wraps the ObjectARX method AcDbDxfFiler::writeInt64.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt32(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input System.Int32 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteInt16(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Int16)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input System.Int16 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt64(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt64)
This .NET method wraps ObjectARX method AcDbDxfFiler::writeUInt64.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt32(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input System.UInt32 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteUInt16(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.UInt16)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Input System.UInt16 value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteByte(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Byte)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  Input DXF group code to be written out
value:  Input byte value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBoolean(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should: Check the current filer status.Write out opCodeWrite out value.
A Boolean is an integer which is 32-bit on all supported platforms.
opCode:  DXF group code to be written out Boolean to be written out
value:  Input boolean value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteBool(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. It should do the following: Check the current filer status.Write out the opCode in the first parameter.Write out the value in the second parameter.
A bool is an integer which is 16-bit on all supported platforms.
opCode:  Input DXF group code to be written out
value:  Input boolean value to be written out

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteDouble(Autodesk.AutoCAD.DatabaseServices.DxfCode,System.Double,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Double to be written out
precision:  _nt_

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WritePoint2d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Point2d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  2D point to be written out
precision:  Decimal places to use when writing out the coordinate double values

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WritePoint3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Point3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  3D point to be written out
precision:  Decimal places to use when writing out the coordinate double values

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteVector2d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Vector2d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  2D vector to be written out
precision:  Decimal places to use when writing out the 2D vector

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteVector3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Vector3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  3D vector to be written out
precision:  Decimal places to use when writing out the 3D vector

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteScale3d(Autodesk.AutoCAD.DatabaseServices.DxfCode,Autodesk.AutoCAD.Geometry.Scale3d,System.Int32)
The implementation of this function should follow that of the ObjectARX internal filers.
opCode:  DXF group code to be written out
value:  Scale3d object to be written out
precision:  Decimal places to use when writing out the Scale3d object

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteXDataStart
If the filer is filing to AutoLISP or ADSRX, then this function writes out the DxfCode.XDataStart (value of -3) to indicate the start of xdata.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.PushBackItem
The implementation of this function should follow that of the ObjectARX internal filers:
Resets the filer to position to where it was before the last item was read.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtSubclassData(System.String)
The implementation of this function should follow that of the ObjectARX internal filers.
value:  subClassName that should be compared

Autodesk.AutoCAD.DatabaseServices.DxfFiler.HaltAtClassBoundaries(System.Boolean)
The implementation of this function should follow that of the ObjectARX internal filers. If value is false, then set the filer to read all input without resetting its ErrorStatus unless an I/O error occurs.
The default implementation of this method is to terminate AutoCAD. Warning
For the ObjectARX internal filer classes used for DXF and AutoLISP or C++ function I/O, this method terminates AutoCAD when it is called on a filer that is filing data out.
value:  Input Boolean indicating whether or not to halt at certain key markers in the file

Autodesk.AutoCAD.DatabaseServices.DxfFiler.WriteEmbeddedObjectStart
The implementation of this function should follow the implementation used by ObjectARX internal filers.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.IsModifyingExistingObject
Assesses if the DxfFiler is being used for an entmod operation.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Thickness
Accesses the thickness.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Elevation
Accesses the elevation of the object.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtEmbeddedObjectStart
True if the filer is currently pointing to an item with a DxfCode.EmbeddedObjectStart.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtEndOfObject
True if the end of the object has been reached.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtExtendedData
True if the filer is currently pointing to an item with an DxfCode.XDataStart or .RegAppName.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.AtEndOfFile
True if the filer is either at a subclass data marker in the object (that is, next item to read has an DxfCode.Subclass), or at the start of the object's xdata (that is, no more normal object data to read), or at the end of the object's data (that is, another object's data is next or the filer is at the end of the file being read).

Autodesk.AutoCAD.DatabaseServices.DxfFiler.IncludesDefaultValues
Assesses if the filer is being used for a purpose where default values (that is, color BYLAYER, normal = (0,0,1), etc.) are normally filed out.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Precision
Accesses the precision.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ExtendedMinorVersion
This is ExtendedMinorVersion, a member of class DxfFiler.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.DwgVersion
Accesses the drawing file version, such as Release 13 or Release 14.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.Database
Accesses the working database being read or written by this filer.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.FilerType
Accesses what the filer is, or should be, used for.

Autodesk.AutoCAD.DatabaseServices.DxfFiler.ErrorMessage
Accesses the error string message the filer is currently set to display if an error occurs.