Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer
This is class Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.TransformPoint(System.String,System.String,Autodesk.AutoCAD.Geometry.Point3d)
This is TransformPoint, a member of class GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.TransformPoint(Autodesk.AutoCAD.Geometry.Point3d)
This is TransformPoint, a member of class GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.TransformPoints(System.String,System.String,Autodesk.AutoCAD.Geometry.Point3dCollection)
This is TransformPoints, a member of class GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.TransformPoints(Autodesk.AutoCAD.Geometry.Point3dCollection)
This is TransformPoints, a member of class GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.Create(System.String,System.String)
This is Create, a member of class GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.TargetCSid
This is TargetCSid, a member of class GeoCoordinateTransformer.

Autodesk.AutoCAD.DatabaseServices.GeoCoordinateTransformer.SourceCSid
This is SourceCSid, a member of class GeoCoordinateTransformer.