Autodesk.AutoCAD.Geometry.NurbSurface
This .NET class wraps the AcGeNurbSurface ObjectARX class.

Autodesk.AutoCAD.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection)
Constructs a NURB surface defined by input data.
degreeU:  Input U degree
degreeV:  Input V degree
propsInU:  Input U properties (uses NurbSurfaceProperties values)
propertiesInV:  Input V properties (uses NurbSurfaceProperties values)
numberControlPointsInU:  Input number of control points in U direction
numberControlPointsInV:  Input number of control points in V direction
controlPoints:  Input collection of control points
weights:  Input collection of weights
knotsInU:  Input U collection of knots
knotsInV:  Input V collection of knots

Autodesk.AutoCAD.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Constructs a NURB surface defined by input data.
degreeU:  Input U degree
degreeV:  Input V degree
propsInU:  Input U properties (uses NurbSurfaceProperties values)
propertiesInV:  Input V properties (uses NurbSurfaceProperties values)
numberControlPointsInU:  Input number of control points in U direction
numberControlPointsInV:  Input number of control points in V direction
controlPoints:  Input array of control points
weights:  Input array of weights
knotsInU:  Input U array of knots
knotsInV:  Input V array of knots
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.NurbSurface.#ctor
Constructs an empty surface that can be used as a placeholder only.

Autodesk.AutoCAD.Geometry.NurbSurface.GetDefinition
Computes the surface definition data.

Autodesk.AutoCAD.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection)
This method calls NurbSurface.Set(Int32 degreeU, Int32 degreeV, Int32 propsInU, Int32 propsInV, Int32 numControlPointsInU, Int32 numControlPointsInV, Point3dCollection controlPoints, DoubleCollection weights, KnotCollection knotsInU, KnotCollection knotsInV, Tolerance tolerance) with tolerance set to Global.
degreeU:  Input U degree
degreeV:  Input V degree
propsInU:  Input U properties (uses NurbSurfaceProperties values)
propsInV:  Input V properties (uses NurbSurfaceProperties values)
numControlPointsInU:  Input number of control points in U direction
numControlPointsInV:  Input number of control points in V direction
controlPoints:  Input array of control points
weights:  Input array of weights
knotsInU:  Input U array of knots
knotsInV:  Input U array of knots

Autodesk.AutoCAD.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.KnotCollection,Autodesk.AutoCAD.Geometry.Tolerance)
Changes surface definition to one specified by input data.
degreeU:  Input U degree
degreeV:  Input V degree
propsInU:  Input U properties (uses NurbSurfaceProperties values)
propsInV:  Input V properties (uses NurbSurfaceProperties values)
numControlPointsInU:  Input number of control points in U directio
numControlPointsInV:  Input number of control points in V direction
controlPoints:  Input array of control points
weights:  Input array of weights
knotsInU:  Input U array of knots
knotsInV:  Input U array of knots
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.NurbSurface.VKnots
Computes array of the V knots.

Autodesk.AutoCAD.Geometry.NurbSurface.NumKnotsInV
Returns V dimension of knot array.

Autodesk.AutoCAD.Geometry.NurbSurface.UKnots
Computes array of the U knots.

Autodesk.AutoCAD.Geometry.NurbSurface.NumKnotsInU
Returns U dimension of knot array.

Autodesk.AutoCAD.Geometry.NurbSurface.PeriodicInV
Returns flag indicating if surface is a periodic surface in V direction.

Autodesk.AutoCAD.Geometry.NurbSurface.PeriodicInU
Returns flag indicating if surface is a periodic surface in U direction.

Autodesk.AutoCAD.Geometry.NurbSurface.IsPeriodicInV
Returns flag indicating if surface is a periodic surface in V direction.

Autodesk.AutoCAD.Geometry.NurbSurface.IsPeriodicInU
Returns flag indicating if surface is a periodic surface in U direction.

Autodesk.AutoCAD.Geometry.NurbSurface.Weights
Computes array of the weights.

Autodesk.AutoCAD.Geometry.NurbSurface.ControlPoints
Computes array of surface's control points.

Autodesk.AutoCAD.Geometry.NurbSurface.NumControlPointsInV
Returns V dimension of control array.

Autodesk.AutoCAD.Geometry.NurbSurface.DegreeInV
Return V degree of surface.

Autodesk.AutoCAD.Geometry.NurbSurface.NumControlPointsInU
Returns U dimension of control array.

Autodesk.AutoCAD.Geometry.NurbSurface.DegreeInU
Return U degree of surface.

Autodesk.AutoCAD.Geometry.NurbSurface.SingularityInV
Returns an integer which is one of the NurbSurfaceProperties values.

Autodesk.AutoCAD.Geometry.NurbSurface.SingularityInU
Returns an integer which is one of the .NurbSurfaceProperties values.

Autodesk.AutoCAD.Geometry.NurbSurface.IsRationalInV
Returns flag indicating if surface is a non-polynomial surface in V direction.

Autodesk.AutoCAD.Geometry.NurbSurface.IsRationalInU
Returns flag indicating if surface is a non-polynomial surface in U direction.