Autodesk.AutoCAD.DatabaseServices.ObjectContextManager
This .NET class wraps the AcDbObjectContextManager ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ObjectContextManager.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ObjectContextManager.RegisterContextCollection(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectContextCollection)
Registers a context collection with the context manager.
collectionName:  The name of the collection to register with the manager.
collection:  The collection to register with the manager.

Autodesk.AutoCAD.DatabaseServices.ObjectContextManager.UnregisterContextCollection(System.String)
Unregisters a context collection with the context manager.
collectionName:  The name of the collection to unregister with the manager.

Autodesk.AutoCAD.DatabaseServices.ObjectContextManager.GetContextCollection(System.String)
Returns the collection registered if one exists with the specified name.
collectionName:  The name of the desired collection.