Autodesk.AutoCAD.DatabaseServices.ProxyEntity
This .NET class wraps the AcDbProxyEntity ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.GetReferences
This function appends to the ids array all reference objectIds in the data of the custom entity contained in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.GraphicsMetafileType
Accesses the value indicating what kind of data is in the proxy's graphics metafile (if it has one).

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.ApplicationDescription
Accesses the string that represents the application description of the class stored within the proxy entity.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.OriginalDxfName
Accesses the string that is the DXF name of the custom entity stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.OriginalClassName
Accesses the string that is the C++ class name of the custom object stored in the proxy.

Autodesk.AutoCAD.DatabaseServices.ProxyEntity.ProxyFlags
Accesses the.