Autodesk.AutoCAD.DatabaseServices.LoftOptions
This .NET class wraps the AcDbLoftOptions ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.#ctor(Autodesk.AutoCAD.DatabaseServices.LoftOptions)
Copy constructor.
opts:  Input object to be copied into 'this'

Autodesk.AutoCAD.DatabaseServices.LoftOptions.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Clone
Returns a copy of this object.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckLoftCurves(Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity[],Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Checks whether cross section curves and guide/path curves are valid for the lofting operation. This function is called by CreateLoftedSurface() and CreateLoftedSolid(), so it is not necessary for an application to call this function. This function combines calls to CheckCrossSectionCurves(), CheckGuideCurves(), and CheckPathCurve() into a single function.
crossSectionCurves:  Input list of cross-section curves
guideCurves:  Input list of guide curves
pPathCurve:  Input pointer to path curve or null
displayErrorMessages:  Input Boolean whether or not to display error messages

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckCrossSectionCurves(Autodesk.AutoCAD.DatabaseServices.Entity[],System.Boolean)
Checks whether cross section curves are valid for the lofting operation. This function is called by CreateLoftedSurface() and CreateLoftedSolid(), so it is not necessary for an application to call this function.
crossSectionCurves:  Input list of cross-section curves
displayErrorMessages:  Input Boolean whether or not to display error messages

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckGuideCurves(Autodesk.AutoCAD.DatabaseServices.Entity[],System.Boolean)
Checks whether guide curves are valid for lofting operation. This function is called by CreateLoftedSurface() and CreateLoftedSolid(), so it is not necessary for an application to call this function.
guideCurves:  Input list of guide curves
displayErrorMessages:  Input Boolean whether or not to display error messages

Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckPathCurve(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
Checks for valid combinations of options.
pathCurve:  Input path curve
displayErrorMessages:  Input Boolean whether or not to display error messages

Autodesk.AutoCAD.DatabaseServices.LoftOptions.NormalOption
Accesses the plane normal option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.VirtualGuide
Accesses the state of the virtual guide option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Ruled
Accesses the value of the ruled option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Closed
Accesses the value of the closed option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Simplify
Accesses the value of the simplify option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.AlignDirection
Accesses the value of the AlignDirection option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.NoTwist
Accesses the value of the noTwist option.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.ArcLengthParam
Accesses the arc length parametrization.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftEndMag
Accesses the end draft magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftStartMag
Accesses the start draft magnitude.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftEnd
Accesses the end draft angle in radians.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.DraftStart
Accesses the start draft angle in radians.