Autodesk.AutoCAD.DatabaseServices.ConstrainedLine
This class represents a constrained unbounded line node in the owning Assoc2dConstraintGroup.

Autodesk.AutoCAD.DatabaseServices.ConstrainedLine.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Constructor.
geomDependencyId:  Input ObjectId indicating the AssocGeomDependency object to which this constrained line is holding on.

Autodesk.AutoCAD.DatabaseServices.ConstrainedLine.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.ConstrainedLine.Direction
Gets the direction unit vector of the unbounded line, relative to the work plane of the owning Assoc2dConstraintGroup object.

Autodesk.AutoCAD.DatabaseServices.ConstrainedLine.PointOnLine
Gets some arbitrary point on the unbounded line, relative to the work plane of the owning Assoc2dConstraintGroup object.