Autodesk.AutoCAD.DatabaseServices.SubDMesh
This .NET class wraps the ObjectARX AcDbSubDMesh Class.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.#ctor
Default constructor.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetDragStatus(Autodesk.AutoCAD.DatabaseServices.DragStatus)
This function is called when a drag operation involving this entity is starting, ending, or aborting.
status:  Value describing the status of the drag operation; one of the values from the DragStat enumeration

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetSubDMesh(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Int32Collection,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubDMesh.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetSphere(System.Double,System.Int32,System.Int32,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSphere.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetCylinder(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCylinder.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetCone(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCone.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetTorus(System.Double,System.Int32,System.Int32,System.Double,System.Double,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setTorus.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.Setbox(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setBox.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetWedge(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setWedge.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetPyramid(System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32,System.Double,System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setPyramid.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubdDivideUp
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdDivideUp.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubdDivideDown
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdDivideDown.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubdRefine(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdRefine.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubdRefine
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdRefine.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SplitFace(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d)
This .NET method wraps the ObjectARX method AcDbSubDMesh::splitFace.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ExtrudeFaces(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.Geometry.Point3dCollection,System.Double)
This .NET method wraps the ObjectARX method AcDbSubDMesh::extrudeFaces(const AcDbFullSubentPathArray& subentPaths, const AcGePoint3dArray& alongPath).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ExtrudeFaces(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],System.Double,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
This .NET method wraps the ObjectARX method AcDbSubDMesh::extrudeFaces(const AcDbFullSubentPathArray& subentPaths, double length, const AcGeVector3d& dir, double taper).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ExtrudeConnectedFaces(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.Geometry.Point3dCollection,System.Double)
This wraps the ObjectARX AcDbSubDMesh::extrudeConnectedFaces() method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ExtrudeConnectedFaces(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],System.Double,Autodesk.AutoCAD.Geometry.Vector3d,System.Double)
This wraps the ObjectARX AcDbSubDMesh::extrudeConnectedFaces(const AcDbFullSubentPathArray& subentPaths, double length, const AcGeVector3d& dir, double taper) method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetNumberOfSubDividedFacesAt(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This .NET method wraps the ObjectARX method AcDbSubDMesh::numOfSubDividedFacesAt.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetVertexAt(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getVertexAt.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetVertexAt(System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getVertexAt.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetVertexAt(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setVertexAt.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point3d)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setVertexAt.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetSubDividedVertexAt(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubDividedVertexAt (AcDbSubentId&, AcGePoint3d&).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetSubDividedVertexAt(System.Int32)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubDividedVertexAt(Adesk::Int32, AcGePoint3d&).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetCrease(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],System.Double)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCrease(AcDbFullSubentPathArray&, double).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetCrease(System.Double)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCrease(double).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetCrease(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This .NET method wraps the ObjectARX method AcDbSubDMesh::getCrease.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetCrease(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getCrease.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetAdjacentSubentPath(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.SubentityType)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getAdjacentSubentPath.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetSubentPath(System.Int32,Autodesk.AutoCAD.DatabaseServices.SubentityType)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentPath.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ConvertToSurface(System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX method AcDbSubDMesh::convertToSurface Method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ConvertToSurface(System.Boolean,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::convertToSurface(bool bConvertAsSmooth, const AcDbSubentId& id, AcDbSurface*& pSurface).

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ConvertToSolid(System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX AcDbSubDMesh::convertToSolid.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetSubentColor(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentColor.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetSubentColor(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Colors.Color)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubentColor.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetSubentMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentMaterial.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetSubentMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubentMaterial.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetSubentMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentMaterialMapper.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SetSubentMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.GraphicsInterface.Mapper)
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubentMaterialMapper.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetFacePlane(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSubDMesh::getFacePlane.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ComputeVolume
This .NET method wraps the ObjectARX method AcDbSubDMesh::computeVolume.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ComputeSurfaceArea
This .NET method wraps the ObjectARX method AcDbSubDMesh::computeSurfaceArea.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.MergeFaces(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This wraps the ObjectARX AcDbSubDMesh::mergeFaces() method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.Collapse(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARX AcDbSubDMesh::collapse() method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.Cap(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This wraps the ObjectARX AcDbSubDMesh::cap() method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.Spin(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This wraps the ObjectARX AcDbSubDMesh::spin() method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetObjectMesh(Autodesk.AutoCAD.DatabaseServices.DBObject,Autodesk.AutoCAD.DatabaseServices.MeshFaceterData)
Tessellates existing solid or surface object to mesh data using the given faceter settings.
dbObj:  Input object to get the mesh.
faceterData:  Input faceter setting information.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.VertexColorArray
This wraps the ObjectARX AcDbSubDMesh::getVertexColorArray() and AcDbSubDMesh::setVertexColorArray() methods.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.VertexTextureArray
This wraps the ObjectARX AcDbSubDMesh::getVertexTextureArray() and AcDbSubDMesh::setVertexTextureArray() methods.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.VertexNormalArray
This wraps the ObjectARX AcDbSubDMesh::getVertexNormalArray and AcDbSubDMesh::setVertexNormalArray() methods.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubDividedNormalArray
This .NET property wraps the ObjectARX method AcDbSubDMesh::getSubDividedNormalArray.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubDividedFaceArray
This .NET property wraps the ObjectARX method AcDbSubDMesh::getSubDividedFaceArray.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SubDividedVertices
This .NET property wraps the ObjectARX method AcDbSubDMesh::getSubDividedVertices.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.EdgeArray
This is EdgeArray, a member of class SubDMesh.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.NormalArray
This .NET property wraps the ObjectARX method AcDbSubDMesh::getNormalArray.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.FaceArray
This .NET property wraps the ObjectARX method AcDbSubDMesh::getFaceArray.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.Vertices
This .NET property wraps the ObjectARX method AcDbSubDMesh::getVertices.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.NumberOfEdges
This is NumberOfEdges, a member of class SubDMesh.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.NumberOfSubDividedVertices
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfSubDividedVertices.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.NumberOfVertices
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfVertices.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.NumberOfSubDividedFaces
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfSubDividedFaces.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.NumberOfFaces
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfFaces.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.Watertight
This .NET property wraps the ObjectARX method AcDbSubDMesh::isWatertight.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.SmoothLevel
This .NET property wraps the ObjectARX method AcDbSubDMesh::subdLevel.