Autodesk.AutoCAD.Geometry.ExternalCurve2d
This .NET class wraps the AcGeExternalCurve2d ObjectARX class.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.#ctor
Default constructor.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.Set(System.IntPtr,Autodesk.AutoCAD.Geometry.ExternalEntityKind)
Method to reset the definition of an instance of this class.
surfaceDef:  Input new definition for the external surface
surfaceKind:  Input information concerning the system in which the surface definition was created

Autodesk.AutoCAD.Geometry.ExternalCurve2d.SetToOwnCurve
Forces this instance to own its definition data.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.NurbCurve
Returns gelib native representation for the external curve.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsOwnerOfCurve
Determines whether this instance owns its definition data.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.ExternalCurveKind
Provides information concerning the native system in which the external curve definition was created.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.ExternalCurve
Provides access to the external entity in its native form.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsDefined
Determines whether the instance is empty.

Autodesk.AutoCAD.Geometry.ExternalCurve2d.IsNurbCurve
Determines whether the external curve instance can be represented by a curve definition that is native to gelib.