Autodesk.AutoCAD.DatabaseServices.TextEditorCursor
This wraps the ObjectARX AcDbTextEditorCursor class.

Autodesk.AutoCAD.DatabaseServices.TextEditorCursor.Column
This wraps the ObjectARX AcDbTextEditorCursor::column() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorCursor.Paragraph
This wraps the ObjectARX AcDbTextEditorCursor::paragraph() method.

Autodesk.AutoCAD.DatabaseServices.TextEditorCursor.Location
Gets and sets the current cursor location.