Autodesk.AutoCAD.DatabaseServices.ProxyResurrectionCompletedEventArgs
This class provides data for the ProxyResurrectionCompleted event of the database.

Autodesk.AutoCAD.DatabaseServices.ProxyResurrectionCompletedEventArgs.Ids
Accesses the objects that were resurrected.

Autodesk.AutoCAD.DatabaseServices.ProxyResurrectionCompletedEventArgs.ApplicationName
Accesses the name of the application.