Autodesk.AutoCAD.DatabaseServices.TextEditorColumns
This wraps the ObjectARX AcDbTextEditorColumns class.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.IsFlowReversed
Gets and sets if the flows of all the column objects in editor are reversed.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.TotalWidth
Gets and sets the total width for all the column objects in editor.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.Gutter
Gets and sets the gutter value of the column object in editor.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.Width
Gets and sets the width of the column object in editor.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.AutoHeight
Gets and sets the flag of auto height for all the column objects.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.Type
Gets and sets the type for the column object.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.Count
Gets and sets the count of the column objects in text editor.

Autodesk.AutoCAD.DatabaseServices.TextEditorColumns.MaxCount
This wraps the ObjectARX AcDbTextEditorColumns::maxCount() method.