Autodesk.AutoCAD.Colors.Color
This .NET class wraps the AcCmColor ObjectARX class.

Autodesk.AutoCAD.Colors.Color.#ctor
Default constructor.

Autodesk.AutoCAD.Colors.Color.FromRgb(System.Byte,System.Byte,System.Byte)
Creates a new Color object using the input Red, Green, and Blue channel values.
red:  Input color value 0 to 255
green:  Input color value 0 to 255
blue:  Input color value 0 to 255

Autodesk.AutoCAD.Colors.Color.FromDictionaryName(System.String)
Returns a new color object using a dictionary name.
name:  Input System.String dictionary key

Autodesk.AutoCAD.Colors.Color.FromNames(System.String,System.String)
This function sets the color name and book name.
colorName:  Input color name
bookName:  Input optional book name

Autodesk.AutoCAD.Colors.Color.Equals(System.Object)
Returns the truthiness of the object comparison.
obj:  Input object to find the equivalency

Autodesk.AutoCAD.Colors.Color.op_Inequality(Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.Colors.Color)
Returns true if a is not equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Colors.Color.op_Equality(Autodesk.AutoCAD.Colors.Color,Autodesk.AutoCAD.Colors.Color)
Returns true if a is equal to b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.Colors.Color.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.Colors.Color.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.Colors.Color.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.Colors.Color.CompareTo(System.Object)
Returns a value comparison integer.
obj:  Input object to compare

Autodesk.AutoCAD.Colors.Color.Clone
Clones the object.

Autodesk.AutoCAD.Colors.Color.DwgIn(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's DwgInFields() function, and then reads in any xdata attached to the object.
inputFiler:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.Colors.Color.DwgOut(Autodesk.AutoCAD.DatabaseServices.DwgFiler)
This function does some internal bookkeeping, calls the object's function, and then writes out any xdata attached to the object.
outputFiler:  DWG filer to be used for this filing operation

Autodesk.AutoCAD.Colors.Color.DxfIn(Autodesk.AutoCAD.DatabaseServices.DxfFiler,System.Int32)
This function reads the DXF file specified into the database object and returns the ACI color value.
inputFiler:  Input full path of the DXF file to be read into database
groupCodeOffset:  Input group code offset

Autodesk.AutoCAD.Colors.Color.DxfOut(Autodesk.AutoCAD.DatabaseServices.DxfFiler,System.Int32)
This function creates an DXF file and writes the ACI color value.
outputFiler:  Input full path of the DXF file to write
groupCodeOffset:  Input group code offset

Autodesk.AutoCAD.Colors.Color.Audit(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
This function is called by AutoCAD when the AUDIT command is executed.
auditInfo:  Input an AuditInfo object

Autodesk.AutoCAD.Colors.Color.DictionaryKey
Accesses the dictionary key.

Autodesk.AutoCAD.Colors.Color.DictionaryKeyLength
Accesses the dictionary key length.

Autodesk.AutoCAD.Colors.Color.EntityColor
Accesses the entity color.

Autodesk.AutoCAD.Colors.Color.HasBookName
Assesses if a book name exists.

Autodesk.AutoCAD.Colors.Color.HasColorName
Assesses if a color name exists.

Autodesk.AutoCAD.Colors.Color.ColorNameForDisplay
Accesses the color name for the display.

Autodesk.AutoCAD.Colors.Color.BookName
Accesses the book name.

Autodesk.AutoCAD.Colors.Color.ColorName
Accesses the color name.

Autodesk.AutoCAD.Colors.Color.PenIndex
Assesses the pen index.

Autodesk.AutoCAD.Colors.Color.ColorIndex
Accesses the color index.

Autodesk.AutoCAD.Colors.Color.Blue
Accesses the blue component of the color value in the range 0 to 255.

Autodesk.AutoCAD.Colors.Color.Green
Accesses the green component of the color value in the range 0 to 255.

Autodesk.AutoCAD.Colors.Color.Red
Accesses the red component of the color value in the range 0 to 255.

Autodesk.AutoCAD.Colors.Color.IsNone
Assesses if there is no color.

Autodesk.AutoCAD.Colors.Color.IsForeground
Assesses if the color is from the foreground.

Autodesk.AutoCAD.Colors.Color.IsByPen
Assesses if the color is by a pen.

Autodesk.AutoCAD.Colors.Color.IsByAci
Assesses if the color is defined by ACI.

Autodesk.AutoCAD.Colors.Color.IsByBlock
Assesses if the color is by a block.

Autodesk.AutoCAD.Colors.Color.IsByLayer
Wrap the ObjectARX function AcCmColor.isByLayer().

Autodesk.AutoCAD.Colors.Color.IsByColor
Assesses if the color is by another color.

Autodesk.AutoCAD.Colors.Color.Explanation
Accesses the explanation.

Autodesk.AutoCAD.Colors.Color.Description
Accesses the description.

Autodesk.AutoCAD.Colors.Color.ColorMethod
Accesses the color method.

Autodesk.AutoCAD.Colors.Color.ColorValue
Accesses the color value.